----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 opened on:  23 Feb 2018, 00:53:41

. 
. di as txt "Current user: `c(username)'" _n "Environment: `c(os)' `c(machine_type)' `: environment computername'" _n "Stata: `c(stata_version)'" cond(c(stata_v
> ersion)==c(version),""," (set to version `c(version)')") _n "Date: " c(current_date) " " c(current_time)
Current user: KKranker
Environment: Windows PC (64-bit x86-64) KKRANKER
Stata: 15.1
Date: 23 Feb 2018 00:53:41

. desc, short

Contains data from C:\Users\kkranker\Documents\Stata\Multiple-Equation-Models\simple_cattaneo_data.dta
  obs:         4,642                          Cattaneo (2010) study on the effect of maternal smoking on birth weight
 vars:            20                          8 Apr 2015 05:07
 size:       357,434                          
Sorted by: 
     Note: Dataset has changed since last saved.

. local varlist : copy local varlist_orig

. summ `treatvar' `varlist' `tousevar' `wgtvar' `depvars'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       treat |      4,642    .1861267    .3892508          0          1
          x1 |      4,642    .6996984    .4584385          0          1
        1.x2 |      4,642    .0340371    .1813439          0          1
-------------+---------------------------------------------------------
        1.x3 |      4,642    .0534252    .2249042          0          1
          x4 |      4,642    .4379578    .4961893          0          1
          x5 |      4,642    26.50452    5.619026         13         45
          x6 |      4,642    12.68957    2.520661          0         17
          x7 |      4,642    6.540069    3.359167          1         12
-------------+---------------------------------------------------------
         x90 |      4,642   -.0031039    1.020177  -4.107368   3.325766
         x91 |      4,642   -.0212069    1.008708   -4.16458   3.503644
         x92 |      4,642    .0076449    1.004589  -3.449011   3.959166
         x93 |      4,642    .0049339    1.004513  -4.274254   3.777972
         x94 |      4,642    .0124264    .9818583  -3.659006   3.658309
-------------+---------------------------------------------------------
         x95 |      4,642    .0044283    1.010194   -3.41615   3.724456
       touse |      4,642    .1077122      .31005          0          1
         wgt |      4,642    1.993316    .4062602   .6638338   3.540576
          y1 |      4,642     3361.68    578.8196        340       5500
   y1_binary |      4,642    .9396812    .2381022          0          1

. 
. 
. // * UNWEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. cbps `treatvar' `varlist' if `tousevar' , ate logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00451406  
Iteration 2:   f(p) =   .0005336  
Iteration 3:   f(p) =  .00001373  
Iteration 4:   f(p) =  2.637e-08  
Iteration 5:   f(p) =  6.777e-13  
Iteration 6:   f(p) =  1.066e-21  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.441064   .5046768    -2.86   0.004    -2.430213   -.4519161
        1.x2 |  -2.548784   3.501511    -0.73   0.467     -9.41162    4.314051
        1.x3 |   -1.02318   2.005094    -0.51   0.610    -4.953091    2.906732
          x4 |  -.2320966   .5678014    -0.41   0.683    -1.344967    .8807737
          x5 |   .0736983    .042799     1.72   0.085    -.0101862    .1575829
          x6 |  -.4863391   .1923869    -2.53   0.011    -.8634106   -.1092676
          x7 |   .0655415   .0720901     0.91   0.363    -.0757525    .2068354
         x90 |   .0303861    .203675     0.15   0.881    -.3688096    .4295819
         x91 |  -.0236437   .2499136    -0.09   0.925    -.5134655     .466178
         x92 |   .2014652   .2092517     0.96   0.336    -.2086606    .6115911
         x93 |  -.0067202   .2511949    -0.03   0.979    -.4990531    .4856126
         x94 |  -.3662317   .2431817    -1.51   0.132     -.842859    .1103956
         x95 |  -.0080118   .2531324    -0.03   0.975    -.5041423    .4881187
       _cons |   3.127763   1.826429     1.71   0.087    -.4519713    6.707497
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  2.590e-08  
Iteration 1:   f(p) =  2.548e-08  (backed up)
Iteration 2:   f(p) =  1.980e-08  
Iteration 3:   f(p) =  1.652e-08  
Iteration 4:   f(p) =  1.627e-08  
Iteration 5:   f(p) =  1.540e-08  
Iteration 6:   f(p) =  1.451e-08  
Iteration 7:   f(p) =  1.377e-08  
Iteration 8:   f(p) =  1.290e-08  
Iteration 9:   f(p) =  1.195e-08  
Iteration 10:  f(p) =  1.168e-08  
Iteration 11:  f(p) =  1.075e-08  
Iteration 12:  f(p) =  1.026e-08  
Iteration 13:  f(p) =  1.005e-08  
Iteration 14:  f(p) =  9.508e-09  
Iteration 15:  f(p) =  9.073e-09  
Iteration 16:  f(p) =  6.349e-09  
Iteration 17:  f(p) =  2.695e-09  
Iteration 18:  f(p) =  2.271e-09  
Iteration 19:  f(p) =  1.849e-09  
Iteration 20:  f(p) =  1.334e-09  
Iteration 21:  f(p) =  1.242e-09  
Iteration 22:  f(p) =  1.145e-09  
Iteration 23:  f(p) =  9.775e-10  
Iteration 24:  f(p) =  9.423e-10  
Iteration 25:  f(p) =  9.361e-10  
Iteration 26:  f(p) =  9.197e-10  
Iteration 27:  f(p) =  9.148e-10  
Iteration 28:  f(p) =  9.028e-10  
Iteration 29:  f(p) =  6.168e-10  
Iteration 30:  f(p) =  3.388e-10  
Iteration 31:  f(p) =  2.990e-10  
Iteration 32:  f(p) =  2.966e-10  
Iteration 33:  f(p) =  2.820e-10  
Iteration 34:  f(p) =  1.500e-10  
Iteration 35:  f(p) =  9.031e-12  
Iteration 36:  f(p) =  1.043e-12  
Iteration 37:  f(p) =  6.577e-15  
Iteration 38:  f(p) =  4.594e-17  
Iteration 39:  f(p) =  5.798e-19  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441065
        1.x2 |  -2.548794
        1.x3 |  -1.023179
          x4 |  -.2320976
          x5 |   .0736983
          x6 |  -.4863392
          x7 |   .0655416
         x90 |    .030386
         x91 |  -.0236433
         x92 |   .2014656
         x93 |  -.0067197
         x94 |  -.3662317
         x95 |  -.0080123
       _cons |   3.127765
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408      .161      .168    .00228    .00588     .0177     .0388      .102      .214        .4      .697      .887
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92      .289      .189     .0343     .0343     .0927      .126      .242      .423      .526      .928      .928
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500      .185      .179    .00228    .00648     .0207     .0485       .12      .268      .461      .712      .928
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6750467   .6750467  -3.75e-09  -7.99e-09   .4688264   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0219358   .0219357   1.52e-07   1.04e-06   .1466204   1.008518
             |
          x3 |
          0  |  (empty)
          1  |  .0370067   .0370067   1.02e-09   5.38e-09   .1889672   1.008511
             |
          x4 |  .4861037   .4861037   4.17e-08   8.34e-08   .5003074   1.008511
          x5 |  26.25386   26.25386  -4.71e-07  -7.51e-08   6.268994   .6747771
          x6 |  12.63471   12.63471   9.66e-08   4.12e-08   2.343236   .5637224
          x7 |  6.724952   6.724952  -3.81e-07  -1.13e-07   3.360602   1.190087
         x90 | -.0592243  -.0592246   2.95e-07   2.83e-07   1.042785   1.206644
         x91 |  .0116969   .0116974  -4.69e-07  -4.78e-07   .9810721   .9436962
         x92 | -.0041245  -.0041244  -9.92e-08  -9.72e-08   1.020036   1.339887
         x93 |  .0443805    .044381  -4.74e-07  -4.90e-07   .9681889   .8469642
         x94 | -.0856691  -.0856689  -1.55e-07  -1.53e-07   1.015864   .7767336
         x95 | -.0859152  -.0859155   3.13e-07   3.20e-07   .9766878   .8347648
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  7.44012e-16
  Mean absolute standardized diff.
  2.44863e-07
  Maximum absolute standardized diff.
  1.03588e-06
  C.V. of matching weights:
  .5275376137
  S.D. of matching weights:
  .5275376137
  Skewness of matching weights:
  .2158746889
  Kurtosis of matching weights:
  .0860728844
  Maximum matching weight:
  6.906402312

. return list

scalars:
         r(mean_sd_sq) =  7.44012060247e-16
           r(mean_asd) =  2.44863253164e-07
            r(max_asd) =  1.03587592291e-06
             r(wgt_cv) =  .5275376137053941
             r(wgt_sd) =  .5275376137053942
       r(wgt_skewness) =  .2158746888783258
       r(wgt_kurtosis) =  .0860728844158552
            r(wgt_max) =  6.906402311867948

matrices:
                r(bal) :  15 x 6

. 
. cbps `treatvar' `varlist' if `tousevar' , ate over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .02441999  (not concave)
Iteration 1:   f(p) =    .020112  
Iteration 2:   f(p) =  .01484746  
Iteration 3:   f(p) =   .0142955  
Iteration 4:   f(p) =  .01428412  
Iteration 5:   f(p) =  .01428407  
Iteration 6:   f(p) =  .01428407  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.074574   .2572873    -4.18   0.000    -1.578848      -.5703
        1.x2 |  -1.732571    .847337    -2.04   0.041    -3.393321   -.0718214
        1.x3 |   -.535995   .6259896    -0.86   0.392    -1.762912    .6909221
          x4 |  -.2389831   .2458124    -0.97   0.331    -.7207666    .2428004
          x5 |   .0484453   .0243181     1.99   0.046     .0007828    .0961078
          x6 |  -.2519975   .0459113    -5.49   0.000    -.3419819    -.162013
          x7 |   .0081703   .0322545     0.25   0.800    -.0550474    .0713879
         x90 |    .120204   .1075227     1.12   0.264    -.0905366    .3309445
         x91 |  -.1467757   .1099013    -1.34   0.182    -.3621782    .0686269
         x92 |   .1315867   .1151671     1.14   0.253    -.0941367    .3573101
         x93 |    .086207   .1113523     0.77   0.439    -.1320395    .3044534
         x94 |  -.1702521    .103099    -1.65   0.099    -.3723225    .0318183
         x95 |   .0217906    .112224     0.19   0.846    -.1981643    .2417456
       _cons |   1.206345   .6074599     1.99   0.047      .015746    2.396945
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>7.142, 14) = 0.929

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  9.768e-08  
Iteration 1:   f(p) =  9.599e-08  (backed up)
Iteration 2:   f(p) =  7.672e-08  
Iteration 3:   f(p) =  6.399e-08  
Iteration 4:   f(p) =  6.304e-08  
Iteration 5:   f(p) =  6.026e-08  
Iteration 6:   f(p) =  5.854e-08  
Iteration 7:   f(p) =  5.801e-08  
Iteration 8:   f(p) =  5.780e-08  
Iteration 9:   f(p) =  5.775e-08  
Iteration 10:  f(p) =  5.764e-08  
Iteration 11:  f(p) =  5.743e-08  
Iteration 12:  f(p) =  5.722e-08  
Iteration 13:  f(p) =  5.718e-08  
Iteration 14:  f(p) =  5.716e-08  
Iteration 15:  f(p) =  5.715e-08  
Iteration 16:  f(p) =  5.715e-08  
Iteration 17:  f(p) =  5.715e-08  
Iteration 18:  f(p) =  5.715e-08  
Iteration 19:  f(p) =  5.714e-08  
Iteration 20:  f(p) =  5.714e-08  
Iteration 21:  f(p) =  5.714e-08  
Iteration 22:  f(p) =  5.714e-08  
Iteration 23:  f(p) =  5.714e-08  
Iteration 24:  f(p) =  5.714e-08  
Iteration 25:  f(p) =  5.714e-08  
Iteration 26:  f(p) =  5.714e-08  
Iteration 27:  f(p) =  5.714e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + IPW (overidentified)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.074574
        1.x2 |  -1.732572
        1.x3 |  -.5359934
          x4 |  -.2389832
          x5 |   .0484453
          x6 |  -.2519976
          x7 |   .0081703
         x90 |    .120204
         x91 |  -.1467759
         x92 |   .1315865
         x93 |   .0862072
         x94 |   -.170252
         x95 |   .0217913
       _cons |   1.206346
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408      .173      .114     .0142     .0324     .0574     .0892       .14      .232      .346      .487      .672
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92      .274       .13     .0508     .0508      .131      .157      .271      .373       .42      .673      .673
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500      .191      .123     .0142     .0339     .0609     .0967      .153      .263      .381       .55      .673
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6406563   .7027892  -.0621329  -.1343717   .4623962   1.111543
             |
          x2 |
          0  |  (empty)
          1  |  .0157701   .0233767  -.0076066  -.0518321   .1467555   .6856468
             |
          x3 |
          0  |  (empty)
          1  |  .0248069   .0398362  -.0150293  -.0794677   .1891246   .6378531
             |
          x4 |  .4886895   .4862356   .0024538   .0049045   .5003233   1.008759
          x5 |  25.82556   26.34781  -.5222466   -.087499   5.968599     .75999
          x6 |  12.33004    12.9064  -.5763636  -.2576162   2.237296   .5881094
          x7 |  6.884519   6.669732   .2147874   .0639212   3.360189   1.180429
         x90 | -.0713185  -.0265029  -.0448156  -.0441807   1.014371   1.157748
         x91 |  .0200092   -.022611   .0426201   .0430283   .9905145   .9174008
         x92 |  .0040224  -.0083768   .0123991   .0121514   1.020391   1.200576
         x93 |   .022949   .0551791  -.0322301    -.03319   .9710768   .8891007
         x94 | -.1215951  -.0231316  -.0984635  -.0994522    .990058   .8143466
         x95 |  -.095014  -.0715949  -.0234192  -.0239414   .9781896   .8041465
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0027971537
  Mean absolute standardized diff.
  .0719658737
  Maximum absolute standardized diff.
  .2576161712
  C.V. of matching weights:
  .2958977281
  S.D. of matching weights:
  .2958977281
  Skewness of matching weights:
  .1574499129
  Kurtosis of matching weights:
  .0654319376
  Maximum matching weight:
  4.204591908

. 
. cbps `treatvar' `varlist' if `tousevar' , att logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00006892  
Iteration 2:   f(p) =  1.777e-07  
Iteration 3:   f(p) =  2.570e-12  
Iteration 4:   f(p) =  6.940e-22  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.339291   .3615444    -3.70   0.000    -2.047905   -.6306769
        1.x2 |  -1.525175    1.19071    -1.28   0.200    -3.858923    .8085728
        1.x3 |  -.5996277   .8424377    -0.71   0.477    -2.250775     1.05152
          x4 |  -.3183658   .3103113    -1.03   0.305    -.9265647    .2898331
          x5 |   .0587883     .02835     2.07   0.038     .0032234    .1143533
          x6 |  -.2435676   .0675718    -3.60   0.000    -.3760059   -.1111292
          x7 |   .0341034   .0400884     0.85   0.395    -.0444685    .1126752
         x90 |    .158599   .1286436     1.23   0.218    -.0935378    .4107357
         x91 |  -.1617619    .131618    -1.23   0.219    -.4197284    .0962045
         x92 |   .1391156   .1358437     1.02   0.306    -.1271333    .4053644
         x93 |   .0571151    .134574     0.42   0.671    -.2066451    .3208752
         x94 |  -.1175052   .1193236    -0.98   0.325    -.3513752    .1163649
         x95 |    .011505   .1383574     0.08   0.934    -.2596705    .2826805
       _cons |    .782858    .962964     0.81   0.416    -1.104517    2.670233
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.603e-10  
Iteration 14:  f(p) =  7.497e-10  
Iteration 15:  f(p) =  4.770e-10  
Iteration 16:  f(p) =  2.775e-10  
Iteration 17:  f(p) =  7.322e-11  
Iteration 18:  f(p) =  4.498e-11  
Iteration 19:  f(p) =  4.378e-11  
Iteration 20:  f(p) =  3.530e-11  
Iteration 21:  f(p) =  2.767e-11  
Iteration 22:  f(p) =  4.064e-12  
Iteration 23:  f(p) =  1.177e-12  
Iteration 24:  f(p) =  1.153e-12  
Iteration 25:  f(p) =  1.039e-12  
Iteration 26:  f(p) =  7.868e-13  
Iteration 27:  f(p) =  5.115e-13  
Iteration 28:  f(p) =  5.779e-14  
Iteration 29:  f(p) =  1.997e-16  
Iteration 30:  f(p) =  5.001e-19  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339292
        1.x2 |  -1.525174
        1.x3 |  -.5996287
          x4 |   -.318366
          x5 |   .0587884
          x6 |  -.2435673
          x7 |   .0341033
         x90 |   .1585989
         x91 |   -.161762
         x92 |   .1391156
         x93 |    .057115
         x94 |   -.117505
         x95 |   .0115049
       _cons |   .7828542
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913  -2.98e-08  -5.98e-08   .4994352   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696  -8.86e-09  -8.54e-08   .1037929    1.00851
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217391   1.28e-08   8.75e-08   .1459765   1.008512
             |
          x4 |  .4347826   .4347825   1.48e-07   2.98e-07   .4962249   1.008511
          x5 |  25.46739   25.46739  -3.24e-06  -4.86e-07   6.664728   .6195799
          x6 |  11.86957   11.86957  -1.04e-06  -5.11e-07   2.043536   .5669465
          x7 |  6.858696   6.858695   9.88e-07   2.94e-07   3.363971   1.145237
         x90 |  .0972024   .0972023   1.26e-07   1.24e-07   1.021603    .845302
         x91 | -.0890157  -.0890157   5.80e-08   6.07e-08   .9556678   .9654928
         x92 |  .0453787   .0453788  -1.17e-07  -1.17e-07   .9971708   1.136731
         x93 |  .0865687   .0865687  -1.43e-09  -1.50e-09     .95074   .9577067
         x94 | -.1299173  -.1299171  -1.59e-07  -1.55e-07    1.02511   .7795321
         x95 | -.0807251  -.0807251  -1.58e-08  -1.65e-08   .9586344   .8888006
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.92042e-15
  Mean absolute standardized diff.
  1.76706e-07
  Maximum absolute standardized diff.
  5.11239e-07
  C.V. of matching weights:
  .8926802189
  S.D. of matching weights:
  .8926802189
  Skewness of matching weights:
  .110007814
  Kurtosis of matching weights:
  .0225364323
  Maximum matching weight:
  7.032258968

. 
. cbps `treatvar' `varlist' if `tousevar' , att over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .04521356  
Iteration 1:   f(p) =  .03210384  
Iteration 2:   f(p) =   .0303286  
Iteration 3:   f(p) =   .0302734  
Iteration 4:   f(p) =  .03027339  
Iteration 5:   f(p) =  .03027339  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.171988   .2187737    -5.36   0.000    -1.600776   -.7431991
        1.x2 |  -1.909814   .6607307    -2.89   0.004    -3.204822   -.6148052
        1.x3 |  -.4402667   .7269474    -0.61   0.545    -1.865057     .984524
          x4 |  -.3130788   .2251092    -1.39   0.164    -.7542848    .1281272
          x5 |   .0503881   .0191417     2.63   0.008     .0128711    .0879051
          x6 |  -.2393185   .0575186    -4.16   0.000     -.352053   -.1265841
          x7 |   .0261168   .0311563     0.84   0.402    -.0349484    .0871821
         x90 |   .1425533   .1007579     1.41   0.157    -.0549285    .3400351
         x91 |  -.1282785   .1127153    -1.14   0.255    -.3491964    .0926393
         x92 |      .1073   .1112316     0.96   0.335    -.1107099    .3253099
         x93 |   .0527165   .1101053     0.48   0.632    -.1630859    .2685189
         x94 |  -.1248021   .0971592    -1.28   0.199    -.3152305    .0656263
         x95 |   .0220743   .1115296     0.20   0.843    -.1965196    .2406683
       _cons |   .9132207   .6048419     1.51   0.131    -.2722476    2.098689
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>15.137, 14) = 0.369

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  1.809e-07  
Iteration 1:   f(p) =  1.775e-07  (backed up)
Iteration 2:   f(p) =  1.749e-07  
Iteration 3:   f(p) =  1.665e-07  
Iteration 4:   f(p) =  1.593e-07  
Iteration 5:   f(p) =  1.436e-07  
Iteration 6:   f(p) =  1.400e-07  
Iteration 7:   f(p) =  1.356e-07  
Iteration 8:   f(p) =  1.328e-07  
Iteration 9:   f(p) =  1.272e-07  
Iteration 10:  f(p) =  1.231e-07  
Iteration 11:  f(p) =  1.224e-07  
Iteration 12:  f(p) =  1.220e-07  
Iteration 13:  f(p) =  1.219e-07  
Iteration 14:  f(p) =  1.218e-07  
Iteration 15:  f(p) =  1.217e-07  
Iteration 16:  f(p) =  1.213e-07  
Iteration 17:  f(p) =  1.212e-07  
Iteration 18:  f(p) =  1.212e-07  
Iteration 19:  f(p) =  1.212e-07  
Iteration 20:  f(p) =  1.211e-07  
Iteration 21:  f(p) =  1.211e-07  
Iteration 22:  f(p) =  1.211e-07  
Iteration 23:  f(p) =  1.211e-07  
Iteration 24:  f(p) =  1.211e-07  
Iteration 25:  f(p) =  1.211e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + IPW (overidentified)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171988
        1.x2 |  -1.909811
        1.x3 |  -.4402666
          x4 |  -.3130787
          x5 |   .0503881
          x6 |  -.2393185
          x7 |   .0261168
         x90 |   .1425533
         x91 |  -.1282785
         x92 |      .1073
         x93 |   .0527165
         x94 |  -.1248021
         x95 |   .0220743
       _cons |   .9132204
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408      .164      .111     .0101     .0291     .0535     .0814       .13      .221       .34      .472      .599
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .151       .26      .364      .429      .666      .666
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500      .183      .122     .0101     .0298     .0577     .0913      .147      .253      .376      .555      .666
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0498389   .5003503   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0376593   .0897825   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0130452    .151158   .9265074
             |
          x4 |  .4347826    .438673  -.0038904  -.0078335   .4966326   1.006495
          x5 |  25.46739   25.45801   .0093786   .0014149   6.628535   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0123239     2.0564    .559006
          x7 |  6.858696   6.790863   .0678325    .020134    3.36906   1.140985
         x90 |  .0972024   .0826851   .0145173    .014215   1.021263   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0227622   .9619657   .9503048
         x92 |  .0453787   .0235132   .0218655   .0219385   .9966695   1.138269
         x93 |  .0865687   .0849356    .001633   .0017143   .9526181   .9531308
         x94 | -.1299173  -.1339674   .0040502   .0039553   1.023979   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0064787   .9600495   .8856706
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  7.49043e-07
  Mean absolute standardized diff.
  .0164087554
  Maximum absolute standardized diff.
  .0498389406
  C.V. of matching weights:
  .8268864376
  S.D. of matching weights:
  .8268864376
  Skewness of matching weights:
  .1040781342
  Kurtosis of matching weights:
  .0213436959
  Maximum matching weight:
  6.683350174

. 
. // After calling gmatch, the data is stored in a class instance named gmatch_ado_most_recent
. // You can print any of the public functions or variables to the screen with gmatchcall. For example:
. gmatchcall diff()
                  1              2              3              4              5              6              7              8              9             10
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
  1 |  -.0249369272              0    .0033811478              0   -.0019718912   -.0038903611    .0093785703   -.0253427773    .0678325259    .0145172979
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
                 11             12             13             14             15
     ----------------------------------------------------------------------------+
  1    -.0218964965    .0218654599    .0016330378    .0040501655   -.0062199103  |
     ----------------------------------------------------------------------------+

. gmatchcall balancetable()
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0497079   .5016695   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0324308   .1042572   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0134481   .1466296   .9265074
             |
          x4 |  .4347826    .438673  -.0038904   -.007805   .4984448   1.006495
          x5 |  25.46739   25.45801   .0093786   .0017228   5.443922   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0157893   1.605057    .559006
          x7 |  6.858696   6.790863   .0678325   .0190717   3.556704   1.140985
         x90 |  .0972024   .0826851   .0145173   .0152207   .9537854   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0232212   .9429542   .9503048
         x92 |  .0453787   .0235132   .0218655    .020801   1.051175   1.138269
         x93 |  .0865687   .0849356    .001633   .0017466   .9349714   .9531308
         x94 | -.1299173  -.1339674   .0040502   .0043795   .9248091   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0068051    .914005   .8856706
-------------------------------------------------------------------------------
  
                   1              2              3              4              5              6
     +-------------------------------------------------------------------------------------------+
   1 |   .4673913043    .4923282315   -.0249369272   -.0497078844    .5016694537    1.004458062  |
   2 |             0              0              0              .              0              .  |
   3 |   .0108695652    .0074884174    .0033811478    .0324308301     .104257207    1.458884092  |
   4 |             0              0              0              .              0              .  |
   5 |   .0217391304    .0237110216   -.0019718912   -.0134481117    .1466295976    .9265073696  |
   6 |   .4347826087    .4386729698   -.0038903611    -.007804999    .4984447863    1.006494789  |
   7 |    25.4673913    25.45801273    .0093785703    .0017227598    5.443922081    .6273161793  |
   8 |   11.86956522    11.89490799   -.0253427773   -.0157893365    1.605056511    .5590060131  |
   9 |   6.858695652    6.790863126    .0678325259    .0190717377    3.556703999    1.140985233  |
  10 |   .0972024365    .0826851386    .0145172979     .015220718    .9537853564    .8460036645  |
  11 |  -.0890156845    -.067119188   -.0218964965   -.0232211655    .9429542393    .9503048098  |
  12 |   .0453786792    .0235132193    .0218654599    .0208009623    1.051175404    1.138268863  |
  13 |   .0865686693    .0849356315    .0016330378    .0017466178    .9349714429    .9531308458  |
  14 |  -.1299172593   -.1339674248    .0040501655    .0043794613    .9248090545    .7815571151  |
  15 |  -.0807250915   -.0745051812   -.0062199103   -.0068051164    .9140049864    .8856705713  |
     +-------------------------------------------------------------------------------------------+

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00032638  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  8.089e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  5.298e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.466e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.466e-13  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206443
        1.x2 |  -1.628676
        1.x3 |  -.5803099
          x4 |  -.2832337
          x5 |    .069416
          x6 |   -.278787
          x7 |   .0283208
         x90 |   .1446874
         x91 |  -.1322013
         x92 |   .1288213
         x93 |   .0633599
         x94 |  -.1645469
         x95 |   .0190734
       _cons |    1.37953
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408      .232      .146     .0183     .0376     .0766      .119      .196      .313      .465      .614      .804
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .364      .163     .0707     .0707      .176      .215      .347      .492      .558      .798      .798
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500      .257      .158     .0183     .0409     .0838      .136      .216       .35      .497      .687      .804
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5065699  -.0391786  -.0782789   .5005003   1.004395
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094032   .0014663   .0149666   .0979729    1.16405
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217076   .0000315    .000216   .1458921   1.009943
             |
          x4 |  .4347826   .4181838   .0165988   .0335836   .4942521   1.018627
          x5 |  25.46739   26.05539  -.5880032  -.0858609   6.848323   .5832672
          x6 |  11.86957   11.79935   .0702201   .0339782   2.066626   .5528997
          x7 |  6.858696    6.77528   .0834157   .0247604   3.368912   1.141156
         x90 |  .0972024    .056997   .0402054   .0394186    1.01996   .8487816
         x91 | -.0890157   -.062197  -.0268186  -.0280778   .9551534   .9668971
         x92 |  .0453787   .0391245   .0062542    .006305   .9919318   1.151879
         x93 |  .0865687     .10444  -.0178714  -.0188337   .9489023   .9622811
         x94 | -.1299173  -.1873487   .0574314    .054986   1.044474   .7465149
         x95 | -.0807251  -.0886595   .0079344   .0082921   .9568576   .8927751
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.76089e-07
  Mean absolute standardized diff.
  .0328890789
  Maximum absolute standardized diff.
  .0858609075
  C.V. of matching weights:
  .9404771682
  S.D. of matching weights:
  .9404771682
  Skewness of matching weights:
  .1710872074
  Kurtosis of matching weights:
  .0624911056
  Maximum matching weight:
  11.09495523

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .02141594  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .02005607  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01097598  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00782372  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00292673  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00193285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00085471  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00063406  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00028285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013476  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00008047  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00006324  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =   .0000443  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00003941  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00003494  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001414  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  9.450e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  8.233e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.845e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.918e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  1.597e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 21:  f(p) =  1.597e-07  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = sum(stddiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339094
        1.x2 |  -1.522718
        1.x3 |  -.6024625
          x4 |  -.3184011
          x5 |   .0587701
          x6 |  -.2435594
          x7 |   .0341083
         x90 |   .1586104
         x91 |  -.1617897
         x92 |   .1392853
         x93 |   .0571801
         x94 |  -.1174441
         x95 |   .0116348
       _cons |   1.412923
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .254      .155     .0236     .0502     .0875      .137      .212      .346        .5       .66      .749
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .395      .175     .0785     .0785      .186      .232      .402      .539      .614      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500       .28      .168     .0236     .0505     .0938      .153      .236      .392      .545      .727      .805
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673974  -6.08e-06  -.0000122   .4994355   1.008509
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .010884  -.0000145  -.0001394   .1038487   1.007184
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216918   .0000474   .0003248   .1458496   1.010664
             |
          x4 |  .4347826   .4347918  -9.14e-06  -.0000184   .4962259   1.008506
          x5 |  25.46739   25.46699   .0004057   .0000609   6.664567   .6196141
          x6 |  11.86957   11.86965  -.0000811  -.0000397   2.043542   .5669426
          x7 |  6.858696   6.858709  -.0000131  -3.88e-06   3.363952   1.145253
         x90 |  .0972024   .0972214   -.000019  -.0000186   1.021601   .8453063
         x91 | -.0890157  -.0890341   .0000185   .0000193    .955674   .9654774
         x92 |  .0453787   .0455053  -.0001267   -.000127   .9971686   1.136737
         x93 |  .0865687   .0866238  -.0000552   -.000058   .9507388   .9577098
         x94 | -.1299173  -.1298667  -.0000506  -.0000493   1.025095   .7795587
         x95 | -.0807251  -.0806563  -.0000688  -.0000718   .9586108   .8888531
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.05273e-10
  Mean absolute standardized diff.
  .0000725604
  Maximum absolute standardized diff.
  .0003247718
  C.V. of matching weights:
  .8926405827
  S.D. of matching weights:
  .8926405827
  Skewness of matching weights:
  .1100109795
  Kurtosis of matching weights:
  .0225378368
  Maximum matching weight:
  7.03125857

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet stdprogdiff depvars(`depvars') treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00185472  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00101577  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =   .0002704  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  7.076e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.219e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.547e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  2.547e-12  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = sum(stdprogdiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206434
        1.x2 |  -1.628883
        1.x3 |   -.580152
          x4 |  -.2842212
          x5 |   .0680363
          x6 |  -.2812698
          x7 |   .0362345
         x90 |   .1401282
         x91 |   -.133367
         x92 |   .1293801
         x93 |   .0654362
         x94 |  -.1708387
         x95 |   .0205359
       _cons |   1.379493
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408       .23      .147     .0179     .0369     .0748      .118      .193       .31      .464      .614        .8
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .362      .164      .072      .072      .169       .21      .349      .492      .552      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .944     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500         1      .944     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500      .255      .158     .0179     .0405      .082      .134      .213      .347      .496      .689      .805
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5034068  -.0360155  -.0719604   .5004904   1.004268
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094204   .0014491   .0147805   .0980432   1.161946
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216619   .0000773     .00053   .1457695   1.012028
             |
          x4 |  .4347826    .420126   .0146566   .0296392   .4945025   1.017314
          x5 |  25.46739   25.99279  -.5253974  -.0767625   6.844454   .5838659
          x6 |  11.86957   11.78734   .0822301   .0398713   2.062387   .5554979
          x7 |  6.858696    6.85807    .000626    .000186   3.365518   1.143915
         x90 |  .0972024   .0536869   .0435155   .0426391   1.020555   .8476454
         x91 | -.0890157  -.0631465  -.0258691  -.0270977   .9546604   .9681028
         x92 |  .0453787   .0348443   .0105344   .0106297   .9910355   1.154518
         x93 |  .0865687   .1037551  -.0171864  -.0180922   .9499352    .959736
         x94 | -.1299173  -.1918304   .0619131   .0593714    1.04281   .7493641
         x95 | -.0807251  -.0849593   .0042343   .0044214   .9576693    .890953
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  3.93589e-07
  Mean absolute standardized diff.
  .0304601076
  Maximum absolute standardized diff.
  .0767625008
  C.V. of matching weights:
  .9444991013
  S.D. of matching weights:
  .9444991013
  Skewness of matching weights:
  .1663204641
  Kurtosis of matching weights:
  .0587514763
  Maximum matching weight:
  10.93720736
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.984     3424.984  -.0000638  -4.04e-07   3424.984
   y1_binary |    .9469116     .9469117  -8.37e-08  -1.54e-06   .9469117
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.

. 
. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.978e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -365.5251   68.93598    -5.30   0.000    -500.6371   -230.4131
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3417.895   43.41569    78.72   0.000     3332.801    3502.988
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3417.8947

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752   -.0090577      1.338962   .9989677
                  |
               x2 |
               1  |  -.1180374    .0096998      .4133173   1.098626
                  |
               x3 |
               1  |  -.1253201    .0022927      .5085817   1.015318
                  |
               x4 |  -.1207472   -.0222549      .9914484   .9947225
               x5 |  -.1944638    .0308855      .8589874   .5917507
               x6 |  -.6542694    .0952268      .4958356   .5601212
               x7 |   .0473848    .0429284      1.160037   1.132231
              x90 |   .1499304    .0130255      .9289414   .8182649
              x91 |  -.0833726   -.0288848      .8791918   .9584288
              x92 |   .0662245    .0110605      1.090179   1.139468
              x93 |   .0479737   -.0087695      .8926169   .9659809
              x94 |  -.1521926    .0562648      .8686432   .7583723
              x95 |  -.0155155     .017858      .8285405   .8879817
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296  -.0090652   .4996633   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0098566   .0999227   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0023004   .1450795   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222576   .4973308   1.003118
          x5 |  25.46739   25.27307   .1943233   .0286772   6.776222    .596745
          x6 |  11.86957   11.68981   .1797533   .0877664   2.048089   .5648484
          x7 |  6.858696   6.711046   .1476493   .0438323   3.368502   1.141787
         x90 |  .0972024   .0841522   .0130502    .012645   1.032043   .8251709
         x91 | -.0890157  -.0615794  -.0274362  -.0287197   .9553102   .9665176
         x92 |  .0453787   .0341522   .0112265   .0113068    .992897   1.149085
         x93 |  .0865687   .0948113  -.0082427  -.0087305     .94412   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0540116   1.033726   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0175493   .9556712   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet ipw averagevariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296  -.0090652   .4996633   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0098566   .0999227   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0023004   .1450795   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222576   .4973308   1.003118
          x5 |  25.46739   25.27307   .1943233   .0286772   6.776222    .596745
          x6 |  11.86957   11.68981   .1797533   .0877664   2.048089   .5648484
          x7 |  6.858696   6.711046   .1476493   .0438323   3.368502   1.141787
         x90 |  .0972024   .0841522   .0130502    .012645   1.032043   .8251709
         x91 | -.0890157  -.0615794  -.0274362  -.0287197   .9553102   .9665176
         x92 |  .0453787   .0341522   .0112265   .0113068    .992897   1.149085
         x93 |  .0865687   .0948113  -.0082427  -.0087305     .94412   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0540116   1.033726   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0175493   .9556712   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , ate aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  1.612e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |   -328.878   82.21905    -4.00   0.000    -490.0244   -167.7316
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3452.527   28.58753   120.77   0.000     3396.497    3508.558
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6643106   .6980937  -.0337831  -.0730952   .4621798   1.067096
             |
          x2 |
          0  |  (empty)
          1  |  .0126474   .0237734   -.011126  -.0762399    .145934   .5426396
             |
          x3 |
          0  |  (empty)
          1  |  .0252967   .0398782  -.0145815  -.0769757   .1894293   .6494649
             |
          x4 |  .5035684   .4859058   .0176626   .0352982    .500383   1.009262
          x5 |  25.88638    26.3268  -.4404207  -.0736253    5.98192   .7436049
          x6 |  12.40345   12.88502  -.4815643   -.214612   2.243884   .5994444
          x7 |  6.783391   6.698872   .0845182   .0251498    3.36059   1.188955
         x90 | -.1279394  -.0237456  -.1041937  -.1022979   1.018533   1.179133
         x91 |  .0259183  -.0177924   .0437107   .0442269   .9883275   .9105384
         x92 |  .0197006  -.0121531   .0318537   .0312437   1.019527   1.201641
         x93 |  .0303493   .0505445  -.0201952  -.0208151   .9702151   .8788976
         x94 |  -.142924  -.0216133  -.1213108  -.1226343   .9892079   .7980325
         x95 | -.0930146  -.0717394  -.0212752  -.0217631   .9775833   .7971968
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0024703949
  Mean absolute standardized diff.
  .0706136183
  Maximum absolute standardized diff.
  .2146119676
  C.V. of matching weights:
  .3337259551
  S.D. of matching weights:
  .3337259551
  Skewness of matching weights:
  .1843123883
  Kurtosis of matching weights:
  .0838509706
  Maximum matching weight:
  4.89816874

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  3.813e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |     319.07   91.15096     3.50   0.000     140.4174    497.7225
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3141.406   87.28586    35.99   0.000     2970.328    3312.483
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.207512   .3268258     3.69   0.000     .5669452    1.848079
                        |
                     x2 |
                     1  |   1.628792   1.054719     1.54   0.123    -.4384199    3.696005
                        |
                     x3 |
                     1  |   .5805318   .8259794     0.70   0.482    -1.038358    2.199422
                     x4 |   .2831153   .2838113     1.00   0.318    -.2731445    .8393752
                     x5 |  -.0545179   .0270259    -2.02   0.044    -.1074878   -.0015481
                     x6 |   .2844593   .0688093     4.13   0.000     .1495955     .419323
                     x7 |   -.023871   .0390129    -0.61   0.541    -.1003349    .0525929
                    x90 |  -.1439494   .1292697    -1.11   0.265    -.3973133    .1094145
                    x91 |   .1331182   .1248073     1.07   0.286    -.1114997    .3777361
                    x92 |  -.1277527    .133834    -0.95   0.340    -.3900625    .1345572
                    x93 |  -.0623585   .1243317    -0.50   0.616    -.3060441    .1813271
                    x94 |   .1663354   .1194682     1.39   0.164    -.0678179    .4004887
                    x95 |   -.017776   .1254901    -0.14   0.887     -.263732    .2281801
                  _cons |  -1.379538   .9297905    -1.48   0.138    -3.201894    .4428177
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ateu ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .7133644        .75  -.0366356  -.0837821   .4372727   1.099818
             |
          x2 |
          0  |  (empty)
          1  |  .0130902   .0269608  -.0138706  -.0897954   .1544686   .4966403
             |
          x3 |
          0  |  (empty)
          1  |  .0261829   .0441176  -.0179347  -.0905493   .1980657    .609761
             |
          x4 |  .5207033    .495098   .0256053   .0511594   .5005007   1.006879
          x5 |  25.99075   26.56863   -.577878  -.1002906   5.762036   .7963305
          x6 |  12.53645   13.15931  -.6228673  -.2813566     2.2138   .6382822
          x7 |  6.764632   6.696078   .0685532   .0204092   3.358927   1.200431
         x90 | -.1840235   -.048508  -.1355155  -.1337092   1.013509   1.263776
         x91 |   .054549  -.0077434   .0622924   .0625861   .9953062   .8955527
         x92 |   .013304  -.0227801   .0360842   .0351881   1.025465    1.21557
         x93 |  .0163448   .0403853  -.0240406  -.0246383   .9757395    .857822
         x94 | -.1461641   .0160559  -.1622201  -.1661874    .976127   .8119355
         x95 |  -.096076  -.0658282  -.0302478  -.0307892   .9824155   .7755988
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0040935914
  Mean absolute standardized diff.
  .0900339258
  Maximum absolute standardized diff.
  .2813566299
  C.V. of matching weights:
  .3545137453
  S.D. of matching weights:
  .3545137453
  Skewness of matching weights:
  .2680619555
  Kurtosis of matching weights:
  .1550433574
  Maximum matching weight:
  5.869225798

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.603e-10  
Iteration 14:  f(p) =  7.497e-10  
Iteration 15:  f(p) =  4.770e-10  
Iteration 16:  f(p) =  2.775e-10  
Iteration 17:  f(p) =  7.322e-11  
Iteration 18:  f(p) =  4.498e-11  
Iteration 19:  f(p) =  4.378e-11  
Iteration 20:  f(p) =  3.530e-11  
Iteration 21:  f(p) =  2.767e-11  
Iteration 22:  f(p) =  4.064e-12  
Iteration 23:  f(p) =  1.177e-12  
Iteration 24:  f(p) =  1.153e-12  
Iteration 25:  f(p) =  1.039e-12  
Iteration 26:  f(p) =  7.868e-13  
Iteration 27:  f(p) =  5.115e-13  
Iteration 28:  f(p) =  5.779e-14  
Iteration 29:  f(p) =  1.997e-16  
Iteration 30:  f(p) =  5.001e-19  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339292
        1.x2 |  -1.525174
        1.x3 |  -.5996287
          x4 |   -.318366
          x5 |   .0587884
          x6 |  -.2435673
          x7 |   .0341033
         x90 |   .1585989
         x91 |   -.161762
         x92 |   .1391156
         x93 |    .057115
         x94 |   -.117505
         x95 |   .0115049
       _cons |   .7828542
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913  -2.98e-08  -5.98e-08   .4994352   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696  -8.86e-09  -8.54e-08   .1037929    1.00851
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217391   1.28e-08   8.75e-08   .1459765   1.008512
             |
          x4 |  .4347826   .4347825   1.48e-07   2.98e-07   .4962249   1.008511
          x5 |  25.46739   25.46739  -3.24e-06  -4.86e-07   6.664728   .6195799
          x6 |  11.86957   11.86957  -1.04e-06  -5.11e-07   2.043536   .5669465
          x7 |  6.858696   6.858695   9.88e-07   2.94e-07   3.363971   1.145237
         x90 |  .0972024   .0972023   1.26e-07   1.24e-07   1.021603    .845302
         x91 | -.0890157  -.0890157   5.80e-08   6.07e-08   .9556678   .9654928
         x92 |  .0453787   .0453788  -1.17e-07  -1.17e-07   .9971708   1.136731
         x93 |  .0865687   .0865687  -1.43e-09  -1.50e-09     .95074   .9577067
         x94 | -.1299173  -.1299171  -1.59e-07  -1.55e-07    1.02511   .7795321
         x95 | -.0807251  -.0807251  -1.58e-08  -1.65e-08   .9586344   .8888006
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.92042e-15
  Mean absolute standardized diff.
  1.76706e-07
  Maximum absolute standardized diff.
  5.11239e-07
  C.V. of matching weights:
  .8926802189
  S.D. of matching weights:
  .8926802189
  Skewness of matching weights:
  .110007814
  Kurtosis of matching weights:
  .0225364323
  Maximum matching weight:
  7.032258968

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00061284  
Iteration 1:   f(p) =  2.180e-07  
Iteration 2:   f(p) =  1.269e-07  
Iteration 3:   f(p) =  1.206e-07  
Iteration 4:   f(p) =  1.176e-07  
Iteration 5:   f(p) =  1.170e-07  
Iteration 6:   f(p) =  1.170e-07  
Iteration 7:   f(p) =  1.161e-07  
Iteration 8:   f(p) =  8.900e-08  
Iteration 9:   f(p) =  8.301e-08  
Iteration 10:  f(p) =  8.238e-08  
Iteration 11:  f(p) =  8.232e-08  
Iteration 12:  f(p) =  8.209e-08  
Iteration 13:  f(p) =  8.208e-08  
Iteration 14:  f(p) =  8.207e-08  
Iteration 15:  f(p) =  8.207e-08  
Iteration 16:  f(p) =  8.207e-08  
Iteration 17:  f(p) =  8.207e-08  
Iteration 18:  f(p) =  8.185e-08  
Iteration 19:  f(p) =  7.934e-08  
Iteration 20:  f(p) =  7.682e-08  
Iteration 21:  f(p) =  7.653e-08  
Iteration 22:  f(p) =  7.608e-08  
Iteration 23:  f(p) =  7.603e-08  
Iteration 24:  f(p) =  7.602e-08  
Iteration 25:  f(p) =  7.602e-08  
Iteration 26:  f(p) =  7.602e-08  
Iteration 27:  f(p) =  7.602e-08  
Iteration 28:  f(p) =  7.600e-08  
Iteration 29:  f(p) =  7.569e-08  
Iteration 30:  f(p) =  6.935e-08  
Iteration 31:  f(p) =  5.515e-08  
Iteration 32:  f(p) =  5.121e-08  
Iteration 33:  f(p) =  4.910e-08  
Iteration 34:  f(p) =  4.904e-08  
Iteration 35:  f(p) =  4.857e-08  
Iteration 36:  f(p) =  4.825e-08  
Iteration 37:  f(p) =  4.804e-08  
Iteration 38:  f(p) =  4.803e-08  
Iteration 39:  f(p) =  4.803e-08  
Iteration 40:  f(p) =  4.803e-08  
Iteration 41:  f(p) =  4.803e-08  
Iteration 42:  f(p) =  4.803e-08  
Iteration 43:  f(p) =  4.788e-08  
Iteration 44:  f(p) =  4.164e-08  
Iteration 45:  f(p) =  3.492e-08  
Iteration 46:  f(p) =  3.440e-08  
Iteration 47:  f(p) =  3.418e-08  
Iteration 48:  f(p) =  3.414e-08  
Iteration 49:  f(p) =  3.413e-08  
Iteration 50:  f(p) =  3.413e-08  
Iteration 51:  f(p) =  3.413e-08  
Iteration 52:  f(p) =  3.413e-08  
Iteration 53:  f(p) =  3.413e-08  
Iteration 54:  f(p) =  3.315e-08  
Iteration 55:  f(p) =  2.869e-08  
Iteration 56:  f(p) =  2.796e-08  
Iteration 57:  f(p) =  2.763e-08  
Iteration 58:  f(p) =  2.755e-08  
Iteration 59:  f(p) =  2.755e-08  
Iteration 60:  f(p) =  2.755e-08  
Iteration 61:  f(p) =  2.755e-08  
Iteration 62:  f(p) =  2.755e-08  
Iteration 63:  f(p) =  2.755e-08  
Iteration 64:  f(p) =  2.740e-08  
Iteration 65:  f(p) =  2.440e-08  
Iteration 66:  f(p) =  1.852e-08  
Iteration 67:  f(p) =  1.763e-08  
Iteration 68:  f(p) =  1.721e-08  
Iteration 69:  f(p) =  1.719e-08  
Iteration 70:  f(p) =  1.719e-08  
Iteration 71:  f(p) =  1.719e-08  
Iteration 72:  f(p) =  1.719e-08  
Iteration 73:  f(p) =  1.719e-08  
Iteration 74:  f(p) =  1.719e-08  
Iteration 75:  f(p) =  1.719e-08  
Iteration 76:  f(p) =  1.708e-08  
Iteration 77:  f(p) =  1.624e-08  
Iteration 78:  f(p) =  1.418e-08  
Iteration 79:  f(p) =  1.394e-08  
Iteration 80:  f(p) =  1.393e-08  
Iteration 81:  f(p) =  1.393e-08  
Iteration 82:  f(p) =  1.393e-08  
Iteration 83:  f(p) =  1.393e-08  
Iteration 84:  f(p) =  1.393e-08  
Iteration 85:  f(p) =  1.346e-08  
Iteration 86:  f(p) =  1.227e-08  
Iteration 87:  f(p) =  1.213e-08  
Iteration 88:  f(p) =  1.213e-08  
Iteration 89:  f(p) =  1.213e-08  
Iteration 90:  f(p) =  1.213e-08  
Iteration 91:  f(p) =  1.213e-08  
Iteration 92:  f(p) =  1.213e-08  
Iteration 93:  f(p) =  1.213e-08  
Iteration 94:  f(p) =  1.210e-08  
Iteration 95:  f(p) =  1.186e-08  
Iteration 96:  f(p) =  1.179e-08  
Iteration 97:  f(p) =  1.179e-08  
Iteration 98:  f(p) =  1.179e-08  
Iteration 99:  f(p) =  1.179e-08  
Iteration 100: f(p) =  1.179e-08  
Iteration 101: f(p) =  1.179e-08  
Iteration 102: f(p) =  1.179e-08  
Iteration 103: f(p) =  1.179e-08  
Iteration 104: f(p) =  1.176e-08  
Iteration 105: f(p) =  1.176e-08  
Iteration 106: f(p) =  1.176e-08  
Iteration 107: f(p) =  1.176e-08  
Iteration 108: f(p) =  1.176e-08  
Iteration 109: f(p) =  1.175e-08  
Iteration 110: f(p) =  1.152e-08  
Iteration 111: f(p) =  1.150e-08  
Iteration 112: f(p) =  1.150e-08  
Iteration 113: f(p) =  1.150e-08  
Iteration 114: f(p) =  1.150e-08  
Iteration 115: f(p) =  1.150e-08  
Iteration 116: f(p) =  1.150e-08  
Iteration 117: f(p) =  1.150e-08  
Iteration 118: f(p) =  1.150e-08  
Iteration 119: f(p) =  1.149e-08  
Iteration 120: f(p) =  1.149e-08  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.073332
        1.x2 |  -1.351474
        1.x3 |  -.4265891
          x4 |  -.2446028
          x5 |   .0448658
          x6 |  -.1991246
          x7 |     .02576
         x90 |    .123498
         x91 |  -.1268341
         x92 |    .100384
         x93 |   .0481987
         x94 |  -.0952649
         x95 |  -.0004227
       _cons |   .4475026
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .778     .0932      .187      .326      .484      .724      1.27      2.17      3.56      4.99
         |       408         1      .778     .0932      .187      .326      .484      .724      1.27      2.17      3.56      4.99
         |       408      .163     .0963     .0195     .0383     .0651     .0937      .134      .213      .316      .431      .515
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .252      .117     .0585     .0585      .123      .147      .245      .342      .395      .583      .583
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .703     .0932      .197      .344      .532      .905      1.07      1.93      3.51      4.99
         |       500         1      .703     .0932      .197      .344      .532      .905      1.07      1.93      3.51      4.99
         |       500      .179      .106     .0195     .0403     .0679        .1      .147       .24      .344      .497      .583
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5180962  -.0507049  -.1013239   .5004238   1.005539
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0121062  -.0012367  -.0114032   .1084486   .9066246
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0254794  -.0037403  -.0240311    .155644   .8637677
             |
          x4 |  .4347826    .452333  -.0175504  -.0352487    .497901   1.000446
          x5 |  25.46739   25.54247  -.0750751  -.0115177   6.518216   .6518659
          x6 |  11.86957   12.06722   -.197659  -.0949511   2.081693   .5446775
          x7 |  6.858696   6.811876     .04682   .0139211   3.363246     1.1459
         x90 |  .0972024   .0716304    .025572   .0252221   1.013871   .8608338
         x91 | -.0890157  -.0738456  -.0151701  -.0156929   .9666882   .9390513
         x92 |  .0453787   .0264295   .0189492   .0189331   1.000852   1.126358
         x93 |  .0865687   .0773359   .0092328   .0096189     .95986   .9358202
         x94 | -.1299173  -.0966898  -.0332275  -.0327318   1.015143   .7978088
         x95 | -.0807251  -.0892445   .0085194    .008832    .964602   .8757031
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0003709275
  Mean absolute standardized diff.
  .0310328878
  Maximum absolute standardized diff.
  .1013239368
  C.V. of matching weights:
  .7026811031
  S.D. of matching weights:
  .7026811031
  Skewness of matching weights:
  .0865726309
  Kurtosis of matching weights:
  .0155415983
  Maximum matching weight:
  4.985115322

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .50 6)

_cvopt:         1 .5 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02519572  
Iteration 1:   f(p) =  .00037232  
Iteration 2:   f(p) =  .00018115  
Iteration 3:   f(p) =  .00007047  
Iteration 4:   f(p) =  .00006335  
Iteration 5:   f(p) =  .00005995  
Iteration 6:   f(p) =  .00003158  
Iteration 7:   f(p) =  .00001706  
Iteration 8:   f(p) =  .00001448  
Iteration 9:   f(p) =  .00001017  
Iteration 10:  f(p) =  9.753e-06  
Iteration 11:  f(p) =  9.539e-06  
Iteration 12:  f(p) =  9.503e-06  
Iteration 13:  f(p) =  9.418e-06  
Iteration 14:  f(p) =  7.998e-06  
Iteration 15:  f(p) =  7.197e-06  
Iteration 16:  f(p) =  7.093e-06  
Iteration 17:  f(p) =  4.747e-06  
Iteration 18:  f(p) =  3.294e-06  
Iteration 19:  f(p) =  2.488e-06  
Iteration 20:  f(p) =  1.482e-06  
Iteration 21:  f(p) =  1.346e-06  
Iteration 22:  f(p) =  1.283e-06  
Iteration 23:  f(p) =  1.276e-06  
Iteration 24:  f(p) =  1.271e-06  
Iteration 25:  f(p) =  1.266e-06  
Iteration 26:  f(p) =  1.264e-06  
Iteration 27:  f(p) =  1.263e-06  
Iteration 28:  f(p) =  1.246e-06  
Iteration 29:  f(p) =  8.232e-07  
Iteration 30:  f(p) =  2.629e-07  
Iteration 31:  f(p) =  1.218e-07  
Iteration 32:  f(p) =  1.122e-07  
Iteration 33:  f(p) =  1.073e-07  
Iteration 34:  f(p) =  9.566e-08  
Iteration 35:  f(p) =  8.631e-08  
Iteration 36:  f(p) =  8.538e-08  
Iteration 37:  f(p) =  8.423e-08  
Iteration 38:  f(p) =  8.022e-08  
Iteration 39:  f(p) =  7.983e-08  
Iteration 40:  f(p) =  7.976e-08  
Iteration 41:  f(p) =  7.975e-08  
Iteration 42:  f(p) =  7.975e-08  
Iteration 43:  f(p) =  7.975e-08  
Iteration 44:  f(p) =  7.975e-08  
Iteration 45:  f(p) =  7.975e-08  
Iteration 46:  f(p) =  7.975e-08  
Iteration 47:  f(p) =  7.975e-08  
Iteration 48:  f(p) =  7.975e-08  
Iteration 49:  f(p) =  7.975e-08  
Iteration 50:  f(p) =  7.952e-08  
Iteration 51:  f(p) =  7.774e-08  
Iteration 52:  f(p) =  7.694e-08  
Iteration 53:  f(p) =  7.688e-08  
Iteration 54:  f(p) =  7.688e-08  
Iteration 55:  f(p) =  7.688e-08  
Iteration 56:  f(p) =  7.688e-08  
Iteration 57:  f(p) =  7.688e-08  
Iteration 58:  f(p) =  7.687e-08  
Iteration 59:  f(p) =  7.596e-08  
Iteration 60:  f(p) =  7.294e-08  
Iteration 61:  f(p) =  7.263e-08  
Iteration 62:  f(p) =  7.261e-08  
Iteration 63:  f(p) =  7.261e-08  
Iteration 64:  f(p) =  7.261e-08  
Iteration 65:  f(p) =  7.261e-08  
Iteration 66:  f(p) =  7.261e-08  
Iteration 67:  f(p) =  7.260e-08  
Iteration 68:  f(p) =  6.606e-08  
Iteration 69:  f(p) =  5.907e-08  
Iteration 70:  f(p) =  5.447e-08  
Iteration 71:  f(p) =  5.403e-08  
Iteration 72:  f(p) =  5.388e-08  
Iteration 73:  f(p) =  5.386e-08  
Iteration 74:  f(p) =  5.386e-08  
Iteration 75:  f(p) =  5.386e-08  
Iteration 76:  f(p) =  5.386e-08  
Iteration 77:  f(p) =  5.386e-08  
Iteration 78:  f(p) =  5.385e-08  
Iteration 79:  f(p) =  5.385e-08  
Iteration 80:  f(p) =  5.360e-08  
Iteration 81:  f(p) =  5.301e-08  
Iteration 82:  f(p) =  5.292e-08  
Iteration 83:  f(p) =  5.292e-08  
Iteration 84:  f(p) =  5.292e-08  
Iteration 85:  f(p) =  5.292e-08  
Iteration 86:  f(p) =  5.292e-08  
Iteration 87:  f(p) =  5.292e-08  
Iteration 88:  f(p) =  5.292e-08  
Iteration 89:  f(p) =  5.275e-08  
Iteration 90:  f(p) =  5.221e-08  
Iteration 91:  f(p) =  5.216e-08  
Iteration 92:  f(p) =  5.216e-08  
Iteration 93:  f(p) =  5.215e-08  
Iteration 94:  f(p) =  5.215e-08  
Iteration 95:  f(p) =  5.215e-08  
Iteration 96:  f(p) =  5.215e-08  
Iteration 97:  f(p) =  5.215e-08  
Iteration 98:  f(p) =  5.213e-08  
Iteration 99:  f(p) =  5.211e-08  
Iteration 100: f(p) =  5.211e-08  
Iteration 101: f(p) =  5.211e-08  
Iteration 102: f(p) =  5.211e-08  
Iteration 103: f(p) =  5.211e-08  
Iteration 104: f(p) =  5.210e-08  
Iteration 105: f(p) =  5.186e-08  
Iteration 106: f(p) =  5.149e-08  
Iteration 107: f(p) =  5.138e-08  
Iteration 108: f(p) =  5.137e-08  
Iteration 109: f(p) =  5.137e-08  
Iteration 110: f(p) =  5.137e-08  
Iteration 111: f(p) =  5.137e-08  
Iteration 112: f(p) =  5.137e-08  
Iteration 113: f(p) =  5.136e-08  
Iteration 114: f(p) =  5.124e-08  
Iteration 115: f(p) =  5.124e-08  
Iteration 116: f(p) =  5.124e-08  
Iteration 117: f(p) =  5.124e-08  
Iteration 118: f(p) =  5.124e-08  
Iteration 119: f(p) =  5.124e-08  
Iteration 120: f(p) =  5.124e-08  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.7224518
        1.x2 |   -1.02138
        1.x3 |  -.2940248
          x4 |  -.1693647
          x5 |   .0287736
          x6 |  -.1461124
          x7 |   .0165741
         x90 |   .0850026
         x91 |  -.0876241
         x92 |    .064603
         x93 |   .0348564
         x94 |  -.0666956
         x95 |  -.0074052
       _cons |   -.074794
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .532      .186      .321      .465      .621       .84      1.25      1.81       2.6      3.27
         |       408         1      .532      .186      .321      .465      .621       .84      1.25      1.81       2.6      3.27
         |       408      .153     .0657      .034     .0572     .0808      .105      .137      .191      .255      .329      .382
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .213     .0735     .0761     .0761      .132      .149      .212      .269      .301      .428      .428
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .481      .186      .334      .496      .672      .997      1.11      1.69      2.57      3.27
         |       500         1      .481      .186      .334      .496      .672      .997      1.11      1.69      2.57      3.27
         |       500      .164      .071      .034     .0593     .0851      .112      .148      .205      .274      .368      .428
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5905803   -.123189  -.2484339   .4958624   1.038298
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0146791  -.0038096  -.0324169   .1175176   .7496675
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0298423  -.0081032   -.048773   .1661407   .7408032
             |
          x4 |  .4347826   .4667682  -.0319856  -.0641037   .4989667   .9957517
          x5 |  25.46739   25.76596  -.2985727  -.0472369   6.320755   .6999576
          x6 |  11.86957   12.34462   -.475058  -.2232239   2.128169   .5220017
          x7 |  6.858696   6.762472   .0962234   .0286377   3.360029   1.148795
         x90 |  .0972024   .0377608   .0594417   .0592798   1.002731   .8843264
         x91 | -.0890157     -.0568  -.0322157  -.0329067   .9789999   .9109395
         x92 |  .0453787   .0107192   .0346595   .0344938   1.004802   1.115491
         x93 |  .0865687   .0662959   .0202728   .0209179   .9691606    .914348
         x94 | -.1299173  -.0576479  -.0722693  -.0719522   1.004407   .8186909
         x95 | -.0807251  -.0931961   .0124711   .0128445    .970923   .8621607
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0022225673
  Mean absolute standardized diff.
  .0711708306
  Maximum absolute standardized diff.
  .2484339136
  C.V. of matching weights:
  .4806314045
  S.D. of matching weights:
  .4806314045
  Skewness of matching weights:
  .0630376921
  Kurtosis of matching weights:
  .0107870842
  Maximum matching weight:
  3.268667641

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00093921  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00042753  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00003686  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00002767  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00001518  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.684e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  3.117e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  1.306e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.977e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  7.501e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.838e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  4.674e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.256e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  3.975e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  3.921e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  3.899e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  3.886e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  1.840e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.840e-10  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.143285
        1.x2 |  -1.628315
        1.x3 |  -.5817516
          x4 |   -.259203
          x5 |  -.0050244
          x6 |  -.0247024
          x7 |  -.0640398
         x90 |   .0628364
         x91 |  -.1378518
         x92 |   .0677606
         x93 |  -.0030837
         x94 |  -.1065554
         x95 |  -.0108233
       _cons |   1.418741
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .773     .0855      .249      .405      .511      .686      1.15      2.16      3.61      4.94
         |       408         1      .773     .0855      .249      .405      .511      .686      1.15      2.16      3.61      4.94
         |       408       .38      .144     .0594      .155       .23      .274      .336      .459      .614      .727      .785
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .481      .153      .195      .195      .286      .339      .506      .604      .687      .752      .752
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .698     .0855      .254      .428      .554      .843         1      2.03      3.59      4.94
         |       500         1      .698     .0855      .254      .428      .554      .843         1      2.03      3.59      4.94
         |       500      .398      .151     .0594      .158      .237      .284      .354      .515      .627      .748      .785
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4886649  -.0212736  -.0425244   .5002679   1.004738
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0089759   .0018937   .0196832   .0962076   1.218947
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0189526   .0027865   .0201496    .138292   1.153503
             |
          x4 |  .4347826   .5038997  -.0691171  -.1381174   .5004229   .9914134
          x5 |  25.46739   24.59121   .8761821   .1453855   6.026612   .7848157
          x6 |  11.86957   12.47577  -.6062095  -.2829339   2.142583   .5168367
          x7 |  6.858696   5.854283   1.004413   .2979209   3.371407   1.158311
         x90 |  .0972024   .0748458   .0223566   .0218601   1.022712   .8431975
         x91 | -.0890157  -.0978482   .0088325   .0090993   .9706755   .9297243
         x92 |  .0453787   .0519352  -.0065566  -.0064902    1.01023   1.100358
         x93 |  .0865687    .045241   .0413277      .0432   .9566596   .9437199
         x94 | -.1299173  -.1267786  -.0031386  -.0031585   .9937182   .8389463
         x95 | -.0807251  -.0907176   .0099925   .0103462   .9658148   .8730806
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0000527532
  Mean absolute standardized diff.
  .0800668647
  Maximum absolute standardized diff.
  .2979209233
  C.V. of matching weights:
  .6983434666
  S.D. of matching weights:
  .6983434666
  Skewness of matching weights:
  .0954310063
  Kurtosis of matching weights:
  .0167621492
  Maximum matching weight:
  4.939789692

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

_cvopt:         1 .5 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .0255221  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00707055  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00121893  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00077435  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00038439  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00027065  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00020657  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00014905  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004814  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00002729  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00002254  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00001783  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001699  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00001552  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00001133  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  9.051e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  2.745e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  1.278e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.474e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  2.155e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.112e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.949e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.908e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  1.907e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.903e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.893e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.886e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.883e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.882e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.878e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  1.686e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  5.628e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  2.594e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  4.217e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.446e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  1.159e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  2.474e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  2.389e-10  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.5162366
        1.x2 |   -1.63225
        1.x3 |  -.6074194
          x4 |  -.1809629
          x5 |  -.0132043
          x6 |  -.0512298
          x7 |  -.0344641
         x90 |  -.1460405
         x91 |  -.1125863
         x92 |  -.1597617
         x93 |   -.110326
         x94 |  -.0126237
         x95 |  -.1432016
       _cons |   1.379962
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .525      .117      .158       .46      .644      .897      1.22      1.68      2.89       3.4
         |       408         1      .525      .117      .158       .46      .644      .897      1.22      1.68      2.89       3.4
         |       408      .406      .116     .0816      .107      .258      .328      .404       .48      .559      .686       .72
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .463       .11      .138      .138      .327      .395       .46      .538      .615        .7        .7
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .474      .117      .195      .496      .714         1      1.13      1.57      2.84       3.4
         |       500         1      .474      .117      .195      .496      .714         1      1.13      1.57      2.84       3.4
         |       500      .417      .117     .0816      .123       .27      .342      .414      .492       .57       .69       .72
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .6184998  -.1511085  -.3070075   .4921979   1.063984
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .007067   .0038026   .0432737   .0878735   1.545234
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0190847   .0026545   .0191427   .1386667   1.145674
             |
          x4 |  .4347826   .5120366   -.077254  -.1543548    .500496   .9919279
          x5 |  25.46739   25.20907   .2583189   .0431042    5.99289   .7925318
          x6 |  11.86957   12.55434   -.684773  -.3149315   2.174355   .5017915
          x7 |  6.858696   6.331255   .5274402   .1562083   3.376518   1.139832
         x90 |  .0972024  -.1535064   .2507088   .2487182   1.008004   .8825625
         x91 | -.0890157  -.0816104  -.0074053  -.0076138   .9726176   .9252435
         x92 |  .0453787  -.1829363    .228315    .225987   1.010301   1.110788
         x93 |  .0865687   -.070593   .1571617   .1565825   1.003699   .8445113
         x94 | -.1299173  -.0124397  -.1174776  -.1179671   .9958502   .8367656
         x95 | -.0807251   -.189714   .1089889   .1128339   .9659232   .8748324
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0000639702
  Mean absolute standardized diff.
  .1467481075
  Maximum absolute standardized diff.
  .3149315403
  C.V. of matching weights:
  .4740568708
  S.D. of matching weights:
  .4740568708
  Skewness of matching weights:
  .0722339771
  Kurtosis of matching weights:
  .0146227314
  Maximum matching weight:
  3.400995323

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00061301  
Iteration 1:   f(p) =  .00010314  
Iteration 2:   f(p) =  .00006546  
Iteration 3:   f(p) =  .00002385  
Iteration 4:   f(p) =  .00001692  
Iteration 5:   f(p) =  .00001277  
Iteration 6:   f(p) =  .00001168  
Iteration 7:   f(p) =  .00001092  
Iteration 8:   f(p) =  8.593e-06  
Iteration 9:   f(p) =  5.345e-06  
Iteration 10:  f(p) =  4.603e-06  
Iteration 11:  f(p) =  4.428e-06  
Iteration 12:  f(p) =  4.385e-06  
Iteration 13:  f(p) =  4.339e-06  
Iteration 14:  f(p) =  4.227e-06  
Iteration 15:  f(p) =  1.714e-06  
Iteration 16:  f(p) =  7.785e-07  
Iteration 17:  f(p) =  7.308e-07  
Iteration 18:  f(p) =  7.196e-07  
Iteration 19:  f(p) =  7.177e-07  
Iteration 20:  f(p) =  7.164e-07  
Iteration 21:  f(p) =  7.161e-07  
Iteration 22:  f(p) =  7.159e-07  
Iteration 23:  f(p) =  7.155e-07  
Iteration 24:  f(p) =  7.146e-07  
Iteration 25:  f(p) =  6.586e-07  
Iteration 26:  f(p) =  3.632e-07  
Iteration 27:  f(p) =  2.855e-07  
Iteration 28:  f(p) =  2.799e-07  
Iteration 29:  f(p) =  2.787e-07  
Iteration 30:  f(p) =  2.787e-07  
Iteration 31:  f(p) =  2.787e-07  
Iteration 32:  f(p) =  2.787e-07  
Iteration 33:  f(p) =  2.787e-07  
Iteration 34:  f(p) =  2.781e-07  
Iteration 35:  f(p) =  2.722e-07  
Iteration 36:  f(p) =  2.641e-07  
Iteration 37:  f(p) =  2.555e-07  
Iteration 38:  f(p) =  2.553e-07  
Iteration 39:  f(p) =  2.553e-07  
Iteration 40:  f(p) =  2.553e-07  
Iteration 41:  f(p) =  2.553e-07  
Iteration 42:  f(p) =  2.505e-07  
Iteration 43:  f(p) =  2.446e-07  
Iteration 44:  f(p) =  2.442e-07  
Iteration 45:  f(p) =  2.442e-07  
Iteration 46:  f(p) =  2.442e-07  
Iteration 47:  f(p) =  2.439e-07  
Iteration 48:  f(p) =  2.391e-07  
Iteration 49:  f(p) =  1.982e-07  
Iteration 50:  f(p) =  1.785e-07  
Iteration 51:  f(p) =  1.783e-07  
Iteration 52:  f(p) =  1.783e-07  
Iteration 53:  f(p) =  1.783e-07  
Iteration 54:  f(p) =  1.783e-07  
Iteration 55:  f(p) =  1.782e-07  
Iteration 56:  f(p) =  1.778e-07  
Iteration 57:  f(p) =  1.756e-07  
Iteration 58:  f(p) =  1.751e-07  
Iteration 59:  f(p) =  1.751e-07  
Iteration 60:  f(p) =  1.751e-07  
Iteration 61:  f(p) =  1.751e-07  
Iteration 62:  f(p) =  1.751e-07  
Iteration 63:  f(p) =  1.750e-07  
Iteration 64:  f(p) =  1.750e-07  
Iteration 65:  f(p) =  1.733e-07  
Iteration 66:  f(p) =  1.729e-07  
Iteration 67:  f(p) =  1.728e-07  
Iteration 68:  f(p) =  1.728e-07  
Iteration 69:  f(p) =  1.728e-07  
Iteration 70:  f(p) =  1.728e-07  
Iteration 71:  f(p) =  1.728e-07  
Iteration 72:  f(p) =  1.728e-07  
Iteration 73:  f(p) =  1.728e-07  
Iteration 74:  f(p) =  1.728e-07  
Iteration 75:  f(p) =  1.728e-07  
Iteration 76:  f(p) =  1.728e-07  
Iteration 77:  f(p) =  1.728e-07  
Iteration 78:  f(p) =  1.728e-07  
Iteration 79:  f(p) =  1.728e-07  
Iteration 80:  f(p) =  1.728e-07  
Iteration 81:  f(p) =  1.720e-07  
Iteration 82:  f(p) =  1.718e-07  
Iteration 83:  f(p) =  1.718e-07  
Iteration 84:  f(p) =  1.718e-07  
Iteration 85:  f(p) =  1.718e-07  
Iteration 86:  f(p) =  1.718e-07  
Iteration 87:  f(p) =  1.718e-07  
Iteration 88:  f(p) =  1.718e-07  
Iteration 89:  f(p) =  1.718e-07  
Iteration 90:  f(p) =  1.718e-07  
Iteration 91:  f(p) =  1.718e-07  
Iteration 92:  f(p) =  1.718e-07  
Iteration 93:  f(p) =  1.718e-07  
Iteration 94:  f(p) =  1.716e-07  
Iteration 95:  f(p) =  1.716e-07  
Iteration 96:  f(p) =  1.716e-07  
Iteration 97:  f(p) =  1.716e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + IPW (overidentified) + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.059191
        1.x2 |  -1.392651
        1.x3 |  -.3877025
          x4 |  -.2597605
          x5 |   .0455692
          x6 |  -.2089932
          x7 |   .0230333
         x90 |   .1272555
         x91 |  -.1212326
         x92 |   .0972184
         x93 |    .048144
         x94 |  -.1060477
         x95 |   .0105291
       _cons |   .6347727
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408      .171      .101       .02       .04     .0674     .0961      .141      .226      .332      .447      .554
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .265       .12     .0589     .0589       .13      .162       .26      .354       .41      .613      .613
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500      .189      .111       .02     .0421     .0698      .105      .158      .255      .363      .521      .613
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913    .518763  -.0513717  -.1026584    .500414   1.005638
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0118444  -.0009748  -.0090699   .1074805   .9264197
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0264241  -.0046849  -.0296547   .1579827   .8336968
             |
          x4 |  .4347826   .4476614  -.0128788  -.0258872   .4974957   1.002336
          x5 |  25.46739   25.56133  -.0939344  -.0143615   6.540702   .6467528
          x6 |  11.86957   12.03336  -.1637989  -.0787939   2.078827   .5461046
          x7 |  6.858696   6.780637    .078059   .0231964    3.36514   1.144355
         x90 |  .0972024   .0722589   .0249436   .0245702   1.015196   .8581528
         x91 | -.0890157  -.0683618  -.0206539  -.0213641   .9667548   .9389306
         x92 |  .0453787   .0233094   .0220693   .0220815   .9994496   1.130348
         x93 |  .0865687   .0787139   .0078548   .0082004   .9578499   .9405747
         x94 | -.1299173  -.1086982  -.0212191   -.020847   1.017851   .7927287
         x95 | -.0807251  -.0823443   .0016192   .0016796   .9640659   .8768565
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002940136
  Mean absolute standardized diff.
  .0294126743
  Maximum absolute standardized diff.
  .1026584299
  C.V. of matching weights:
  .7165195421
  S.D. of matching weights:
  .7165195421
  Skewness of matching weights:
  .0906557634
  Kurtosis of matching weights:
  .0171324542
  Maximum matching weight:
  5.442012692

. 
. // furthermore, you can target skiwness, kurtosis, or max weight
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance cvtarget(1 .5 6) skewtarget(1 0.07 2)

_cvopt:         1 .5 6 1 .07 2
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02922492  
Iteration 1:   f(p) =  .00522908  
Iteration 2:   f(p) =  .00462687  
Iteration 3:   f(p) =  .00015808  
Iteration 4:   f(p) =  .00007042  
Iteration 5:   f(p) =  .00005102  
Iteration 6:   f(p) =  .00004883  
Iteration 7:   f(p) =  .00004294  
Iteration 8:   f(p) =   .0000423  
Iteration 9:   f(p) =  .00003874  
Iteration 10:  f(p) =  .00003119  
Iteration 11:  f(p) =  .00001574  
Iteration 12:  f(p) =  .00001238  
Iteration 13:  f(p) =  8.497e-06  
Iteration 14:  f(p) =  8.055e-06  
Iteration 15:  f(p) =  6.642e-06  
Iteration 16:  f(p) =  6.555e-06  
Iteration 17:  f(p) =  6.444e-06  
Iteration 18:  f(p) =  6.419e-06  
Iteration 19:  f(p) =  6.397e-06  
Iteration 20:  f(p) =  6.347e-06  
Iteration 21:  f(p) =  5.822e-06  
Iteration 22:  f(p) =  4.318e-06  
Iteration 23:  f(p) =  3.273e-06  
Iteration 24:  f(p) =  3.226e-06  
Iteration 25:  f(p) =  3.110e-06  
Iteration 26:  f(p) =  3.022e-06  
Iteration 27:  f(p) =  2.956e-06  
Iteration 28:  f(p) =  2.754e-06  
Iteration 29:  f(p) =  2.749e-06  
Iteration 30:  f(p) =  2.697e-06  
Iteration 31:  f(p) =  2.654e-06  
Iteration 32:  f(p) =  2.608e-06  
Iteration 33:  f(p) =  2.597e-06  
Iteration 34:  f(p) =  2.511e-06  
Iteration 35:  f(p) =  2.437e-06  
Iteration 36:  f(p) =  2.415e-06  
Iteration 37:  f(p) =  2.365e-06  
Iteration 38:  f(p) =  2.316e-06  
Iteration 39:  f(p) =  2.267e-06  
Iteration 40:  f(p) =  2.257e-06  
Iteration 41:  f(p) =  2.164e-06  
Iteration 42:  f(p) =  2.123e-06  
Iteration 43:  f(p) =  2.021e-06  
Iteration 44:  f(p) =  2.012e-06  
Iteration 45:  f(p) =  1.860e-06  
Iteration 46:  f(p) =  1.829e-06  
Iteration 47:  f(p) =  1.721e-06  
Iteration 48:  f(p) =  1.679e-06  
Iteration 49:  f(p) =  1.586e-06  
Iteration 50:  f(p) =  1.531e-06  
Iteration 51:  f(p) =  1.454e-06  
Iteration 52:  f(p) =  1.408e-06  
Iteration 53:  f(p) =  1.239e-06  
Iteration 54:  f(p) =  1.221e-06  
Iteration 55:  f(p) =  1.147e-06  
Iteration 56:  f(p) =  1.114e-06  
Iteration 57:  f(p) =  1.001e-06  
Iteration 58:  f(p) =  9.785e-07  
Iteration 59:  f(p) =  9.044e-07  
Iteration 60:  f(p) =  8.872e-07  
Iteration 61:  f(p) =  7.300e-07  
Iteration 62:  f(p) =  7.181e-07  
Iteration 63:  f(p) =  6.672e-07  
Iteration 64:  f(p) =  6.464e-07  
Iteration 65:  f(p) =  5.173e-07  
Iteration 66:  f(p) =  5.149e-07  
Iteration 67:  f(p) =  4.696e-07  
Iteration 68:  f(p) =  4.612e-07  
Iteration 69:  f(p) =  4.191e-07  
Iteration 70:  f(p) =  3.832e-07  
Iteration 71:  f(p) =  3.371e-07  
Iteration 72:  f(p) =  3.167e-07  
Iteration 73:  f(p) =  2.117e-07  
Iteration 74:  f(p) =  2.037e-07  
Iteration 75:  f(p) =  1.895e-07  
Iteration 76:  f(p) =  1.825e-07  
Iteration 77:  f(p) =  1.743e-07  
Iteration 78:  f(p) =  1.600e-07  
Iteration 79:  f(p) =  1.588e-07  
Iteration 80:  f(p) =  1.581e-07  
Iteration 81:  f(p) =  1.556e-07  
Iteration 82:  f(p) =  1.516e-07  
Iteration 83:  f(p) =  1.462e-07  
Iteration 84:  f(p) =  1.435e-07  
Iteration 85:  f(p) =  1.420e-07  
Iteration 86:  f(p) =  1.406e-07  
Iteration 87:  f(p) =  1.394e-07  
Iteration 88:  f(p) =  1.391e-07  
Iteration 89:  f(p) =  1.386e-07  
Iteration 90:  f(p) =  1.378e-07  
Iteration 91:  f(p) =  1.371e-07  
Iteration 92:  f(p) =  1.347e-07  
Iteration 93:  f(p) =  1.344e-07  
Iteration 94:  f(p) =  1.338e-07  
Iteration 95:  f(p) =  1.337e-07  
Iteration 96:  f(p) =  1.329e-07  
Iteration 97:  f(p) =  1.329e-07  
Iteration 98:  f(p) =  1.325e-07  
Iteration 99:  f(p) =  1.323e-07  
Iteration 100: f(p) =  1.322e-07  
Iteration 101: f(p) =  1.320e-07  
Iteration 102: f(p) =  1.320e-07  
Iteration 103: f(p) =  1.319e-07  
Iteration 104: f(p) =  1.319e-07  
Iteration 105: f(p) =  1.319e-07  
Iteration 106: f(p) =  1.319e-07  
Iteration 107: f(p) =  1.319e-07  
Iteration 108: f(p) =  1.319e-07  
Iteration 109: f(p) =  1.319e-07  
Iteration 110: f(p) =  1.318e-07  
Iteration 111: f(p) =  1.317e-07  
Iteration 112: f(p) =  1.315e-07  
Iteration 113: f(p) =  1.311e-07  
Iteration 114: f(p) =  1.310e-07  
Iteration 115: f(p) =  1.299e-07  
Iteration 116: f(p) =  1.283e-07  
Iteration 117: f(p) =  1.255e-07  
Iteration 118: f(p) =  1.222e-07  
Iteration 119: f(p) =  1.209e-07  
Iteration 120: f(p) =  1.180e-07  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6) + 1*abs(wgt_skewness()-.07)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.3064518
        1.x2 |  -1.592855
        1.x3 |  -.5262295
          x4 |  -.3378863
          x5 |  -.0368356
          x6 |  -.0997443
          x7 |  -.0293359
         x90 |   .0254221
         x91 |  -.0584176
         x92 |   .0413291
         x93 |   .0356049
         x94 |  -.0569327
         x95 |  -.0493005
       _cons |   1.146926
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .548      .146      .196      .456      .609      .874      1.25      1.71       2.9      3.37
         |       408         1      .548      .146      .196      .456      .609      .874      1.25      1.71       2.9      3.37
         |       408      .153     .0673     .0269     .0357     .0795      .103      .142      .191      .244      .355      .389
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .195     .0626     .0718     .0718      .119      .146       .19      .231      .279       .35       .35
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .495      .146      .239      .492      .658         1      1.16      1.64      2.88      3.37
         |       500         1      .495      .146      .239      .492      .658         1      1.16      1.64      2.88      3.37
         |       500      .161     .0683     .0269     .0433      .084      .108       .15      .202      .259      .353      .389
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .6036575  -.1362662   -.275686   .4942804   1.049321
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .007856   .0030135   .0329658   .0914139   1.391133
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0222877  -.0005485  -.0037205    .147438   .9842416
             |
          x4 |  .4347826   .4916673  -.0568847   -.113736   .5001469   .9916285
          x5 |  25.46739   24.55836   .9090302   .1533049   5.929558   .8157842
          x6 |  11.86957   12.31508  -.4455137   -.209693     2.1246   .5234432
          x7 |  6.858696   6.260896   .5977997   .1777839   3.362507    1.15338
         x90 |  .0972024   .0297349   .0674675   .0663102   1.017454    .854202
         x91 | -.0890157  -.0417306  -.0472851   -.047742   .9904305   .8860849
         x92 |  .0453787   .0004579   .0449208   .0448108   1.002454   1.122208
         x93 |  .0865687   .0766808   .0098878   .0102781   .9620262   .9307367
         x94 | -.1299173  -.0489711  -.0809462  -.0816101   .9918651   .8436783
         x95 | -.0807251  -.1465962   .0658711   .0683223   .9641232   .8774684
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0001883468
  Mean absolute standardized diff.
  .0989202736
  Maximum absolute standardized diff.
  .275685976
  C.V. of matching weights:
  .4953235467
  S.D. of matching weights:
  .4953235467
  Skewness of matching weights:
  .0699894492
  Kurtosis of matching weights:
  .0134558229
  Maximum matching weight:
  3.36732953

. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance maxtarget(1 10 2) difficult nonrtolerance

_cvopt:         0 0 2 0 0 2 0 0 2 1 10 2
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =    .505579  
Iteration 1:   f(p) =  .06009401  (backed up)
Iteration 2:   f(p) =  .00002045  
Iteration 3:   f(p) =  2.925e-06  (backed up)
Iteration 4:   f(p) =  2.883e-06  
Iteration 5:   f(p) =  2.834e-06  
Iteration 6:   f(p) =  2.802e-06  
Iteration 7:   f(p) =  2.553e-06  
Iteration 8:   f(p) =  2.495e-06  
Iteration 9:   f(p) =  2.391e-06  
Iteration 10:  f(p) =  2.361e-06  
Iteration 11:  f(p) =  2.178e-06  
Iteration 12:  f(p) =  2.141e-06  
Iteration 13:  f(p) =  2.075e-06  
Iteration 14:  f(p) =  1.973e-06  
Iteration 15:  f(p) =  1.966e-06  
Iteration 16:  f(p) =  1.895e-06  
Iteration 17:  f(p) =  1.780e-06  
Iteration 18:  f(p) =  1.714e-06  
Iteration 19:  f(p) =  1.597e-06  
Iteration 20:  f(p) =  1.542e-06  
Iteration 21:  f(p) =  1.082e-06  
Iteration 22:  f(p) =  1.070e-06  
Iteration 23:  f(p) =  1.006e-06  
Iteration 24:  f(p) =  9.240e-07  
Iteration 25:  f(p) =  9.061e-07  
Iteration 26:  f(p) =  7.533e-07  
Iteration 27:  f(p) =  7.500e-07  
Iteration 28:  f(p) =  7.318e-07  
Iteration 29:  f(p) =  6.533e-07  
Iteration 30:  f(p) =  6.338e-07  
Iteration 31:  f(p) =  5.831e-07  
Iteration 32:  f(p) =  5.692e-07  
Iteration 33:  f(p) =  4.687e-07  
Iteration 34:  f(p) =  3.754e-07  
Iteration 35:  f(p) =  3.693e-07  
Iteration 36:  f(p) =  3.381e-07  
Iteration 37:  f(p) =  2.669e-07  
Iteration 38:  f(p) =  2.652e-07  
Iteration 39:  f(p) =  2.458e-07  
Iteration 40:  f(p) =  2.411e-07  
Iteration 41:  f(p) =  2.237e-07  
Iteration 42:  f(p) =  2.137e-07  
Iteration 43:  f(p) =  1.941e-07  
Iteration 44:  f(p) =  1.435e-07  
Iteration 45:  f(p) =  1.361e-07  (backed up)
Iteration 46:  f(p) =  1.275e-07  
Iteration 47:  f(p) =  1.227e-07  
Iteration 48:  f(p) =  1.187e-07  
Iteration 49:  f(p) =  1.030e-07  
Iteration 50:  f(p) =  9.988e-08  
Iteration 51:  f(p) =  8.552e-08  
Iteration 52:  f(p) =  8.302e-08  
Iteration 53:  f(p) =  6.985e-08  
Iteration 54:  f(p) =  6.636e-08  
Iteration 55:  f(p) =  6.009e-08  
Iteration 56:  f(p) =  5.201e-08  
Iteration 57:  f(p) =  5.070e-08  
Iteration 58:  f(p) =  4.297e-08  
Iteration 59:  f(p) =  4.109e-08  
Iteration 60:  f(p) =  3.338e-08  
Iteration 61:  f(p) =  3.335e-08  
Iteration 62:  f(p) =  3.062e-08  
Iteration 63:  f(p) =  2.956e-08  
Iteration 64:  f(p) =  2.465e-08  
Iteration 65:  f(p) =  2.437e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 66:  f(p) =  2.349e-08  
Iteration 67:  f(p) =  2.337e-08  (backed up)
Iteration 68:  f(p) =  2.335e-08  
Iteration 69:  f(p) =  2.316e-08  
Iteration 70:  f(p) =  2.225e-08  
Iteration 71:  f(p) =  2.179e-08  
Iteration 72:  f(p) =  2.131e-08  
Iteration 73:  f(p) =  2.119e-08  
Iteration 74:  f(p) =  2.085e-08  
Iteration 75:  f(p) =  2.064e-08  
Iteration 76:  f(p) =  2.018e-08  
Iteration 77:  f(p) =  2.002e-08  
Iteration 78:  f(p) =  1.991e-08  
Iteration 79:  f(p) =  1.972e-08  
Iteration 80:  f(p) =  1.966e-08  
Iteration 81:  f(p) =  1.947e-08  
Iteration 82:  f(p) =  1.934e-08  
Iteration 83:  f(p) =  1.929e-08  
Iteration 84:  f(p) =  1.905e-08  
Iteration 85:  f(p) =  1.905e-08  
Iteration 86:  f(p) =  1.904e-08  
Iteration 87:  f(p) =  1.903e-08  
Iteration 88:  f(p) =  1.903e-08  
Iteration 89:  f(p) =  1.903e-08  
Iteration 90:  f(p) =  1.903e-08  
Iteration 91:  f(p) =  1.903e-08  
Iteration 92:  f(p) =  1.902e-08  
Iteration 93:  f(p) =  1.896e-08  
Iteration 94:  f(p) =  1.882e-08  
Iteration 95:  f(p) =  1.864e-08  
Iteration 96:  f(p) =  1.863e-08  
Iteration 97:  f(p) =  1.856e-08  
Iteration 98:  f(p) =  1.855e-08  
Iteration 99:  f(p) =  1.845e-08  
Iteration 100: f(p) =  1.830e-08  
Iteration 101: f(p) =  1.813e-08  
Iteration 102: f(p) =  1.809e-08  
Iteration 103: f(p) =  1.796e-08  
Iteration 104: f(p) =  1.795e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 105: f(p) =  1.786e-08  
Iteration 106: f(p) =  1.785e-08  (backed up)
Iteration 107: f(p) =  1.785e-08  
Iteration 108: f(p) =  1.785e-08  
Iteration 109: f(p) =  1.780e-08  
Iteration 110: f(p) =  1.778e-08  
Iteration 111: f(p) =  1.773e-08  
Iteration 112: f(p) =  1.771e-08  
Iteration 113: f(p) =  1.769e-08  
Iteration 114: f(p) =  1.767e-08  
Iteration 115: f(p) =  1.766e-08  
Iteration 116: f(p) =  1.766e-08  
Iteration 117: f(p) =  1.765e-08  
Iteration 118: f(p) =  1.765e-08  
Iteration 119: f(p) =  1.764e-08  
Iteration 120: f(p) =  1.764e-08  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.138091
        1.x2 |  -1.631835
        1.x3 |  -.5825505
          x4 |  -.3866115
          x5 |   .0654078
          x6 |  -.3073532
          x7 |   .0291953
         x90 |   .1048585
         x91 |  -.1441141
         x92 |   .1170319
         x93 |   .0400625
         x94 |  -.0816983
         x95 |    .072241
       _cons |   1.292509
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.05     .0431      .102      .207      .342      .674      1.24      2.18      4.59        10
         |       408         1      1.05     .0431      .102      .207      .342      .674      1.24      2.18      4.59        10
         |       408      .156      .115    .00915     .0214     .0425     .0683      .126       .21      .318      .496      .682
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .259       .14     .0386     .0386      .106      .135      .233      .353      .412      .743      .743
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .945     .0431      .102      .215      .422      .888      1.06      1.92      4.56        10
         |       500         1      .945     .0431      .102      .215      .422      .888      1.06      1.92      4.56        10
         |       500      .175      .126    .00915     .0214     .0435     .0789      .142      .234       .36      .575      .743
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5099782  -.0425869  -.0850894   .5004962   1.004622
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0095392   .0013303   .0135021   .0985277   1.147614
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0236713  -.0019321   -.012791   .1510555   .9280252
             |
          x4 |  .4347826   .4000482   .0347344   .0706471   .4916603   1.032618
          x5 |  25.46739   26.07731  -.6099205  -.0890614   6.848313   .5833247
          x6 |  11.86957   11.71504   .1545237   .0756492   2.042635   .5680616
          x7 |  6.858696   6.821282   .0374138   .0111601   3.352462   1.155175
         x90 |  .0972024   .0021678   .0950346    .093201   1.019673   .8504355
         x91 | -.0890157  -.0664643  -.0225514  -.0234955   .9598172   .9554799
         x92 |  .0453787   .0235225   .0218562   .0221461   .9869104   1.166796
         x93 |  .0865687   .0822629   .0043057   .0044999   .9568501   .9429476
         x94 | -.1299173  -.0963849  -.0335324  -.0320498   1.046259   .7432862
         x95 | -.0807251  -.0369332  -.0437919  -.0462011   .9478555   .9136348
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  2.65258e-08
  Mean absolute standardized diff.
  .0445764393
  Maximum absolute standardized diff.
  .0932010116
  C.V. of matching weights:
  .9452391299
  S.D. of matching weights:
  .9452391299
  Skewness of matching weights:
  .1520391929
  Kurtosis of matching weights:
  .0459447013
  Maximum matching weight:
  9.999999703
. }

. 
. // * WEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00008909  
Iteration 1:   f(p) =  .00006006  
Iteration 2:   f(p) =  .00005798  
Iteration 3:   f(p) =  .00005798  
Iteration 4:   f(p) =  .00005797  
Iteration 5:   f(p) =  .00005722  
Iteration 6:   f(p) =  .00004799  
Iteration 7:   f(p) =  .00002164  
Iteration 8:   f(p) =  .00001682  
Iteration 9:   f(p) =  .00001603  
Iteration 10:  f(p) =  .00001599  
Iteration 11:  f(p) =  .00001599  
Iteration 12:  f(p) =  .00001598  
Iteration 13:  f(p) =   .0000159  
Iteration 14:  f(p) =  .00001408  
Iteration 15:  f(p) =  7.665e-06  
Iteration 16:  f(p) =  5.086e-06  
Iteration 17:  f(p) =  4.993e-06  
Iteration 18:  f(p) =  4.991e-06  
Iteration 19:  f(p) =  4.991e-06  
Iteration 20:  f(p) =  4.823e-06  
Iteration 21:  f(p) =  2.177e-06  
Iteration 22:  f(p) =  1.975e-06  
Iteration 23:  f(p) =  1.975e-06  
Iteration 24:  f(p) =  1.975e-06  
Iteration 25:  f(p) =  1.973e-06  
Iteration 26:  f(p) =  1.837e-06  
Iteration 27:  f(p) =  8.764e-07  
Iteration 28:  f(p) =  8.670e-07  
Iteration 29:  f(p) =  8.670e-07  
Iteration 30:  f(p) =  8.668e-07  
Iteration 31:  f(p) =  8.606e-07  
Iteration 32:  f(p) =  6.855e-07  
Iteration 33:  f(p) =  3.275e-07  
Iteration 34:  f(p) =  3.129e-07  
Iteration 35:  f(p) =  3.129e-07  
Iteration 36:  f(p) =  3.129e-07  
Iteration 37:  f(p) =  3.126e-07  
Iteration 38:  f(p) =  2.902e-07  
Iteration 39:  f(p) =  1.500e-07  
Iteration 40:  f(p) =  7.211e-08  
Iteration 41:  f(p) =  6.958e-08  
Iteration 42:  f(p) =  6.958e-08  
Iteration 43:  f(p) =  6.957e-08  
Iteration 44:  f(p) =  6.798e-08  
Iteration 45:  f(p) =  9.607e-09  
Iteration 46:  f(p) =  8.088e-09  
Iteration 47:  f(p) =  8.087e-09  
Iteration 48:  f(p) =  8.087e-09  
Iteration 49:  f(p) =  8.082e-09  
Iteration 50:  f(p) =  7.522e-09  
Iteration 51:  f(p) =  1.631e-09  
Iteration 52:  f(p) =  9.271e-10  
Iteration 53:  f(p) =  9.270e-10  
Iteration 54:  f(p) =  9.269e-10  
Iteration 55:  f(p) =  8.642e-10  
Iteration 56:  f(p) =  4.638e-10  
Iteration 57:  f(p) =  1.009e-10  
Iteration 58:  f(p) =  8.912e-11  
Iteration 59:  f(p) =  8.908e-11  
Iteration 60:  f(p) =  8.904e-11  
Iteration 61:  f(p) =  8.811e-11  
Iteration 62:  f(p) =  7.676e-11  
Iteration 63:  f(p) =  2.385e-11  
Iteration 64:  f(p) =  4.228e-12  
Iteration 65:  f(p) =  4.144e-12  
Iteration 66:  f(p) =  4.144e-12  
Iteration 67:  f(p) =  4.135e-12  
Iteration 68:  f(p) =  4.023e-12  
Iteration 69:  f(p) =  2.447e-12  
Iteration 70:  f(p) =  2.077e-13  
Iteration 71:  f(p) =  7.805e-14  
Iteration 72:  f(p) =  7.793e-14  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.502414
        1.x2 |  -2.525402
        1.x3 |  -.8190826
          x4 |  -.3236381
          x5 |   .0771204
          x6 |  -.4884777
          x7 |     .07227
         x90 |   .0234172
         x91 |   .0257841
         x92 |   .2152131
         x93 |  -.0285333
         x94 |  -.3393879
         x95 |  -.0407887
       _cons |   3.075427
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .957      .762      .953      1.26      1.49       1.8      2.11       2.8      5.77        13
         |       408      .999      .435       .78      .784      .792      .809      .864      .985      1.32      2.65      6.64
         |       408       .16      .168     .0019    .00635     .0172      .037     .0987      .209      .409      .707      .883
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.63      .415      .415      .642      .808      1.35       2.6      3.88      9.17      9.17
         |        92      1.02      .828      .188      .188      .318      .405      .739      1.47      1.96      5.21      5.21
         |        92      .288      .192     .0336     .0336     .0892      .119      .237      .431       .55      .931      .931
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.11      .415      .548      1.06      1.41      1.78      2.17      2.99      6.49        13
         |       500         1      .529      .188      .273      .782      .799      .859      1.05      1.49       2.9      6.64
         |       500      .183       .18     .0019    .00715       .02     .0472      .117      .263      .446      .717      .931
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6695178   .6695184  -6.46e-07  -1.37e-06   .4706261   1.004329
             |
          x2 |
          0  |  (empty)
          1  |  .0220668   .0220668   6.91e-08   4.70e-07   .1469755   1.004331
             |
          x3 |
          0  |  (empty)
          1  |  .0366905   .0366911  -6.22e-07  -3.31e-06   .1880978   1.004312
             |
          x4 |   .485133   .4851327   2.59e-07   5.18e-07   .5000334   1.004328
          x5 |  26.17888   26.17889  -.0000146  -2.35e-06   6.237856   .6789016
          x6 |  12.63449   12.63449   1.54e-06   6.59e-07   2.338006    .574066
          x7 |   6.75523   6.755245  -.0000157  -4.65e-06   3.370937   1.187219
         x90 | -.0520319  -.0520316  -2.95e-07  -2.82e-07   1.046128   1.163665
         x91 |  .0164868   .0164855   1.36e-06   1.40e-06   .9705718   .9930967
         x92 | -.0021635  -.0021647   1.18e-06   1.16e-06   1.017927   1.359803
         x93 |  .0456889   .0456925  -3.59e-06  -3.72e-06   .9636158   .8837309
         x94 | -.0910013   -.091001  -2.89e-07  -2.85e-07   1.014116    .785929
         x95 | -.0894584   -.089459   5.51e-07   5.63e-07   .9789419   .8236875
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  7.41472e-13
  Mean absolute standardized diff.
  1.59543e-06
  Maximum absolute standardized diff.
  4.65061e-06
  C.V. of matching weights:
  .5271017302
  S.D. of matching weights:
  .5285016191
  Skewness of matching weights:
  .2026538185
  Kurtosis of matching weights:
  .0762388667
  Maximum matching weight:
  6.642347589

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02296546  
Iteration 1:   f(p) =  .01893921  
Iteration 2:   f(p) =  .01888779  
Iteration 3:   f(p) =  .01864993  
Iteration 4:   f(p) =  .01807794  
Iteration 5:   f(p) =  .01796175  
Iteration 6:   f(p) =  .01796123  
Iteration 7:   f(p) =   .0179521  
Iteration 8:   f(p) =  .01782591  
Iteration 9:   f(p) =  .01781762  
Iteration 10:  f(p) =  .01781752  
Iteration 11:  f(p) =  .01781614  
Iteration 12:  f(p) =  .01780413  
Iteration 13:  f(p) =  .01778114  
Iteration 14:  f(p) =   .0177802  
Iteration 15:  f(p) =  .01778018  
Iteration 16:  f(p) =  .01777992  
Iteration 17:  f(p) =  .01777692  
Iteration 18:  f(p) =  .01777309  
Iteration 19:  f(p) =  .01777274  
Iteration 20:  f(p) =  .01777274  
Iteration 21:  f(p) =  .01777272  
Iteration 22:  f(p) =  .01777235  
Iteration 23:  f(p) =  .01777191  
Iteration 24:  f(p) =  .01777187  
Iteration 25:  f(p) =  .01777187  
Iteration 26:  f(p) =  .01777187  
Iteration 27:  f(p) =  .01777186  
Iteration 28:  f(p) =  .01777185  
Iteration 29:  f(p) =  .01777185  
Iteration 30:  f(p) =  .01777185  
Iteration 31:  f(p) =  .01777185  
Iteration 32:  f(p) =  .01777184  
Iteration 33:  f(p) =  .01777184  
Iteration 34:  f(p) =  .01777184  
Iteration 35:  f(p) =  .01777184  
Iteration 36:  f(p) =  .01777184  
Iteration 37:  f(p) =  .01777184  
Iteration 38:  f(p) =  .01777184  
Iteration 39:  f(p) =  .01777184  
Iteration 40:  f(p) =  .01777184  
Iteration 41:  f(p) =  .01777184  
Iteration 42:  f(p) =  .01777184  
Iteration 43:  f(p) =  .01777184  
Iteration 44:  f(p) =  .01777184  
Iteration 45:  f(p) =  .01777184  
Iteration 46:  f(p) =  .01777184  
Iteration 47:  f(p) =  .01777184  
Iteration 48:  f(p) =  .01777184  
Iteration 49:  f(p) =  .01777184  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + IPW (overidentified)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.226645
        1.x2 |  -1.653763
        1.x3 |   -.777684
          x4 |  -.3532497
          x5 |   .0574628
          x6 |  -.2583003
          x7 |   .0080438
         x90 |   .0890277
         x91 |  -.1706886
         x92 |     .17651
         x93 |   .1136715
         x94 |  -.1271349
         x95 |     .02147
       _cons |   1.180156
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .569      .882      1.05      1.37      1.58       1.9      2.22      2.65      3.75      5.18
         |       408      .999      .194      .816      .827      .851      .879      .934      1.05      1.23      1.66      2.64
         |       408       .17      .119     .0115     .0244     .0519     .0816      .136      .228      .345      .513      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.26      .471      .471       .86      1.14      1.52      2.69      3.33      7.65      7.65
         |        92      1.02      .639      .297      .297      .465      .547      .791      1.35      1.75      4.34      4.34
         |        92      .278      .144      .048      .048      .119      .154      .264      .381      .448      .702      .702
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      .744      .471       .68      1.21      1.51      1.87      2.25      2.77      4.93      7.65
         |       500         1      .324      .297      .426      .821      .864      .931      1.07      1.35      2.08      4.34
         |       500       .19      .131     .0115     .0257     .0544     .0922      .151      .268      .394      .595      .702
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6415954   .6970126  -.0554172   -.119431   .4640107   1.093567
             |
          x2 |
          0  |  (empty)
          1  |  .0142909   .0234703  -.0091794  -.0628462   .1460619    .617275
             |
          x3 |
          0  |  (empty)
          1  |   .033444   .0380925  -.0046485  -.0245375   .1894461   .8860285
             |
          x4 |  .4881572   .4821182   .0060389   .0120785    .499973    1.00505
          x5 |  25.72258   26.31855  -.5959627  -.1000423   5.957105   .7659019
          x6 |  12.33189    12.8994  -.5675068  -.2533225   2.240254   .6135512
          x7 |  6.911085   6.688832    .222253   .0657615   3.379685   1.211887
         x90 | -.0440389  -.0251308  -.0189081  -.0185768    1.01783   1.120774
         x91 |  .0661739  -.0257225   .0918964   .0936224   .9815644   .9753855
         x92 |  -.038201  -.0020298  -.0361712  -.0355959   1.016161    1.20721
         x93 |  .0014103   .0645199  -.0631095  -.0653395   .9658703   .9125526
         x94 | -.1442665  -.0285682  -.1156983  -.1166709   .9916637   .8216035
         x95 | -.1053625    -.07164  -.0337225  -.0344809   .9780038    .803947
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0025726843
  Mean absolute standardized diff.
  .0771004621
  Maximum absolute standardized diff.
  .2533224824
  C.V. of matching weights:
  .3236892892
  S.D. of matching weights:
  .3244154623
  Skewness of matching weights:
  .1499734423
  Kurtosis of matching weights:
  .0569706863
  Maximum matching weight:
  4.343315804

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  4.040e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.955e-07  
Iteration 17:  f(p) =  3.831e-07  
Iteration 18:  f(p) =  1.190e-07  
Iteration 19:  f(p) =  7.818e-08  
Iteration 20:  f(p) =  7.812e-08  
Iteration 21:  f(p) =  7.811e-08  
Iteration 22:  f(p) =  7.807e-08  
Iteration 23:  f(p) =  7.755e-08  
Iteration 24:  f(p) =  6.263e-08  
Iteration 25:  f(p) =  1.494e-08  
Iteration 26:  f(p) =  1.287e-08  
Iteration 27:  f(p) =  1.287e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.222e-08  
Iteration 30:  f(p) =  7.730e-09  
Iteration 31:  f(p) =  3.296e-09  
Iteration 32:  f(p) =  2.965e-09  
Iteration 33:  f(p) =  2.965e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.951e-09  
Iteration 36:  f(p) =  2.273e-09  
Iteration 37:  f(p) =  8.270e-10  
Iteration 38:  f(p) =  6.667e-10  
Iteration 39:  f(p) =  6.665e-10  
Iteration 40:  f(p) =  6.664e-10  
Iteration 41:  f(p) =  6.626e-10  
Iteration 42:  f(p) =  2.464e-10  
Iteration 43:  f(p) =  2.182e-10  
Iteration 44:  f(p) =  2.181e-10  
Iteration 45:  f(p) =  2.180e-10  
Iteration 46:  f(p) =  2.171e-10  
Iteration 47:  f(p) =  1.949e-10  
Iteration 48:  f(p) =  8.678e-11  
Iteration 49:  f(p) =  5.116e-11  
Iteration 50:  f(p) =  5.109e-11  
Iteration 51:  f(p) =  5.109e-11  
Iteration 52:  f(p) =  5.103e-11  
Iteration 53:  f(p) =  4.724e-11  
Iteration 54:  f(p) =  7.501e-12  
Iteration 55:  f(p) =  1.147e-12  
Iteration 56:  f(p) =  1.133e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.075e-12  
Iteration 60:  f(p) =  2.225e-13  
Iteration 61:  f(p) =  1.513e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |      .6266
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.57e-06   .4978682    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.78e-06    .106233   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.01e-06   .1533227   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.45e-06   .4941119   1.004329
          x5 |  25.44699   25.44697   .0000137   2.05e-06    6.66557   .6144636
          x6 |  11.84757   11.84755   .0000196   9.58e-06   2.042371   .5982538
          x7 |  7.015422    7.01543  -8.52e-06  -2.55e-06   3.345322   1.161762
         x90 |  .0839738   .0839754  -1.59e-06  -1.55e-06     1.0258   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.30e-06   .9411048   .9922921
         x92 |  .0575388   .0575408  -2.03e-06  -2.05e-06   .9892728   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.15e-06   .9410808   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.28e-06    1.02686   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.46e-06   .9627681   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.61900e-12
  Mean absolute standardized diff.
  3.36883e-06
  Maximum absolute standardized diff.
  9.58059e-06
  C.V. of matching weights:
  .9311703388
  S.D. of matching weights:
  .9276236134
  Skewness of matching weights:
  .1133781716
  Kurtosis of matching weights:
  .0229023239
  Maximum matching weight:
  7.00792465

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00053487  
Iteration 1:   f(p) =  .00021848  
Iteration 2:   f(p) =  .00021162  
Iteration 3:   f(p) =  .00021159  
Iteration 4:   f(p) =  .00021001  
Iteration 5:   f(p) =  .00019724  
Iteration 6:   f(p) =   .0001771  
Iteration 7:   f(p) =  .00017502  
Iteration 8:   f(p) =  .00017501  
Iteration 9:   f(p) =  .00017499  
Iteration 10:  f(p) =  .00017464  
Iteration 11:  f(p) =   .0001725  
Iteration 12:  f(p) =  .00017245  
Iteration 13:  f(p) =  .00017239  
Iteration 14:  f(p) =  .00017218  
Iteration 15:  f(p) =  .00017218  
Iteration 16:  f(p) =  .00017218  
Iteration 17:  f(p) =  .00017218  
Iteration 18:  f(p) =  .00017217  
Iteration 19:  f(p) =  .00017216  
Iteration 20:  f(p) =  .00017216  
Iteration 21:  f(p) =  .00017216  
Iteration 22:  f(p) =  .00017216  
Iteration 23:  f(p) =  .00017216  
Iteration 24:  f(p) =  .00017215  
Iteration 25:  f(p) =  .00017215  
Iteration 26:  f(p) =  .00017215  
Iteration 27:  f(p) =  .00017215  
Iteration 28:  f(p) =  .00017215  
Iteration 29:  f(p) =  .00017215  
Iteration 30:  f(p) =  .00017215  
Iteration 31:  f(p) =  .00017215  
Iteration 32:  f(p) =  .00017215  
Iteration 33:  f(p) =  .00017215  
Iteration 34:  f(p) =  .00017215  
Iteration 35:  f(p) =  .00017215  
Iteration 36:  f(p) =  .00017215  
Iteration 37:  f(p) =  .00017215  
Iteration 38:  f(p) =  .00017215  
Iteration 39:  f(p) =  .00017215  
Iteration 40:  f(p) =  .00017215  
Iteration 41:  f(p) =  .00017215  
Iteration 42:  f(p) =  .00017215  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + IPW (overidentified)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.393749
        1.x2 |  -1.561035
        1.x3 |  -.4600073
          x4 |  -.3846166
          x5 |   .0606091
          x6 |  -.2482014
          x7 |   .0443351
         x90 |   .1306487
         x91 |  -.1205476
         x92 |   .1453091
         x93 |   .0704761
         x94 |  -.1075638
         x95 |  -.0307915
       _cons |   .7598464
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.12     .0834      .213      .379      .703       1.2      2.44       4.6      9.79      16.6
         |       408      .995      1.01     .0445      .124      .212      .364      .618      1.22      2.32      4.57      7.11
         |       408      .161      .119    .00985     .0269     .0454     .0753      .121      .214      .341      .506      .614
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .153     .0459     .0459     .0999      .133      .243      .375      .464      .695      .695
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.92     .0834      .215      .425      .799      1.47      2.33       4.1       9.5      16.6
         |       500      .996      .916     .0445      .124      .228      .404       .82      1.04      2.07      4.54      7.11
         |       500      .181      .133    .00985     .0269     .0484     .0819      .137      .247       .39      .596      .695
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4553292   -.004106   -.008242    .498186   1.002774
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0111963   .0002076   .0019684   .1054489   1.022732
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0242797   -.000216   -.001404   .1538722    .995612
             |
          x4 |  .4218861   .4235251   -.001639  -.0033157    .494322   1.003286
          x5 |  25.44699   25.39436   .0526232   .0078929   6.667188   .6141311
          x6 |  11.84757   11.82507   .0224993   .0110128   2.043017   .5978372
          x7 |  7.015422   6.978163   .0372587   .0111276   3.348319   1.159171
         x90 |  .0839738   .0816058   .0023681   .0023047   1.027479   .8472278
         x91 | -.0648837  -.0554767   -.009407  -.0099829   .9423132   .9892043
         x92 |  .0575388   .0526515   .0048872   .0049457   .9881782   1.121369
         x93 |  .1016523     .09771   .0039423    .004191   .9406607   1.013686
         x94 | -.1252265   -.131327   .0061005   .0059387    1.02725   .7569926
         x95 | -.1044649  -.1015495  -.0029155   -.003029   .9625008   .8652191
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  3.24223e-06
  Mean absolute standardized diff.
  .0057965748
  Maximum absolute standardized diff.
  .0111275785
  C.V. of matching weights:
  .9194966014
  S.D. of matching weights:
  .9158853603
  Skewness of matching weights:
  .1127627754
  Kurtosis of matching weights:
  .0230489326
  Maximum matching weight:
  7.109590601

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00026309  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00001126  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  4.733e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.762e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.968e-21  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298301
        1.x2 |   -1.62991
        1.x3 |  -.4511738
          x4 |  -.3553036
          x5 |     .07158
          x6 |  -.2773324
          x7 |   .0371349
         x90 |   .1283826
         x91 |  -.0952385
         x92 |   .1409152
         x93 |   .0743039
         x94 |  -.1419192
         x95 |  -.0201501
       _cons |   1.248956
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.18     .0766      .195      .376      .696      1.22      2.44      4.57      9.98      20.7
         |       408      .998      1.06     .0408      .117      .208       .36       .63      1.18      2.31      4.35      10.6
         |       408       .22      .145     .0139     .0389     .0671      .111      .179      .289      .444      .601      .786
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .351      .168      .068      .068      .152      .203      .322      .485      .552       .79       .79
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.98     .0766      .203      .418      .776       1.5      2.35      4.17      9.35      20.7
         |       500      .998      .961     .0408      .117      .226      .402      .852      1.07      1.96      4.35      10.6
         |       500      .244      .158     .0139      .039     .0719      .119      .203      .332      .494      .685       .79
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231    .487981  -.0367579  -.0735301   .4999024   .9953452
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101189   .0012849   .0126869   .1012806   1.130392
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243904  -.0003267  -.0021194   .1541516    .991207
             |
          x4 |  .4218861   .4077073   .0141788   .0288106   .4921399   1.014377
          x5 |  25.44699   25.93854  -.4915548  -.0719755   6.829476   .5820455
          x6 |  11.84757   11.77832   .0692519   .0336233   2.059639   .5870658
          x7 |  7.015422   6.877177   .1382443   .0411586   3.358822   1.150412
         x90 |  .0839738   .0558962   .0280776   .0273707   1.025826   .8505932
         x91 | -.0648837  -.0314162  -.0334675  -.0355197    .942223   .9896463
         x92 |  .0575388   .0508005   .0067383   .0068466   .9841768   1.132825
         x93 |  .1016523   .1109109  -.0092586  -.0098717      .9379   1.021042
         x94 | -.1252265  -.1752569   .0500305    .047919   1.044064   .7291541
         x95 | -.1044649   -.104167  -.0002979  -.0003101   .9607217   .8690485
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.53257e-07
  Mean absolute standardized diff.
  .0301340147
  Maximum absolute standardized diff.
  .0735301424
  C.V. of matching weights:
  .963205406
  S.D. of matching weights:
  .9612474781
  Skewness of matching weights:
  .1583249612
  Kurtosis of matching weights:
  .0508875835
  Maximum matching weight:
  10.57744042

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .01944489  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01784035  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01032757  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00864463  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00309574  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00232235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00091852  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00071553  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00032888  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013226  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00006152  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00004718  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002689  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002163  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.507e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  4.926e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  4.495e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  3.113e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  9.709e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.289e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  2.156e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  2.156e-07  (backed up)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = sum(stddiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.446641
        1.x2 |   -1.54241
        1.x3 |  -.4738988
          x4 |  -.3823256
          x5 |   .0635735
          x6 |  -.2432678
          x7 |   .0476865
         x90 |   .1334605
         x91 |  -.1336202
         x92 |   .1523287
         x93 |    .075763
         x94 |  -.1016271
         x95 |  -.0382574
       _cons |   1.349238
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0811      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03     .0432      .118      .207       .36       .61      1.22       2.3      4.74      7.01
         |       408      .265      .163     .0196     .0516     .0872      .143       .22      .361      .515      .687      .764
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .413      .187     .0911     .0911      .181      .231      .398      .557      .655      .822      .822
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0811      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928     .0432      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .293      .177     .0196     .0523      .095      .155      .242      .404      .571      .753      .822
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512687  -.0000456  -.0000915   .4978722    1.00431
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114402  -.0000363  -.0003412   .1063687   1.001178
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240204   .0000433   .0002826   .1532151   1.006094
             |
          x4 |  .4218861   .4218656   .0000205   .0000415   .4941094   1.004341
          x5 |  25.44699   25.44719  -.0002052  -.0000308   6.665621   .6144531
          x6 |  11.84757    11.8475   .0000671   .0000329   2.042403   .5982325
          x7 |  7.015422   7.015211   .0002106    .000063   3.345327   1.161757
         x90 |  .0839738   .0839323   .0000415   .0000405   1.025812   .8505088
         x91 | -.0648837  -.0648817  -2.04e-06  -2.17e-06   .9411062   .9922887
         x92 |  .0575388   .0575515  -.0000127  -.0000128   .9892523   1.118322
         x93 |  .1016523   .1016534  -1.07e-06  -1.13e-06    .941085   1.012562
         x94 | -.1252265   -.125259   .0000325   .0000317    1.02687   .7576437
         x95 | -.1044649  -.1044612  -3.73e-06  -3.87e-06   .9627452   .8646937
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.33465e-13
  Mean absolute standardized diff.
  .0000750533
  Maximum absolute standardized diff.
  .0003412377
  C.V. of matching weights:
  .9310668686
  S.D. of matching weights:
  .9275217693
  Skewness of matching weights:
  .1133973011
  Kurtosis of matching weights:
  .0229134203
  Maximum matching weight:
  7.010362744

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet stdprogdiff depvars(`depvars') treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00143639  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =   .0006706  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00064802  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =   .0000134  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.064e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.270e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  6.452e-15  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  5.789e-15  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = sum(stdprogdiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298747
        1.x2 |  -1.629983
        1.x3 |  -.4515067
          x4 |   -.357214
          x5 |   .0701838
          x6 |  -.2800586
          x7 |   .0430997
         x90 |   .1194537
         x91 |  -.0953765
         x92 |   .1379619
         x93 |   .0698391
         x94 |  -.1463551
         x95 |  -.0181715
       _cons |   1.248743
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.19     .0755      .197      .369      .672       1.2      2.38       4.5        10      20.3
         |       408      .997      1.07     .0402      .116      .205      .356      .639      1.19      2.32       4.4      10.4
         |       408      .215      .144     .0134     .0374     .0645      .107      .177      .285      .438      .597      .777
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .345      .168     .0683     .0683      .147      .194      .315      .475      .549      .795      .795
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.99     .0755      .204      .406      .766       1.5      2.34       4.1       9.5      20.3
         |       500      .998      .963     .0402      .116      .223      .396      .841      1.07      1.98      4.39      10.4
         |       500      .239      .157     .0134     .0375     .0695      .116      .196      .324      .483      .682      .795
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231    .484127  -.0329038  -.0658374   .4997743   .9957736
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101286   .0012753   .0125867   .1013188   1.129324
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243611  -.0002974    -.00193   .1540776   .9923708
             |
          x4 |  .4218861   .4098975   .0119886   .0243442   .4924629   1.012702
          x5 |  25.44699    25.8721  -.4251097  -.0622881   6.824889   .5828017
          x6 |  11.84757   11.76324   .0843352   .0410427   2.054815   .5902452
          x7 |  7.015422   6.941206   .0742153   .0221215    3.35489   1.153544
         x90 |  .0839738   .0479702   .0360036   .0350605     1.0269   .8485516
         x91 | -.0648837  -.0313865  -.0334972  -.0355764   .9415571   .9913576
         x92 |  .0575388   .0445559   .0129828   .0132019   .9834052   1.135082
         x93 |  .1016523   .1048846  -.0032323  -.0034409   .9393549   1.017147
         x94 | -.1252265  -.1776542   .0524278   .0502886   1.042536    .731671
         x95 | -.1044649  -.0999146  -.0045503  -.0047337    .961274   .8678598
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  3.65096e-06
  Mean absolute standardized diff.
  .0286502164
  Maximum absolute standardized diff.
  .0658373631
  C.V. of matching weights:
  .9655273278
  S.D. of matching weights:
  .9632833299
  Skewness of matching weights:
  .1533416123
  Kurtosis of matching weights:
  .0473392743
  Maximum matching weight:
  10.35636678
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.435     3431.435  -1.17e-06  -7.17e-09   3431.435
   y1_binary |    .9507806     .9507806  -3.83e-09  -7.57e-08   .9507806
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.444e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -373.2561   49.21885    -7.58   0.000    -469.7233   -276.7889
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3424.879   30.82585   111.10   0.000     3364.462    3485.297
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3424.8791

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752    .0041102      1.338962   1.000571
                  |
               x2 |
               1  |  -.1180374    .0011686      .4133173   1.011157
                  |
               x3 |
               1  |  -.1253201   -.0169419      .5085817   .8975379
                  |
               x4 |  -.1207472    .0136004      .9914484   1.003798
               x5 |  -.1944638     .003179      .8589874   .5855492
               x6 |  -.6542694    .0947099      .4958356   .5643304
               x7 |   .0473848    .0177567      1.160037   1.134687
              x90 |   .1499304    .0348222      .9289414    .817157
              x91 |  -.0833726   -.0675073      .8791918     .96061
              x92 |   .0662245   -.0005441      1.090179   1.148892
              x93 |   .0479737    -.020065      .8926169   .9606022
              x94 |  -.1521926    .0315996      .8686432   .7548902
              x95 |  -.0155155    .0398234      .8285405   .8815991
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125569   .4983432   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0091856    .102624   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007062      .1536   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192417   .4952809   .9986039
          x5 |  25.44699   25.25275   .1942356   .0287189   6.763337   .5945665
          x6 |  11.84757   11.67955   .1680205   .0822363   2.043144   .5984287
          x7 |  7.015422   6.824197   .1912245   .0569439    3.35812   1.151353
         x90 |  .0839738   .0777469   .0062269   .0060092   1.036221   .8303562
         x91 | -.0648837   -.033852  -.0310317   -.032945   .9419239    .990382
         x92 |  .0575388   .0480591   .0094797   .0096248   .9849204   1.130693
         x93 |  .1016523   .1032412  -.0015889   -.001701   .9340722   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0476679   1.035122   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0072928   .9594697   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. gmatchcall reweight()

. gmatchcall balanceresults()
  Unmatched data
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4653368   .0020545   .0041146   .4993249   1.009059
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0107485   .0001211   .0011718   .1033261   1.019734
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0242844  -.0025453  -.0166769   .1526231   .9051513
             |
          x4 |  .4347826   .4280333   .0067493   .0136219   .4954712   1.012313
          x5 |  25.46739   25.44732   .0200675   .0029485   6.806091   .5905162
          x6 |  11.86957   11.69122   .1783475   .0873876    2.04088   .5691173
          x7 |  6.858696   6.797654   .0610413   .0181384   3.365302   1.144312
         x90 |  .0972024   .0623017   .0349007   .0337983   1.032616   .8240885
         x91 | -.0890157  -.0249321  -.0640836  -.0671278   .9546514   .9687584
         x92 |  .0453787   .0459298  -.0005512  -.0005569   .9896794   1.158638
         x93 |  .0865687   .1054548  -.0188862  -.0199583   .9462793   .9687505
         x94 | -.1299173  -.1613151   .0313979   .0303219   1.035483   .7612936
         x95 | -.0807251  -.1181964   .0374713   .0390906   .9585753   .8890772
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0000943494
  Mean absolute standardized diff.
  .0257625916
  Maximum absolute standardized diff.
  .0873875756
  C.V. of matching weights:
  0
  S.D. of matching weights:
  0
  Skewness of matching weights:
  .
  Kurtosis of matching weights:
  .
  Maximum matching weight:
  1

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw averagevariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125569   .4983432   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0091856    .102624   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007062      .1536   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192417   .4952809   .9986039
          x5 |  25.44699   25.25275   .1942356   .0287189   6.763337   .5945665
          x6 |  11.84757   11.67955   .1680205   .0822363   2.043144   .5984287
          x7 |  7.015422   6.824197   .1912245   .0569439    3.35812   1.151353
         x90 |  .0839738   .0777469   .0062269   .0060092   1.036221   .8303562
         x91 | -.0648837   -.033852  -.0310317   -.032945   .9419239    .990382
         x92 |  .0575388   .0480591   .0094797   .0096248   .9849204   1.130693
         x93 |  .1016523   .1032412  -.0015889   -.001701   .9340722   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0476679   1.035122   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0072928   .9594697   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], ate aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  2.423e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |  -332.1348   56.53175    -5.88   0.000     -442.935   -221.3346
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3453.029    20.1341   171.50   0.000     3413.567    3492.491
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .572      .862      1.06      1.36      1.59       1.9      2.23      2.72      3.72      5.29
         |       408      .999      .196      .823      .836      .852      .877      .929      1.03      1.26      1.65      2.49
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.31      .475      .475      .807      1.08      1.51      2.47      3.54      8.32      8.32
         |        92      1.02      .684      .274      .274      .443      .535      .795       1.4      1.78      4.73      4.73
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .76      .475      .645      1.19      1.51      1.87      2.26      2.83      4.93      8.32
         |       500         1      .341      .274      .398      .832      .866      .925      1.06      1.39      2.29      4.73
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6613089   .6933653  -.0320564  -.0691239   .4637537   1.058036
             |
          x2 |
          0  |  (empty)
          1  |  .0128589   .0239773  -.0111184  -.0758638   .1465574   .5447519
             |
          x3 |
          0  |  (empty)
          1  |  .0265737   .0393435  -.0127698  -.0676144   .1888625   .6873677
             |
          x4 |  .4958234   .4853442   .0104792   .0209545   .5000924   1.005121
          x5 |  25.79221   26.26742  -.4752185  -.0797142   5.961531   .7434191
          x6 |  12.37135   12.88246  -.5111083  -.2278712    2.24297   .6063944
          x7 |  6.760858   6.737452    .023406    .006941   3.372117   1.194134
         x90 | -.1082151   -.017539  -.0906761  -.0889061   1.019909   1.121318
         x91 |   .033412  -.0122333   .0456452   .0466881   .9776621   .9566022
         x92 |  .0165767  -.0117433     .02832   .0278871   1.015524   1.209921
         x93 |  .0109477   .0569505  -.0460028  -.0475772   .9669081   .9220023
         x94 | -.1467208  -.0286143  -.1181065  -.1193869   .9892758   .8106047
         x95 | -.0857581  -.0773517  -.0084064  -.0085769   .9801209   .7990227
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0027535352
  Mean absolute standardized diff.
  .0682388595
  Maximum absolute standardized diff.
  .2278711742
  C.V. of matching weights:
  .3403902484
  S.D. of matching weights:
  .3414490721
  Skewness of matching weights:
  .1624622214
  Kurtosis of matching weights:
  .0662787313
  Maximum matching weight:
  4.725180198

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.908e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |   321.4309   62.35166     5.16   0.000     199.2239    443.6379
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3138.003   59.50596    52.73   0.000     3021.374    3254.633
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.299227   .2371935     5.48   0.000     .8343367    1.764118
                        |
                     x2 |
                     1  |   1.630014    .746001     2.19   0.029     .1678787    3.092149
                        |
                     x3 |
                     1  |   .4513753   .5770312     0.78   0.434    -.6795851    1.582336
                     x4 |   .3551911    .204881     1.73   0.083    -.0463684    .7567506
                     x5 |   -.058452   .0195046    -3.00   0.003    -.0966803   -.0202237
                     x6 |   .2821622    .049775     5.67   0.000      .184605    .3797195
                     x7 |  -.0332008   .0279849    -1.19   0.235    -.0880501    .0216486
                    x90 |  -.1276778   .0907109    -1.41   0.159     -.305468    .0501124
                    x91 |   .0961159   .0916737     1.05   0.294    -.0835612     .275793
                    x92 |  -.1400043   .0976573    -1.43   0.152    -.3314091    .0514004
                    x93 |  -.0734557   .0916967    -0.80   0.423     -.253178    .1062665
                    x94 |   .1435742   .0862727     1.66   0.096    -.0255172    .3126656
                    x95 |   .0212452   .0898768     0.24   0.813    -.1549102    .1974006
                  _cons |   -1.24872   .6712769    -1.86   0.063    -2.564399    .0669587
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ateu ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .398      .881      1.17      1.44      1.68      1.96      2.23      2.48      2.83      3.24
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.62      .218      .218      .607      .827      1.32      2.63      3.86      9.94      9.94
         |        92      1.03      .852     .0953     .0953      .305      .421      .745       1.5      1.98      5.65      5.65
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .78      .218      .418      1.22       1.6      1.94      2.27      2.59      4.66      9.94
         |       500         1      .364     .0953       .25      .813         1         1         1         1      2.54      5.65
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  4.040e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.955e-07  
Iteration 17:  f(p) =  3.831e-07  
Iteration 18:  f(p) =  1.190e-07  
Iteration 19:  f(p) =  7.818e-08  
Iteration 20:  f(p) =  7.812e-08  
Iteration 21:  f(p) =  7.811e-08  
Iteration 22:  f(p) =  7.807e-08  
Iteration 23:  f(p) =  7.755e-08  
Iteration 24:  f(p) =  6.263e-08  
Iteration 25:  f(p) =  1.494e-08  
Iteration 26:  f(p) =  1.287e-08  
Iteration 27:  f(p) =  1.287e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.222e-08  
Iteration 30:  f(p) =  7.730e-09  
Iteration 31:  f(p) =  3.296e-09  
Iteration 32:  f(p) =  2.965e-09  
Iteration 33:  f(p) =  2.965e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.951e-09  
Iteration 36:  f(p) =  2.273e-09  
Iteration 37:  f(p) =  8.270e-10  
Iteration 38:  f(p) =  6.667e-10  
Iteration 39:  f(p) =  6.665e-10  
Iteration 40:  f(p) =  6.664e-10  
Iteration 41:  f(p) =  6.626e-10  
Iteration 42:  f(p) =  2.464e-10  
Iteration 43:  f(p) =  2.182e-10  
Iteration 44:  f(p) =  2.181e-10  
Iteration 45:  f(p) =  2.180e-10  
Iteration 46:  f(p) =  2.171e-10  
Iteration 47:  f(p) =  1.949e-10  
Iteration 48:  f(p) =  8.678e-11  
Iteration 49:  f(p) =  5.116e-11  
Iteration 50:  f(p) =  5.109e-11  
Iteration 51:  f(p) =  5.109e-11  
Iteration 52:  f(p) =  5.103e-11  
Iteration 53:  f(p) =  4.724e-11  
Iteration 54:  f(p) =  7.501e-12  
Iteration 55:  f(p) =  1.147e-12  
Iteration 56:  f(p) =  1.133e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.075e-12  
Iteration 60:  f(p) =  2.225e-13  
Iteration 61:  f(p) =  1.513e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |      .6266
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.57e-06   .4978682    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.78e-06    .106233   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.01e-06   .1533227   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.45e-06   .4941119   1.004329
          x5 |  25.44699   25.44697   .0000137   2.05e-06    6.66557   .6144636
          x6 |  11.84757   11.84755   .0000196   9.58e-06   2.042371   .5982538
          x7 |  7.015422    7.01543  -8.52e-06  -2.55e-06   3.345322   1.161762
         x90 |  .0839738   .0839754  -1.59e-06  -1.55e-06     1.0258   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.30e-06   .9411048   .9922921
         x92 |  .0575388   .0575408  -2.03e-06  -2.05e-06   .9892728   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.15e-06   .9410808   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.28e-06    1.02686   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.46e-06   .9627681   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.61900e-12
  Mean absolute standardized diff.
  3.36883e-06
  Maximum absolute standardized diff.
  9.58059e-06
  C.V. of matching weights:
  .9311703388
  S.D. of matching weights:
  .9276236134
  Skewness of matching weights:
  .1133781716
  Kurtosis of matching weights:
  .0229023239
  Maximum matching weight:
  7.00792465

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00093832  
Iteration 1:   f(p) =  .00004631  
Iteration 2:   f(p) =  .00003859  
Iteration 3:   f(p) =  .00003858  
Iteration 4:   f(p) =  .00003858  
Iteration 5:   f(p) =  .00003857  
Iteration 6:   f(p) =  .00003712  
Iteration 7:   f(p) =  .00001543  
Iteration 8:   f(p) =  .00001516  
Iteration 9:   f(p) =  .00001516  
Iteration 10:  f(p) =  .00001516  
Iteration 11:  f(p) =  .00001516  
Iteration 12:  f(p) =  .00001496  
Iteration 13:  f(p) =  .00001329  
Iteration 14:  f(p) =  .00001318  
Iteration 15:  f(p) =  .00001318  
Iteration 16:  f(p) =  .00001318  
Iteration 17:  f(p) =  .00001318  
Iteration 18:  f(p) =  .00001317  
Iteration 19:  f(p) =  .00001306  
Iteration 20:  f(p) =  .00001275  
Iteration 21:  f(p) =  .00001268  
Iteration 22:  f(p) =  .00001268  
Iteration 23:  f(p) =  .00001268  
Iteration 24:  f(p) =  .00001268  
Iteration 25:  f(p) =  .00001268  
Iteration 26:  f(p) =  .00001266  
Iteration 27:  f(p) =   .0000125  
Iteration 28:  f(p) =   .0000125  
Iteration 29:  f(p) =   .0000125  
Iteration 30:  f(p) =   .0000125  
Iteration 31:  f(p) =   .0000125  
Iteration 32:  f(p) =   .0000125  
Iteration 33:  f(p) =  .00001248  
Iteration 34:  f(p) =  .00001247  
Iteration 35:  f(p) =  .00001247  
Iteration 36:  f(p) =  .00001247  
Iteration 37:  f(p) =  .00001247  
Iteration 38:  f(p) =  .00001247  
Iteration 39:  f(p) =  .00001247  
Iteration 40:  f(p) =  .00001247  
Iteration 41:  f(p) =  .00001247  
Iteration 42:  f(p) =  .00001247  
Iteration 43:  f(p) =  .00001247  
Iteration 44:  f(p) =  .00001247  
Iteration 45:  f(p) =  .00001247  
Iteration 46:  f(p) =  .00001247  
Iteration 47:  f(p) =  .00001247  
Iteration 48:  f(p) =  .00001247  
Iteration 49:  f(p) =  .00001246  
Iteration 50:  f(p) =  .00001246  
Iteration 51:  f(p) =  .00001246  
Iteration 52:  f(p) =  .00001246  
Iteration 53:  f(p) =  .00001246  
Iteration 54:  f(p) =  .00001246  
Iteration 55:  f(p) =  .00001246  
Iteration 56:  f(p) =  .00001246  
Iteration 57:  f(p) =  .00001246  
Iteration 58:  f(p) =  .00001246  
Iteration 59:  f(p) =  .00001246  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.254181
        1.x2 |  -1.322943
        1.x3 |  -.3737877
          x4 |  -.3150736
          x5 |    .053865
          x6 |   -.207347
          x7 |   .0392197
         x90 |   .1112074
         x91 |  -.1096079
         x92 |   .1251037
         x93 |    .065952
         x94 |    -.09382
         x95 |  -.0291289
       _cons |   .4369062
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.81      .136      .285      .497       .83      1.32      2.51      4.37       8.5      13.5
         |       408      .996      .864     .0724       .17      .273      .438       .68      1.24      2.21      3.95      5.51
         |       408      .172      .109     .0168     .0384     .0605     .0937      .138      .226      .342      .482      .565
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .275      .138      .063      .063      .116      .147      .252      .373      .453      .641      .641
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.65      .136      .289      .555      .918      1.55      2.36      3.96      8.34      13.5
         |       500      .997       .78     .0724      .171      .297      .476      .864      1.06      1.98      3.95      5.51
         |       500      .191      .122     .0168     .0388     .0653        .1      .152      .255      .382      .553      .641
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4880522  -.0368291  -.0736722   .4999046   .9953384
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0133716  -.0019677  -.0173555    .113378   .8582417
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0267065  -.0026428  -.0165301   .1598759   .9074008
             |
          x4 |  .4218861   .4355797  -.0136936  -.0276218   .4957523   .9963546
          x5 |  25.44699   25.52567  -.0786887  -.0119971   6.558985   .6374814
          x6 |  11.84757    12.0082  -.1606282  -.0774787   2.073192   .5789037
          x7 |  7.015422    6.96308   .0523414   .0156231   3.350254   1.157512
         x90 |  .0839738   .0663453   .0176285   .0172641   1.021107   .8599203
         x91 | -.0648837  -.0552227   -.009661  -.0101775    .949254   .9716611
         x92 |  .0575388   .0443219   .0132168   .0133246   .9919122   1.110882
         x93 |  .1016523   .0920433    .009609   .0101362   .9479944   .9946047
         x94 | -.1252265  -.1096389  -.0155876  -.0152928   1.019277    .770958
         x95 | -.1044649  -.0986898  -.0057752  -.0059717    .967082   .8554811
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002360935
  Mean absolute standardized diff.
  .0240342584
  Maximum absolute standardized diff.
  .0774786736
  C.V. of matching weights:
  .7824738141
  S.D. of matching weights:
  .7798918518
  Skewness of matching weights:
  .0960999276
  Kurtosis of matching weights:
  .0177242444
  Maximum matching weight:
  5.513144506

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .50 6)

_cvopt:         1 .5 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .03149775  
Iteration 1:   f(p) =  .00028651  
Iteration 2:   f(p) =  .00020393  
Iteration 3:   f(p) =  .00019258  
Iteration 4:   f(p) =  .00019213  
Iteration 5:   f(p) =  .00019201  
Iteration 6:   f(p) =  .00019201  
Iteration 7:   f(p) =  .00019103  
Iteration 8:   f(p) =  .00015742  
Iteration 9:   f(p) =  .00012551  
Iteration 10:  f(p) =  .00012396  
Iteration 11:  f(p) =  .00012368  
Iteration 12:  f(p) =  .00012357  
Iteration 13:  f(p) =  .00012356  
Iteration 14:  f(p) =  .00012356  
Iteration 15:  f(p) =  .00012354  
Iteration 16:  f(p) =  .00012337  
Iteration 17:  f(p) =  .00011093  
Iteration 18:  f(p) =  .00008529  
Iteration 19:  f(p) =  .00008129  
Iteration 20:  f(p) =  .00008115  
Iteration 21:  f(p) =  .00008114  
Iteration 22:  f(p) =  .00008114  
Iteration 23:  f(p) =  .00008114  
Iteration 24:  f(p) =  .00008114  
Iteration 25:  f(p) =  .00008097  
Iteration 26:  f(p) =  .00008013  
Iteration 27:  f(p) =  .00007994  
Iteration 28:  f(p) =  .00007994  
Iteration 29:  f(p) =  .00007994  
Iteration 30:  f(p) =  .00007994  
Iteration 31:  f(p) =  .00007993  
Iteration 32:  f(p) =  .00007982  
Iteration 33:  f(p) =  .00007971  
Iteration 34:  f(p) =  .00007971  
Iteration 35:  f(p) =  .00007971  
Iteration 36:  f(p) =  .00007971  
Iteration 37:  f(p) =  .00007971  
Iteration 38:  f(p) =  .00007968  
Iteration 39:  f(p) =  .00007968  
Iteration 40:  f(p) =  .00007968  
Iteration 41:  f(p) =  .00007968  
Iteration 42:  f(p) =  .00007968  
Iteration 43:  f(p) =  .00007967  
Iteration 44:  f(p) =  .00007967  
Iteration 45:  f(p) =  .00007967  
Iteration 46:  f(p) =  .00007967  
Iteration 47:  f(p) =  .00007967  
Iteration 48:  f(p) =  .00007967  
Iteration 49:  f(p) =  .00007967  
Iteration 50:  f(p) =  .00007967  
Iteration 51:  f(p) =  .00007967  
Iteration 52:  f(p) =  .00007967  
Iteration 53:  f(p) =  .00007967  
Iteration 54:  f(p) =  .00007967  
Iteration 55:  f(p) =  .00007967  
Iteration 56:  f(p) =  .00007967  
Iteration 57:  f(p) =  .00007967  
Iteration 58:  f(p) =  .00007967  
Iteration 59:  f(p) =  .00007967  
Iteration 60:  f(p) =  .00007967  
Iteration 61:  f(p) =  .00007967  
Iteration 62:  f(p) =  .00007967  
Iteration 63:  f(p) =  .00007967  
Iteration 64:  f(p) =  .00007967  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.9697348
        1.x2 |  -1.009948
        1.x3 |  -.2681193
          x4 |  -.2328724
          x5 |   .0401949
          x6 |  -.1592826
          x7 |   .0284828
         x90 |   .0826327
         x91 |  -.0793657
         x92 |   .0918013
         x93 |   .0506792
         x94 |  -.0790893
         x95 |  -.0177969
       _cons |   .1432518
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.38      .271      .445      .706      1.03      1.54      2.49      3.85      6.84      9.73
         |       408      .997      .647      .144      .273      .397      .566      .778      1.24         2      3.05      3.88
         |       408      .186     .0903     .0345     .0633     .0893      .123      .161      .235      .331       .43       .49
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .27      .107     .0905     .0905      .143      .171      .257      .348      .405      .555      .555
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.26      .271      .449      .762      1.16      1.68      2.38      3.55      6.55      9.73
         |       500      .997      .584      .144      .275      .418      .597      .937      1.08      1.82      3.03      3.88
         |       500      .202      .099     .0345     .0637     .0933      .127      .174      .264      .355       .48      .555
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5455565  -.0943334  -.1888726   .4994551   1.003097
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0163288  -.0049249   -.039942   .1233012   .7049256
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0302591  -.0061954  -.0368254    .168237   .8037994
             |
          x4 |  .4218861   .4518912  -.0300051  -.0603275   .4973707   .9889709
          x5 |  25.44699   25.68607  -.2390886  -.0373545   6.400539   .6743964
          x6 |  11.84757   12.24705  -.3994826  -.1887491   2.116474   .5553463
          x7 |  7.015422    6.89603   .1193915   .0355909   3.354553   1.154005
         x90 |  .0839738   .0421686   .0418053   .0412405   1.013694   .8752326
         x91 | -.0648837  -.0430191  -.0218646  -.0227795   .9598337   .9459255
         x92 |  .0575388   .0282771   .0292616   .0293996   .9953056   1.101599
         x93 |  .1016523   .0789374   .0227149   .0237338   .9570688   .9718368
         x94 | -.1252265  -.0859457  -.0392808  -.0389154   1.009389   .7889919
         x95 | -.1044649  -.0909646  -.0135004   -.013886    .972231   .8447606
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0014656358
  Mean absolute standardized diff.
  .0582782197
  Maximum absolute standardized diff.
  .1888725526
  C.V. of matching weights:
  .5854551312
  S.D. of matching weights:
  .5839538516
  Skewness of matching weights:
  .0751394198
  Kurtosis of matching weights:
  .0127294311
  Maximum matching weight:
  3.883536588

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

_cvopt:         1 .75 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00118407  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00047827  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00006974  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00004509  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.893e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.962e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  1.695e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  6.547e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  2.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.307e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.558e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  7.610e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  6.398e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  6.152e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  6.114e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  6.091e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.081e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  5.990e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.587e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  4.159e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.449e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.547e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.434e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  3.144e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.694e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  6.220e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  2.530e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.124e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  4.820e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  4.572e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  3.313e-12  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.201696
        1.x2 |  -1.629604
        1.x3 |  -.4536638
          x4 |    -.31763
          x5 |   .0039335
          x6 |  -.0017811
          x7 |  -.0819355
         x90 |   .0141398
         x91 |  -.1286664
         x92 |    .040549
         x93 |  -.0181838
         x94 |  -.0913752
         x95 |   -.059869
       _cons |   1.261863
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.59      .142      .392      .715      .975      1.41      2.51      3.98      7.97      11.4
         |       408      .999      .761     .0779      .275      .408      .515      .731      1.19      1.97      3.79      5.35
         |       408      .424      .144     .0653      .198      .268      .316      .396      .517      .638      .773      .827
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .518      .157      .214      .214      .302      .393      .517      .642      .708      .822      .822
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.45      .142      .396      .767      1.08       1.6      2.38      3.58      7.65      11.4
         |       500      .999      .687     .0779       .28      .423      .561      .886      1.06      1.82      3.76      5.35
         |       500      .442      .151     .0653      .201      .271      .325      .413      .546      .666      .794      .827
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5058141   -.054591  -.1091303    .500237   .9949046
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096766   .0017273   .0173569   .0995164   1.181539
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0212238   .0028399   .0194619   .1459226   1.135412
             |
          x4 |  .4218861   .4772866  -.0554005  -.1109847   .4991723   .9818413
          x5 |  25.44699   25.00536   .4416251   .0733051   6.024482   .7768304
          x6 |  11.84757   12.59971  -.7521439  -.3447952   2.181422   .5263603
          x7 |  7.015422   5.724031    1.29139   .3819757   3.380819   1.163232
         x90 |  .0839738   .0201523   .0638215   .0619618   1.030013   .8428559
         x91 | -.0648837  -.1001377    .035254   .0368325   .9571428   .9525308
         x92 |  .0575388   .0452136   .0123252   .0122919   1.002706   1.081337
         x93 |  .1016523   .0432662   .0583861   .0610175   .9568749   .9728774
         x94 | -.1252265  -.1330996   .0078732   .0078868   .9982706   .8096563
         x95 | -.1044649  -.1169053   .0124403   .0128505   .9680827   .8533958
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0000852503
  Mean absolute standardized diff.
  .0961423554
  Maximum absolute standardized diff.
  .3819756616
  C.V. of matching weights:
  .6881261634
  S.D. of matching weights:
  .687337207
  Skewness of matching weights:
  .1077369259
  Kurtosis of matching weights:
  .0216811379
  Maximum matching weight:
  5.346641394

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

_cvopt:         1 .5 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .03174366  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01880683  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01499079  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00460016  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00088681  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00069868  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00016284  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00008031  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004972  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003906  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003723  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00002755  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001175  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  8.513e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  7.187e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.095e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.862e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  6.265e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  2.862e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.003e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.684e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.695e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.197e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  9.993e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  9.394e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  9.361e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  9.192e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  9.100e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  9.094e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  9.020e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  9.010e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  8.999e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  8.402e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  3.074e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.580e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  1.254e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  5.489e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  2.256e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  2.517e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  1.519e-11  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.6148131
        1.x2 |  -1.629519
        1.x3 |  -.4696456
          x4 |  -.2212177
          x5 |  -.0094296
          x6 |  -.0315781
          x7 |  -.0258518
         x90 |  -.1280055
         x91 |  -.1426087
         x92 |  -.1529322
         x93 |  -.1004651
         x94 |  -.0584315
         x95 |    -.16078
       _cons |   1.248045
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.12      .221      .361      .862      1.21      1.74      2.39      3.44      6.12      8.55
         |       408      .998      .514      .118      .193      .484       .64      .892      1.21      1.68      2.77      3.25
         |       408      .451      .117     .0978      .151      .308       .37       .45      .526      .606      .718      .749
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .512      .115      .191      .191      .372      .441      .508      .592      .664      .758      .758
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.03      .221      .387      .899      1.27      1.82      2.36      3.22      6.09      8.55
         |       500      .999      .464      .118      .223      .504        .7         1      1.12       1.6       2.7      3.25
         |       500      .462      .119     .0978       .17      .314      .383      .461      .537      .613      .724      .758
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .6125388  -.1613157  -.3269993    .493321   1.047854
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0077211   .0036828   .0403403   .0912928   1.477864
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0214176   .0026462   .0180698   .1464407   1.125362
             |
          x4 |  .4218861   .5019654  -.0800793  -.1601288   .5000928   .9798303
          x5 |  25.44699   25.28266   .1643269   .0275237   5.970382   .7928348
          x6 |  11.84757   12.62257  -.7750008  -.3543239   2.187266   .5238177
          x7 |  7.015422   6.447136   .5682861   .1673402   3.395992   1.124647
         x90 |  .0839738  -.1286873   .2126611   .2093753   1.015693   .8777453
         x91 | -.0648837  -.1159094   .0510257     .05328   .9576882   .9514721
         x92 |  .0575388  -.1708896   .2284284   .2275853   1.003704   1.089134
         x93 |  .1016523  -.0481191   .1497714   .1508663   .9927423   .8931681
         x94 | -.1252265  -.0777641  -.0474624  -.0478446   .9920101   .8221164
         x95 | -.1044649  -.2061288   .1016638    .104632   .9716323   .8476239
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0000712288
  Mean absolute standardized diff.
  .1452545974
  Maximum absolute standardized diff.
  .3543239067
  C.V. of matching weights:
  .4647073663
  S.D. of matching weights:
  .4640172272
  Skewness of matching weights:
  .0690477327
  Kurtosis of matching weights:
  .0135481966
  Maximum matching weight:
  3.254028265

. 
. // you can also target skiwness, kurtosis, or max weight, but it's finicky
. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance maxtarget(1 10 2) difficult nonrtolerance

_cvopt:         0 0 2 0 0 2 0 0 2 1 10 2
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .9280066  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .08139982  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01131328  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00131793  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00061114  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00059138  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =   .0002708  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00023009  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00007024  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003343  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  6.729e-06  
Iteration 11:  f(p) =  2.710e-08  
Iteration 12:  f(p) =  2.158e-09  
Iteration 13:  f(p) =  1.193e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  2.454e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  5.869e-21  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.318255
        1.x2 |  -1.638626
        1.x3 |  -.4670965
          x4 |  -.3829449
          x5 |   .0796804
          x6 |  -.2472425
          x7 |   .0533036
         x90 |   .0647898
         x91 |  -.1421803
         x92 |   .0748203
         x93 |   .0108845
         x94 |  -.1743659
         x95 |  -.0598728
       _cons |   1.249574
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       2.1     .0713      .237      .426      .707      1.23      2.45      4.29      10.3      19.6
         |       408         1      1.04      .038      .123      .229      .364      .649      1.26      2.02       4.7        10
         |       408      .338      .174      .025     .0766      .134      .197      .305      .459      .577       .76      .871
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .488      .184      .176      .176      .254      .324      .451      .656      .723      .878      .878
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.91     .0713      .239      .457      .837      1.51      2.33       3.8      10.3      19.6
         |       500         1      .942      .038      .123      .246      .426      .878      1.06      1.83      4.66        10
         |       500      .366      .185      .025     .0767      .142      .221       .33      .488      .656      .788      .878
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5158857  -.0646626  -.1292635   .5002384   .9957752
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096028   .0018011   .0181527   .0992189    1.19053
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0230895   .0009742    .006459   .1508306    1.04566
             |
          x4 |  .4218861   .3874422   .0344439   .0704618   .4888311    1.03212
          x5 |  25.44699   26.55341  -1.106424  -.1634853   6.767726   .5963164
          x6 |  11.84757   11.95538  -.1078065  -.0520639   2.070658   .5801817
          x7 |  7.015422   7.109363  -.0939412   -.027939    3.36237   1.147166
         x90 |  .0839738  -.0185488   .1025226   .1007704   1.017389   .8689711
         x91 | -.0648837  -.0749341   .0100504   .0107187   .9376434   1.001296
         x92 |  .0575388  -.0089745   .0665133   .0676623   .9830182   1.137144
         x93 |  .1016523   .0554893   .0461631   .0483209   .9553432   .9764335
         x94 | -.1252265  -.2080042   .0827777   .0792188   1.044925   .7282621
         x95 | -.1044649  -.1152405   .0107755   .0111364   .9675896    .854426
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  9.53838e-06
  Mean absolute standardized diff.
  .0604348443
  Maximum absolute standardized diff.
  .1634853251
  C.V. of matching weights:
  .942110983
  S.D. of matching weights:
  .9417348009
  Skewness of matching weights:
  .1565311839
  Kurtosis of matching weights:
  .0471001604
  Maximum matching weight:
  10
. }

. 
. log close gmatch_example_ado
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 closed on:  23 Feb 2018, 00:55:12
----------------------------------------------------------------------------------------------------------------------------------------------------------------
