----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Downloads\Ado-clone\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 opened on:  27 Apr 2018, 10:11:13

. 
. di as txt "Current user: `c(username)'" _n "Environment: `c(os)' `c(machine_type)' `: environment computername'" _n "Stata: `c(stata_version)'" cond(c(stata_v
> ersion)==c(version),""," (set to version `c(version)')") _n "Date: " c(current_date) " " c(current_time)
Current user: KKranker
Environment: Windows PC (64-bit x86-64) KKRANKER
Stata: 15.1
Date: 27 Apr 2018 10:11:13

. desc, short

Contains data from C:\Users\kkranker\Documents\Stata\Multiple-Equation-Models\simple_cattaneo_data.dta
  obs:         4,642                          Cattaneo (2010) study on the effect of maternal smoking on birth weight
 vars:            20                          8 Apr 2015 05:07
 size:       357,434                          
Sorted by: 
     Note: Dataset has changed since last saved.

. local varlist : copy local varlist_orig

. summ `treatvar' `varlist' `tousevar' `wgtvar' `depvars'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       treat |      4,642    .1861267    .3892508          0          1
          x1 |      4,642    .6996984    .4584385          0          1
        1.x2 |      4,642    .0340371    .1813439          0          1
-------------+---------------------------------------------------------
        1.x3 |      4,642    .0534252    .2249042          0          1
          x4 |      4,642    .4379578    .4961893          0          1
          x5 |      4,642    26.50452    5.619026         13         45
          x6 |      4,642    12.68957    2.520661          0         17
          x7 |      4,642    6.540069    3.359167          1         12
-------------+---------------------------------------------------------
         x90 |      4,642   -.0031039    1.020177  -4.107368   3.325766
         x91 |      4,642   -.0212069    1.008708   -4.16458   3.503644
         x92 |      4,642    .0076449    1.004589  -3.449011   3.959166
         x93 |      4,642    .0049339    1.004513  -4.274254   3.777972
         x94 |      4,642    .0124264    .9818583  -3.659006   3.658309
-------------+---------------------------------------------------------
         x95 |      4,642    .0044283    1.010194   -3.41615   3.724456
       touse |      4,642    .1077122      .31005          0          1
         wgt |      4,642    1.993316    .4062602   .6638338   3.540576
          y1 |      4,642     3361.68    578.8196        340       5500
   y1_binary |      4,642    .9396812    .2381022          0          1

. 
. 
. // * UNWEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. cbps `treatvar' `varlist' if `tousevar' , ate logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00451406  
Iteration 2:   f(p) =   .0005336  
Iteration 3:   f(p) =  .00001373  
Iteration 4:   f(p) =  2.637e-08  
Iteration 5:   f(p) =  6.777e-13  
Iteration 6:   f(p) =  1.066e-21  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.441064   .5046768    -2.86   0.004    -2.430213   -.4519161
        1.x2 |  -2.548784   3.501511    -0.73   0.467     -9.41162    4.314051
        1.x3 |   -1.02318   2.005094    -0.51   0.610    -4.953091    2.906732
          x4 |  -.2320966   .5678014    -0.41   0.683    -1.344967    .8807737
          x5 |   .0736983    .042799     1.72   0.085    -.0101862    .1575829
          x6 |  -.4863391   .1923869    -2.53   0.011    -.8634106   -.1092676
          x7 |   .0655415   .0720901     0.91   0.363    -.0757525    .2068354
         x90 |   .0303861    .203675     0.15   0.881    -.3688096    .4295819
         x91 |  -.0236437   .2499136    -0.09   0.925    -.5134655     .466178
         x92 |   .2014652   .2092517     0.96   0.336    -.2086606    .6115911
         x93 |  -.0067202   .2511949    -0.03   0.979    -.4990531    .4856126
         x94 |  -.3662317   .2431817    -1.51   0.132     -.842859    .1103956
         x95 |  -.0080118   .2531324    -0.03   0.975    -.5041423    .4881187
       _cons |   3.127763   1.826429     1.71   0.087    -.4519713    6.707497
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00634918  (backed up)
Iteration 2:   f(p) =   .0063378  (backed up)
Iteration 3:   f(p) =  .00608169  (backed up)
Iteration 4:   f(p) =  .00591487  (backed up)
Iteration 5:   f(p) =  .00580821  (backed up)
Iteration 6:   f(p) =  .00564021  
Iteration 7:   f(p) =  .00518187  
Iteration 8:   f(p) =  .00476717  
Iteration 9:   f(p) =  .00366175  
Iteration 10:  f(p) =  .00283608  
Iteration 11:  f(p) =  .00240552  
Iteration 12:  f(p) =  .00204833  
Iteration 13:  f(p) =  .00131786  
Iteration 14:  f(p) =  .00021667  
Iteration 15:  f(p) =  .00006364  
Iteration 16:  f(p) =   .0000133  
Iteration 17:  f(p) =  4.902e-06  
Iteration 18:  f(p) =  3.572e-07  
Iteration 19:  f(p) =  8.149e-08  
Iteration 20:  f(p) =  1.322e-09  
Iteration 21:  f(p) =  9.851e-11  
Iteration 22:  f(p) =  4.873e-12  
Iteration 23:  f(p) =  8.725e-13  
Iteration 24:  f(p) =  4.909e-15  
Iteration 25:  f(p) =  7.024e-16  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441064
        1.x2 |  -2.548784
        1.x3 |   -1.02318
          x4 |  -.2320966
          x5 |   .0736983
          x6 |  -.4863391
          x7 |   .0655415
         x90 |   .0303861
         x91 |  -.0236437
         x92 |   .2014652
         x93 |  -.0067202
         x94 |  -.3662317
         x95 |  -.0080118
       _cons |   3.127763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408      .161      .168    .00228    .00588     .0177     .0388      .102      .214        .4      .697      .887
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92      .289      .189     .0343     .0343     .0927      .126      .242      .423      .526      .928      .928
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500      .185      .179    .00228    .00648     .0207     .0485       .12      .268      .461      .712      .928
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6750468   .6750468  -7.87e-09  -1.67e-08   .4709237   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0219357   .0219357  -5.32e-09  -3.61e-08   .1472762   1.008511
             |
          x3 |
          0  |  (empty)
          1  |  .0370067   .0370067  -1.16e-09  -6.09e-09   .1898126   1.008511
             |
          x4 |  .4861037   .4861037  -5.50e-09  -1.09e-08   .5025455   1.008511
          x5 |  26.25386   26.25386  -2.69e-09  -5.07e-10   5.315176   .6747771
          x6 |  12.63471   12.63471  -7.21e-08  -3.93e-08   1.835797   .5637225
          x7 |  6.724952   6.724952  -7.31e-08  -2.03e-08   3.607676   1.190087
         x90 | -.0592246  -.0592246  -7.83e-09  -6.96e-09   1.125567   1.206644
         x91 |  .0116973   .0116973  -3.42e-08  -3.57e-08   .9589552   .9436962
         x92 | -.0041245  -.0041245   9.80e-09   8.54e-09   1.146835   1.339887
         x93 |  .0443809   .0443809   1.61e-09   1.78e-09   .9046638   .8469644
         x94 | -.0856689  -.0856689   5.55e-09   6.07e-09   .9150654   .7767335
         x95 | -.0859154  -.0859154  -1.71e-08  -1.88e-08   .9070491   .8347645
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.81263e-16
  Mean absolute standardized diff.
  1.59850e-08
  Maximum absolute standardized diff.
  3.92854e-08
  C.V. of matching weights:
  .5275373655
  S.D. of matching weights:
  .5275373655
  Skewness of matching weights:
  .2158747559
  Kurtosis of matching weights:
  .0860729233
  Maximum matching weight:
  6.906399673

. return list

scalars:
            r(wgt_max) =  6.906399673121396
       r(wgt_kurtosis) =  .0860729232915086
       r(wgt_skewness) =  .2158747559413901
             r(wgt_sd) =  .5275373655123673
             r(wgt_cv) =  .5275373655123673
            r(max_asd) =  3.92854292673e-08
           r(mean_asd) =  1.59850010374e-08
         r(mean_sd_sq) =  1.81263182424e-16

matrices:
                r(bal) :  15 x 6

. 
. cbps `treatvar' `varlist' if `tousevar' , ate over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .02441999  (not concave)
Iteration 1:   f(p) =    .020112  
Iteration 2:   f(p) =  .01484746  
Iteration 3:   f(p) =   .0142955  
Iteration 4:   f(p) =  .01428412  
Iteration 5:   f(p) =  .01428407  
Iteration 6:   f(p) =  .01428407  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.074574   .2572873    -4.18   0.000    -1.578848      -.5703
        1.x2 |  -1.732571    .847337    -2.04   0.041    -3.393321   -.0718214
        1.x3 |   -.535995   .6259896    -0.86   0.392    -1.762912    .6909221
          x4 |  -.2389831   .2458124    -0.97   0.331    -.7207666    .2428004
          x5 |   .0484453   .0243181     1.99   0.046     .0007828    .0961078
          x6 |  -.2519975   .0459113    -5.49   0.000    -.3419819    -.162013
          x7 |   .0081703   .0322545     0.25   0.800    -.0550474    .0713879
         x90 |    .120204   .1075227     1.12   0.264    -.0905366    .3309445
         x91 |  -.1467757   .1099013    -1.34   0.182    -.3621782    .0686269
         x92 |   .1315867   .1151671     1.14   0.253    -.0941367    .3573101
         x93 |    .086207   .1113523     0.77   0.439    -.1320395    .3044534
         x94 |  -.1702521    .103099    -1.65   0.099    -.3723225    .0318183
         x95 |   .0217906    .112224     0.19   0.846    -.1981643    .2417456
       _cons |   1.206345   .6074599     1.99   0.047      .015746    2.396945
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>7.142, 14) = 0.929

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02441999  
Iteration 1:   f(p) =  .02325907  (backed up)
Iteration 2:   f(p) =  .02194894  (backed up)
Iteration 3:   f(p) =  .02113175  (backed up)
Iteration 4:   f(p) =  .02063154  (backed up)
Iteration 5:   f(p) =  .02005706  (backed up)
Iteration 6:   f(p) =  .01988294  (backed up)
Iteration 7:   f(p) =  .01945151  
Iteration 8:   f(p) =  .01871274  (backed up)
Iteration 9:   f(p) =  .01797584  (backed up)
Iteration 10:  f(p) =  .01772223  (backed up)
Iteration 11:  f(p) =  .01591088  
Iteration 12:  f(p) =  .01529897  (backed up)
Iteration 13:  f(p) =  .01518486  
Iteration 14:  f(p) =  .01496596  
Iteration 15:  f(p) =  .01478242  
Iteration 16:  f(p) =   .0143579  
Iteration 17:  f(p) =  .01430269  
Iteration 18:  f(p) =  .01428447  
Iteration 19:  f(p) =  .01428413  
Iteration 20:  f(p) =  .01428409  
Iteration 21:  f(p) =  .01428409  
Iteration 22:  f(p) =  .01428408  
Iteration 23:  f(p) =  .01428408  
Iteration 24:  f(p) =  .01428408  
Iteration 25:  f(p) =  .01428408  
Iteration 26:  f(p) =  .01428408  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + IPW (overidentified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.074574
        1.x2 |  -1.732571
        1.x3 |  -.5359949
          x4 |   -.238983
          x5 |   .0484453
          x6 |  -.2519974
          x7 |   .0081703
         x90 |    .120204
         x91 |  -.1467757
         x92 |   .1315867
         x93 |    .086207
         x94 |  -.1702521
         x95 |   .0217906
       _cons |   1.206345
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408      .173      .114     .0142     .0324     .0574     .0892       .14      .232      .346      .487      .672
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92      .274       .13     .0508     .0508      .131      .157      .271      .373       .42      .673      .673
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500      .191      .123     .0142     .0339     .0609     .0967      .153      .263      .381       .55      .673
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6406563   .7027893   -.062133  -.1287898   .4824372   1.111543
             |
          x2 |
          0  |  (empty)
          1  |  .0157701   .0233767  -.0076067  -.0607234   .1252674   .6856459
             |
          x3 |
          0  |  (empty)
          1  |   .024807   .0398362  -.0150293  -.0961019   .1563887   .6378543
             |
          x4 |  .4886894   .4862356   .0024538    .004882   .5026111   1.008759
          x5 |  25.82556   26.34781  -.5222463  -.0981014   5.323538     .75999
          x6 |  12.33004    12.9064  -.5763641   -.324337   1.777053   .5881093
          x7 |   6.88452   6.669732   .2147883   .0597542   3.594528   1.180429
         x90 | -.0713183  -.0265029  -.0448154  -.0416124   1.076973   1.157748
         x91 |   .020009  -.0226109   .0426199   .0445445    .956793   .9174008
         x92 |  .0040221  -.0083767   .0123988   .0112799   1.099198   1.200576
         x93 |  .0229491    .055179    -.03223  -.0348085   .9259219   .8891008
         x94 |  -.121595  -.0231316  -.0984633  -.1082935   .9092264   .8143466
         x95 | -.0950136   -.071595  -.0234187  -.0261903   .8941728   .8041468
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0037727715
  Mean absolute standardized diff.
  .0799553015
  Maximum absolute standardized diff.
  .3243369716
  C.V. of matching weights:
  .2958975526
  S.D. of matching weights:
  .2958975526
  Skewness of matching weights:
  .1574497697
  Kurtosis of matching weights:
  .0654318606
  Maximum matching weight:
  4.204588976

. 
. cbps `treatvar' `varlist' if `tousevar' , att logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00006892  
Iteration 2:   f(p) =  1.777e-07  
Iteration 3:   f(p) =  2.570e-12  
Iteration 4:   f(p) =  6.940e-22  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.339291   .3615444    -3.70   0.000    -2.047905   -.6306769
        1.x2 |  -1.525175    1.19071    -1.28   0.200    -3.858923    .8085728
        1.x3 |  -.5996277   .8424377    -0.71   0.477    -2.250775     1.05152
          x4 |  -.3183658   .3103113    -1.03   0.305    -.9265647    .2898331
          x5 |   .0587883     .02835     2.07   0.038     .0032234    .1143533
          x6 |  -.2435676   .0675718    -3.60   0.000    -.3760059   -.1111292
          x7 |   .0341034   .0400884     0.85   0.395    -.0444685    .1126752
         x90 |    .158599   .1286436     1.23   0.218    -.0935378    .4107357
         x91 |  -.1617619    .131618    -1.23   0.219    -.4197284    .0962045
         x92 |   .1391156   .1358437     1.02   0.306    -.1271333    .4053644
         x93 |   .0571151    .134574     0.42   0.671    -.2066451    .3208752
         x94 |  -.1175052   .1193236    -0.98   0.325    -.3513752    .1163649
         x95 |    .011505   .1383574     0.08   0.934    -.2596705    .2826805
       _cons |    .782858    .962964     0.81   0.416    -1.104517    2.670233
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00194821  (backed up)
Iteration 2:   f(p) =  .00180844  (backed up)
Iteration 3:   f(p) =  .00161912  (backed up)
Iteration 4:   f(p) =   .0014555  (backed up)
Iteration 5:   f(p) =  .00139672  
Iteration 6:   f(p) =  .00123816  (backed up)
Iteration 7:   f(p) =  .00111504  
Iteration 8:   f(p) =  .00071353  
Iteration 9:   f(p) =  .00053231  (backed up)
Iteration 10:  f(p) =  .00019965  
Iteration 11:  f(p) =  .00017978  (backed up)
Iteration 12:  f(p) =  .00002781  
Iteration 13:  f(p) =  .00002426  
Iteration 14:  f(p) =  .00001134  
Iteration 15:  f(p) =  8.971e-08  
Iteration 16:  f(p) =  2.339e-09  
Iteration 17:  f(p) =  1.135e-10  
Iteration 18:  f(p) =  5.143e-13  
Iteration 19:  f(p) =  1.625e-15  
Iteration 20:  f(p) =  6.773e-18  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913   3.82e-12   7.61e-12   .5016695   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696   3.66e-10   3.51e-09   .1042572   1.008511
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217391  -2.32e-10  -1.58e-09   .1466296   1.008511
             |
          x4 |  .4347826   .4347826   3.85e-10   7.73e-10   .4984448   1.008511
          x5 |  25.46739   25.46739  -1.31e-08  -2.41e-09   5.443922   .6195799
          x6 |  11.86957   11.86957  -3.80e-09  -2.37e-09   1.605057   .5669465
          x7 |  6.858696   6.858696   2.36e-09   6.64e-10   3.556704   1.145237
         x90 |  .0972024   .0972024   2.08e-09   2.18e-09   .9537854    .845302
         x91 | -.0890157  -.0890157  -5.49e-10  -5.82e-10   .9429542   .9654928
         x92 |  .0453787   .0453787  -4.33e-11  -4.11e-11   1.051175   1.136731
         x93 |  .0865687   .0865687  -1.78e-09  -1.90e-09   .9349714   .9577067
         x94 | -.1299173  -.1299173   7.85e-10   8.48e-10   .9248091   .7795321
         x95 | -.0807251  -.0807251  -3.01e-10  -3.29e-10    .914005   .8888006
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  8.97219e-21
  Mean absolute standardized diff.
  1.32225e-09
  Maximum absolute standardized diff.
  3.50715e-09
  C.V. of matching weights:
  .8926803663
  S.D. of matching weights:
  .8926803663
  Skewness of matching weights:
  .1100078306
  Kurtosis of matching weights:
  .0225364399
  Maximum matching weight:
  7.03226062

. 
. cbps `treatvar' `varlist' if `tousevar' , att over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .04521356  
Iteration 1:   f(p) =  .03210384  
Iteration 2:   f(p) =   .0303286  
Iteration 3:   f(p) =   .0302734  
Iteration 4:   f(p) =  .03027339  
Iteration 5:   f(p) =  .03027339  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.171988   .2187737    -5.36   0.000    -1.600776   -.7431991
        1.x2 |  -1.909814   .6607307    -2.89   0.004    -3.204822   -.6148052
        1.x3 |  -.4402667   .7269474    -0.61   0.545    -1.865057     .984524
          x4 |  -.3130788   .2251092    -1.39   0.164    -.7542848    .1281272
          x5 |   .0503881   .0191417     2.63   0.008     .0128711    .0879051
          x6 |  -.2393185   .0575186    -4.16   0.000     -.352053   -.1265841
          x7 |   .0261168   .0311563     0.84   0.402    -.0349484    .0871821
         x90 |   .1425533   .1007579     1.41   0.157    -.0549285    .3400351
         x91 |  -.1282785   .1127153    -1.14   0.255    -.3491964    .0926393
         x92 |      .1073   .1112316     0.96   0.335    -.1107099    .3253099
         x93 |   .0527165   .1101053     0.48   0.632    -.1630859    .2685189
         x94 |  -.1248021   .0971592    -1.28   0.199    -.3152305    .0656263
         x95 |   .0220743   .1115296     0.20   0.843    -.1965196    .2406683
       _cons |   .9132207   .6048419     1.51   0.131    -.2722476    2.098689
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>15.137, 14) = 0.369

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .04521354  
Iteration 1:   f(p) =  .04513921  (backed up)
Iteration 2:   f(p) =  .04460857  (backed up)
Iteration 3:   f(p) =  .04286153  (backed up)
Iteration 4:   f(p) =   .0418136  (backed up)
Iteration 5:   f(p) =  .03940598  (backed up)
Iteration 6:   f(p) =  .03877849  (backed up)
Iteration 7:   f(p) =  .03872978  (backed up)
Iteration 8:   f(p) =  .03547619  (backed up)
Iteration 9:   f(p) =    .035398  (backed up)
Iteration 10:  f(p) =   .0352862  (backed up)
Iteration 11:  f(p) =  .03524563  (backed up)
Iteration 12:  f(p) =  .03421449  
Iteration 13:  f(p) =    .034135  (backed up)
Iteration 14:  f(p) =  .03154908  
Iteration 15:  f(p) =  .03049277  
Iteration 16:  f(p) =  .03028387  
Iteration 17:  f(p) =  .03027402  
Iteration 18:  f(p) =  .03027342  
Iteration 19:  f(p) =  .03027339  
Iteration 20:  f(p) =  .03027339  
Iteration 21:  f(p) =  .03027339  
Iteration 22:  f(p) =  .03027339  
Iteration 23:  f(p) =  .03027339  
Iteration 24:  f(p) =  .03027339  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + IPW (overidentified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171988
        1.x2 |  -1.909811
        1.x3 |  -.4402667
          x4 |  -.3130788
          x5 |   .0503881
          x6 |  -.2393185
          x7 |   .0261168
         x90 |   .1425533
         x91 |  -.1282785
         x92 |   .1072999
         x93 |   .0527165
         x94 |  -.1248021
         x95 |   .0220743
       _cons |   .9132204
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408      .164      .111     .0101     .0291     .0535     .0814       .13      .221       .34      .472      .599
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .151       .26      .364      .429      .666      .666
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500      .183      .122     .0101     .0298     .0577     .0913      .147      .253      .376      .555      .666
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0497079   .5016695   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0324308   .1042572   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0134481   .1466296   .9265074
             |
          x4 |  .4347826   .4386729  -.0038903  -.0078049   .4984448   1.006495
          x5 |  25.46739   25.45801   .0093781   .0017227   5.443922   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0157893   1.605057    .559006
          x7 |  6.858696   6.790863   .0678324   .0190717   3.556704   1.140985
         x90 |  .0972024   .0826851   .0145173   .0152207   .9537854   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0232211   .9429542   .9503048
         x92 |  .0453787   .0235132   .0218655    .020801   1.051175   1.138269
         x93 |  .0865687   .0849356    .001633   .0017466   .9349714   .9531308
         x94 | -.1299173  -.1339674   .0040501   .0043794   .9248091   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0068051    .914005   .8856706
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  2.71073e-06
  Mean absolute standardized diff.
  .016319196
  Maximum absolute standardized diff.
  .0497079194
  C.V. of matching weights:
  .826886456
  S.D. of matching weights:
  .826886456
  Skewness of matching weights:
  .1040781455
  Kurtosis of matching weights:
  .0213437011
  Maximum matching weight:
  6.683351127

. 
. // After calling gmatch, the data is stored in a class instance named gmatch_ado_most_recent
. // You can print any of the public functions or variables to the screen with gmatchcall. For example:
. gmatchcall diff()
                  1              2              3              4              5              6              7              8              9             10
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
  1 |  -.0249369448              0    .0033811476              0   -.0019718907   -.0038903342    .0093781189   -.0253427822    .0678324438    .0145173082
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
                 11             12             13             14             15
     ----------------------------------------------------------------------------+
  1    -.0218964664    .0218654721    .0016330445    .0040501427    -.006219912  |
     ----------------------------------------------------------------------------+

. gmatchcall balancetable()
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0497079   .5016695   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0324308   .1042572   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0134481   .1466296   .9265074
             |
          x4 |  .4347826   .4386729  -.0038903  -.0078049   .4984448   1.006495
          x5 |  25.46739   25.45801   .0093781   .0017227   5.443922   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0157893   1.605057    .559006
          x7 |  6.858696   6.790863   .0678324   .0190717   3.556704   1.140985
         x90 |  .0972024   .0826851   .0145173   .0152207   .9537854   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0232211   .9429542   .9503048
         x92 |  .0453787   .0235132   .0218655    .020801   1.051175   1.138269
         x93 |  .0865687   .0849356    .001633   .0017466   .9349714   .9531308
         x94 | -.1299173  -.1339674   .0040501   .0043794   .9248091   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0068051    .914005   .8856706
-------------------------------------------------------------------------------
  
                   1              2              3              4              5              6
     +-------------------------------------------------------------------------------------------+
   1 |   .4673913043    .4923282491   -.0249369448   -.0497079194    .5016694537    1.004458061  |
   2 |             0              0              0              .              0              .  |
   3 |   .0108695652    .0074884176    .0033811476    .0324308282     .104257207    1.458884053  |
   4 |             0              0              0              .              0              .  |
   5 |   .0217391304    .0237110212   -.0019718907   -.0134481084    .1466295976    .9265073882  |
   6 |   .4347826087    .4386729429   -.0038903342   -.0078049452    .4984447863    1.006494803  |
   7 |    25.4673913    25.45801319    .0093781189    .0017226769    5.443922081    .6273161649  |
   8 |   11.86956522      11.894908   -.0253427822   -.0157893395    1.605056511    .5590060155  |
   9 |   6.858695652    6.790863208    .0678324438    .0190717147    3.556703999    1.140985237  |
  10 |   .0972024365    .0826851283    .0145173082    .0152207288    .9537853564    .8460036786  |
  11 |  -.0890156845    -.067119218   -.0218964664   -.0232211337    .9429542393    .9503048143  |
  12 |   .0453786792    .0235132071    .0218654721    .0208009739    1.051175404     1.13826887  |
  13 |   .0865686693    .0849356248    .0016330445     .001746625    .9349714429    .9531308331  |
  14 |  -.1299172593    -.133967402    .0040501427    .0043794366    .9248090545    .7815571015  |
  15 |  -.0807250915   -.0745051795    -.006219912   -.0068051182    .9140049864    .8856705762  |
     +-------------------------------------------------------------------------------------------+

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00032638  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  8.089e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  5.298e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.466e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.466e-13  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206443
        1.x2 |  -1.628676
        1.x3 |  -.5803099
          x4 |  -.2832337
          x5 |    .069416
          x6 |   -.278787
          x7 |   .0283208
         x90 |   .1446874
         x91 |  -.1322013
         x92 |   .1288213
         x93 |   .0633599
         x94 |  -.1645469
         x95 |   .0190734
       _cons |    1.37953
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408      .232      .146     .0183     .0376     .0766      .119      .196      .313      .465      .614      .804
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .364      .163     .0707     .0707      .176      .215      .347      .492      .558      .798      .798
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500      .257      .158     .0183     .0409     .0838      .136      .216       .35      .497      .687      .804
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5065699  -.0391786  -.0780965   .5016695   1.004395
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094032   .0014663   .0140644   .1042572    1.16405
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217076   .0000315   .0002149   .1466296   1.009943
             |
          x4 |  .4347826   .4181838   .0165988   .0333011   .4984448   1.018627
          x5 |  25.46739   26.05539  -.5880032   -.108011   5.443922   .5832672
          x6 |  11.86957   11.79935   .0702201   .0437493   1.605057   .5528997
          x7 |  6.858696    6.77528   .0834157   .0234531   3.556704   1.141156
         x90 |  .0972024    .056997   .0402054   .0421535   .9537854   .8487816
         x91 | -.0890157   -.062197  -.0268186  -.0284411   .9429542   .9668971
         x92 |  .0453787   .0391245   .0062542   .0059497   1.051175   1.151879
         x93 |  .0865687     .10444  -.0178714  -.0191143   .9349714   .9622811
         x94 | -.1299173  -.1873487   .0574314   .0621009   .9248091   .7465149
         x95 | -.0807251  -.0886595   .0079344   .0086809    .914005   .8927751
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.46602e-13
  Mean absolute standardized diff.
  .0359485226
  Maximum absolute standardized diff.
  .1080109549
  C.V. of matching weights:
  .9404771682
  S.D. of matching weights:
  .9404771682
  Skewness of matching weights:
  .1710872074
  Kurtosis of matching weights:
  .0624911056
  Maximum matching weight:
  11.09495523

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .02141594  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .02005607  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01097598  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00782372  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00292673  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00193285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00085471  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00063406  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00028285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013476  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00008047  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00006324  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =   .0000443  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00003941  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00003494  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001414  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  9.450e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  8.233e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.845e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.918e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  1.597e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 21:  f(p) =  1.597e-07  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = sum(stddiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339094
        1.x2 |  -1.522718
        1.x3 |  -.6024625
          x4 |  -.3184011
          x5 |   .0587701
          x6 |  -.2435594
          x7 |   .0341083
         x90 |   .1586104
         x91 |  -.1617897
         x92 |   .1392853
         x93 |   .0571801
         x94 |  -.1174441
         x95 |   .0116348
       _cons |   1.412923
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .254      .155     .0236     .0502     .0875      .137      .212      .346        .5       .66      .749
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .395      .175     .0785     .0785      .186      .232      .402      .539      .614      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500       .28      .168     .0236     .0505     .0938      .153      .236      .392      .545      .727      .805
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673974  -6.08e-06  -.0000121   .5016695   1.008509
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .010884  -.0000145  -.0001389   .1042572   1.007184
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216918   .0000474    .000323   .1466296   1.010664
             |
          x4 |  .4347826   .4347918  -9.14e-06  -.0000183   .4984448   1.008506
          x5 |  25.46739   25.46699   .0004057   .0000745   5.443922   .6196141
          x6 |  11.86957   11.86965  -.0000811  -.0000505   1.605057   .5669426
          x7 |  6.858696   6.858709  -.0000131  -3.67e-06   3.556704   1.145253
         x90 |  .0972024   .0972214   -.000019  -.0000199   .9537854   .8453063
         x91 | -.0890157  -.0890341   .0000185   .0000196   .9429542   .9654774
         x92 |  .0453787   .0455053  -.0001267  -.0001205   1.051175   1.136737
         x93 |  .0865687   .0866238  -.0000552   -.000059   .9349714   .9577098
         x94 | -.1299173  -.1298667  -.0000506  -.0000547   .9248091   .7795587
         x95 | -.0807251  -.0806563  -.0000688  -.0000753    .914005   .8888531
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.09083e-10
  Mean absolute standardized diff.
  .0000746185
  Maximum absolute standardized diff.
  .0003230442
  C.V. of matching weights:
  .8926405827
  S.D. of matching weights:
  .8926405827
  Skewness of matching weights:
  .1100109795
  Kurtosis of matching weights:
  .0225378368
  Maximum matching weight:
  7.03125857

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet stdprogdiff depvars(`depvars') treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00185472  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00101577  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =   .0002704  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  7.076e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.219e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.547e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  2.547e-12  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = sum(stdprogdiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206434
        1.x2 |  -1.628883
        1.x3 |   -.580152
          x4 |  -.2842212
          x5 |   .0680363
          x6 |  -.2812698
          x7 |   .0362345
         x90 |   .1401282
         x91 |   -.133367
         x92 |   .1293801
         x93 |   .0654362
         x94 |  -.1708387
         x95 |   .0205359
       _cons |   1.379493
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408       .23      .147     .0179     .0369     .0748      .118      .193       .31      .464      .614        .8
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .362      .164      .072      .072      .169       .21      .349      .492      .552      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .944     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500         1      .944     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500      .255      .158     .0179     .0405      .082      .134      .213      .347      .496      .689      .805
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5034068  -.0360155  -.0717913   .5016695   1.004268
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094204   .0014491   .0138996   .1042572   1.161946
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216619   .0000773   .0005269   .1466296   1.012028
             |
          x4 |  .4347826    .420126   .0146566   .0294047   .4984448   1.017314
          x5 |  25.46739   25.99279  -.5253974  -.0965108   5.443922   .5838659
          x6 |  11.86957   11.78734   .0822301   .0512319   1.605057   .5554979
          x7 |  6.858696    6.85807    .000626    .000176   3.556704   1.143915
         x90 |  .0972024   .0536869   .0435155    .045624   .9537854   .8476454
         x91 | -.0890157  -.0631465  -.0258691  -.0274341   .9429542   .9681028
         x92 |  .0453787   .0348443   .0105344   .0100215   1.051175   1.154518
         x93 |  .0865687   .1037551  -.0171864  -.0183817   .9349714    .959736
         x94 | -.1299173  -.1918304   .0619131   .0669469   .9248091   .7493641
         x95 | -.0807251  -.0849593   .0042343   .0046326    .914005    .890953
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.12183e-07
  Mean absolute standardized diff.
  .0335832402
  Maximum absolute standardized diff.
  .0965108186
  C.V. of matching weights:
  .9444991013
  S.D. of matching weights:
  .9444991013
  Skewness of matching weights:
  .1663204641
  Kurtosis of matching weights:
  .0587514763
  Maximum matching weight:
  10.93720736
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.984     3424.984  -.0000638  -4.04e-07   3424.984
   y1_binary |    .9469116     .9469117  -8.37e-08  -1.54e-06   .9469117
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.

. 
. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.978e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -365.5251   68.93598    -5.30   0.000    -500.6371   -230.4131
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3417.895   43.41569    78.72   0.000     3332.801    3502.988
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3417.8947

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752   -.0090577      1.338962   .9989677
                  |
               x2 |
               1  |  -.1180374    .0096998      .4133173   1.098626
                  |
               x3 |
               1  |  -.1253201    .0022927      .5085817   1.015318
                  |
               x4 |  -.1207472   -.0222549      .9914484   .9947225
               x5 |  -.1944638    .0308855      .8589874   .5917507
               x6 |  -.6542694    .0952268      .4958356   .5601212
               x7 |   .0473848    .0429284      1.160037   1.132231
              x90 |   .1499304    .0130255      .9289414   .8182649
              x91 |  -.0833726   -.0288848      .8791918   .9584288
              x92 |   .0662245    .0110605      1.090179   1.139468
              x93 |   .0479737   -.0087695      .8926169   .9659809
              x94 |  -.1521926    .0562648      .8686432   .7583723
              x95 |  -.0155155     .017858      .8285405   .8879817
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296   -.009029   .5016695   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0094468   .1042572   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0022761   .1466296   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222079   .4984448   1.003118
          x5 |  25.46739   25.27307   .1943233   .0356955   5.443922    .596745
          x6 |  11.86957   11.68981   .1797533   .1119919   1.605057   .5648484
          x7 |  6.858696   6.711046   .1476493    .041513   3.556704   1.141787
         x90 |  .0972024   .0841522   .0130502   .0136825   .9537854   .8251709
         x91 | -.0890157  -.0615794  -.0274362   -.029096   .9429542   .9665176
         x92 |  .0453787   .0341522   .0112265     .01068   1.051175   1.149085
         x93 |  .0865687   .0948113  -.0082427   -.008816   .9349714   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0603727   .9248091   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0183493    .914005   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0003263824
  Mean absolute standardized diff.
  .0287043439
  Maximum absolute standardized diff.
  .1119918718
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet ipw averagevariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296   -.009029   .5016695   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0094468   .1042572   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0022761   .1466296   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222079   .4984448   1.003118
          x5 |  25.46739   25.27307   .1943233   .0356955   5.443922    .596745
          x6 |  11.86957   11.68981   .1797533   .1119919   1.605057   .5648484
          x7 |  6.858696   6.711046   .1476493    .041513   3.556704   1.141787
         x90 |  .0972024   .0841522   .0130502   .0136825   .9537854   .8251709
         x91 | -.0890157  -.0615794  -.0274362   -.029096   .9429542   .9665176
         x92 |  .0453787   .0341522   .0112265     .01068   1.051175   1.149085
         x93 |  .0865687   .0948113  -.0082427   -.008816   .9349714   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0603727   .9248091   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0183493    .914005   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0003263824
  Mean absolute standardized diff.
  .0287043439
  Maximum absolute standardized diff.
  .1119918718
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , ate aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  1.612e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |   -328.878   82.21905    -4.00   0.000    -490.0244   -167.7316
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3452.527   28.58753   120.77   0.000     3396.497    3508.558
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6643106   .6980937  -.0337831  -.0711495   .4748185   1.067096
             |
          x2 |
          0  |  (empty)
          1  |  .0126474   .0237734   -.011126  -.0990216   .1123593   .5426396
             |
          x3 |
          0  |  (empty)
          1  |  .0252967   .0398782  -.0145815  -.0923548   .1578852   .6494649
             |
          x4 |  .5035684   .4859058   .0176626   .0351336   .5027269   1.009262
          x5 |  25.88638    26.3268  -.4404207  -.0833063   5.286763   .7436049
          x6 |  12.40345   12.88502  -.4815643  -.2675151   1.800139   .5994444
          x7 |  6.783391   6.698872   .0845182   .0234373   3.606136   1.188955
         x90 | -.1279394  -.0237456  -.1041937  -.0957163   1.088568   1.179133
         x91 |  .0259183  -.0177924   .0437107    .045929   .9517017   .9105384
         x92 |  .0197006  -.0121531   .0318537   .0289953   1.098582   1.201641
         x93 |  .0303493   .0505445  -.0201952  -.0219346   .9206994   .8788976
         x94 |  -.142924  -.0216133  -.1213108  -.1347386   .9003414   .7980325
         x95 | -.0930146  -.0717394  -.0212752  -.0238956   .8903417   .7971968
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0033830969
  Mean absolute standardized diff.
  .0787021251
  Maximum absolute standardized diff.
  .2675150632
  C.V. of matching weights:
  .3337259551
  S.D. of matching weights:
  .3337259551
  Skewness of matching weights:
  .1843123883
  Kurtosis of matching weights:
  .0838509706
  Maximum matching weight:
  4.89816874

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  3.813e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |     319.07   91.15096     3.50   0.000     140.4174    497.7225
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3141.406   87.28586    35.99   0.000     2970.328    3312.483
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.207512   .3268258     3.69   0.000     .5669452    1.848079
                        |
                     x2 |
                     1  |   1.628792   1.054719     1.54   0.123    -.4384199    3.696005
                        |
                     x3 |
                     1  |   .5805318   .8259794     0.70   0.482    -1.038358    2.199422
                     x4 |   .2831153   .2838113     1.00   0.318    -.2731445    .8393752
                     x5 |  -.0545179   .0270259    -2.02   0.044    -.1074878   -.0015481
                     x6 |   .2844593   .0688093     4.13   0.000     .1495955     .419323
                     x7 |   -.023871   .0390129    -0.61   0.541    -.1003349    .0525929
                    x90 |  -.1439494   .1292697    -1.11   0.265    -.3973133    .1094145
                    x91 |   .1331182   .1248073     1.07   0.286    -.1114997    .3777361
                    x92 |  -.1277527    .133834    -0.95   0.340    -.3900625    .1345572
                    x93 |  -.0623585   .1243317    -0.50   0.616    -.3060441    .1813271
                    x94 |   .1663354   .1194682     1.39   0.164    -.0678179    .4004887
                    x95 |   -.017776   .1254901    -0.14   0.887     -.263732    .2281801
                  _cons |  -1.379538   .9297905    -1.48   0.138    -3.201894    .4428177
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ateu ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .7133644        .75  -.0366356  -.0805767   .4546676   1.099818
             |
          x2 |
          0  |  (empty)
          1  |  .0130902   .0269608  -.0138706  -.1213694    .114284   .4966403
             |
          x3 |
          0  |  (empty)
          1  |  .0261829   .0441176  -.0179347  -.1117052    .160554    .609761
             |
          x4 |  .5207033    .495098   .0256053   .0509752   .5023086   1.006879
          x5 |  25.99075   26.56863   -.577878  -.1102481   5.241616   .7963305
          x6 |  12.53645   13.15931  -.6228673  -.3420328   1.821075   .6382822
          x7 |  6.764632   6.696078   .0685532   .0189473   3.618098   1.200431
         x90 | -.1840235   -.048508  -.1355155  -.1218141   1.112478   1.263776
         x91 |   .054549  -.0077434   .0622924   .0654547   .9516875   .8955527
         x92 |   .013304  -.0227801   .0360842   .0325087   1.109983    1.21557
         x93 |  .0163448   .0403853  -.0240406  -.0262289   .9165674    .857822
         x94 | -.1461641   .0160559  -.1622201  -.1814314   .8941124   .8119355
         x95 |  -.096076  -.0658282  -.0302478  -.0342045   .8843216   .7755988
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0054728711
  Mean absolute standardized diff.
  .0998074588
  Maximum absolute standardized diff.
  .3420327542
  C.V. of matching weights:
  .3545137453
  S.D. of matching weights:
  .3545137453
  Skewness of matching weights:
  .2680619555
  Kurtosis of matching weights:
  .1550433574
  Maximum matching weight:
  5.869225798

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00194821  (backed up)
Iteration 2:   f(p) =  .00180844  (backed up)
Iteration 3:   f(p) =  .00161912  (backed up)
Iteration 4:   f(p) =   .0014555  (backed up)
Iteration 5:   f(p) =  .00139672  
Iteration 6:   f(p) =  .00123816  (backed up)
Iteration 7:   f(p) =  .00111504  
Iteration 8:   f(p) =  .00071353  
Iteration 9:   f(p) =  .00053231  (backed up)
Iteration 10:  f(p) =  .00019965  
Iteration 11:  f(p) =  .00017978  (backed up)
Iteration 12:  f(p) =  .00002781  
Iteration 13:  f(p) =  .00002426  
Iteration 14:  f(p) =  .00001134  
Iteration 15:  f(p) =  8.971e-08  
Iteration 16:  f(p) =  2.339e-09  
Iteration 17:  f(p) =  1.135e-10  
Iteration 18:  f(p) =  5.143e-13  
Iteration 19:  f(p) =  1.625e-15  
Iteration 20:  f(p) =  6.773e-18  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913   3.82e-12   7.61e-12   .5016695   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696   3.66e-10   3.51e-09   .1042572   1.008511
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217391  -2.32e-10  -1.58e-09   .1466296   1.008511
             |
          x4 |  .4347826   .4347826   3.85e-10   7.73e-10   .4984448   1.008511
          x5 |  25.46739   25.46739  -1.31e-08  -2.41e-09   5.443922   .6195799
          x6 |  11.86957   11.86957  -3.80e-09  -2.37e-09   1.605057   .5669465
          x7 |  6.858696   6.858696   2.36e-09   6.64e-10   3.556704   1.145237
         x90 |  .0972024   .0972024   2.08e-09   2.18e-09   .9537854    .845302
         x91 | -.0890157  -.0890157  -5.49e-10  -5.82e-10   .9429542   .9654928
         x92 |  .0453787   .0453787  -4.33e-11  -4.11e-11   1.051175   1.136731
         x93 |  .0865687   .0865687  -1.78e-09  -1.90e-09   .9349714   .9577067
         x94 | -.1299173  -.1299173   7.85e-10   8.48e-10   .9248091   .7795321
         x95 | -.0807251  -.0807251  -3.01e-10  -3.29e-10    .914005   .8888006
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  8.97219e-21
  Mean absolute standardized diff.
  1.32225e-09
  Maximum absolute standardized diff.
  3.50715e-09
  C.V. of matching weights:
  .8926803663
  S.D. of matching weights:
  .8926803663
  Skewness of matching weights:
  .1100078306
  Kurtosis of matching weights:
  .0225364399
  Maximum matching weight:
  7.03226062

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .75 6)

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00258314  
Iteration 1:   f(p) =  .00254759  (backed up)
Iteration 2:   f(p) =  .00213388  
Iteration 3:   f(p) =  .00166322  
Iteration 4:   f(p) =  .00130014  
Iteration 5:   f(p) =   .0011385  
Iteration 6:   f(p) =  .00097915  
Iteration 7:   f(p) =  .00087826  
Iteration 8:   f(p) =  .00081485  
Iteration 9:   f(p) =  .00077846  
Iteration 10:  f(p) =  .00073125  
Iteration 11:  f(p) =   .0005928  
Iteration 12:  f(p) =  .00050082  
Iteration 13:  f(p) =  .00034152  
Iteration 14:  f(p) =  .00030799  
Iteration 15:  f(p) =  .00023725  
Iteration 16:  f(p) =  .00018577  
Iteration 17:  f(p) =  .00015524  
Iteration 18:  f(p) =  .00013953  
Iteration 19:  f(p) =  .00013907  
Iteration 20:  f(p) =  .00013793  
Iteration 21:  f(p) =  .00013496  
Iteration 22:  f(p) =  .00013336  
Iteration 23:  f(p) =  .00013223  
Iteration 24:  f(p) =  .00013201  
Iteration 25:  f(p) =  .00013201  
Iteration 26:  f(p) =  .00013195  
Iteration 27:  f(p) =  .00013183  
Iteration 28:  f(p) =  .00013173  
Iteration 29:  f(p) =   .0001316  
Iteration 30:  f(p) =  .00013159  
Iteration 31:  f(p) =  .00013159  
Iteration 32:  f(p) =  .00013159  
Iteration 33:  f(p) =  .00013159  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.311676
        1.x2 |  -1.503725
        1.x3 |   -.586022
          x4 |  -.3101718
          x5 |   .0572362
          x6 |  -.2387305
          x7 |   .0331449
         x90 |   .1546186
         x91 |  -.1578585
         x92 |   .1345352
         x93 |   .0560137
         x94 |  -.1151477
         x95 |   .0100885
       _cons |   .7517906
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .965     .0602       .13      .235      .388      .646      1.25      2.34      4.46      6.77
         |       408         1      .965     .0602       .13      .235      .388      .646      1.25      2.34      4.46      6.77
         |       408      .164      .115     .0133     .0283     .0502     .0801      .127       .22      .345      .501      .603
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .271      .146      .045      .045       .11       .14      .263      .379      .453      .677      .677
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .872     .0602      .132      .255      .445      .819      1.06      2.05      4.41      6.77
         |       500         1      .872     .0602      .132      .255      .445      .819      1.06      2.05      4.41      6.77
         |       500      .183      .128     .0133     .0288     .0539     .0891      .142      .255      .385      .578      .677
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4722946  -.0049032  -.0097739   .5016695   1.007314
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0110187  -.0001491  -.0014303   .1042572   .9950131
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0219991    -.00026  -.0017729   .1466296   .9968588
             |
          x4 |  .4347826   .4369547  -.0021721  -.0043577   .4984448   1.007369
          x5 |  25.46739   25.46897  -.0015776  -.0002898   5.443922    .622871
          x6 |  11.86957   11.88942  -.0198542  -.0123698   1.605057   .5645074
          x7 |  6.858696   6.853235   .0054608   .0015354   3.556704   1.145159
         x90 |  .0972024   .0945558   .0026466   .0027748   .9537854   .8466628
         x91 | -.0890157  -.0872489  -.0017668  -.0018737   .9429542   .9625959
         x92 |  .0453787    .042979   .0023996   .0022828   1.051175   1.135593
         x93 |  .0865687   .0853582   .0012104   .0012946   .9349714   .9551205
         x94 | -.1299173   -.126313  -.0036043  -.0038974   .9248091   .7816256
         x95 | -.0807251  -.0817926   .0010675   .0011679    .914005   .8873513
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.22138e-06
  Mean absolute standardized diff.
  .0034477622
  Maximum absolute standardized diff.
  .0123698068
  C.V. of matching weights:
  .8717816379
  S.D. of matching weights:
  .8717816379
  Skewness of matching weights:
  .1071680158
  Kurtosis of matching weights:
  .0215717627
  Maximum matching weight:
  6.773880472

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .50 6)

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02716603  
Iteration 1:   f(p) =  .02482042  
Iteration 2:   f(p) =  .02211746  
Iteration 3:   f(p) =   .0149854  
Iteration 4:   f(p) =  .00752318  
Iteration 5:   f(p) =  .00566264  
Iteration 6:   f(p) =  .00487167  
Iteration 7:   f(p) =  .00433993  
Iteration 8:   f(p) =  .00423872  
Iteration 9:   f(p) =  .00417441  
Iteration 10:  f(p) =   .0040365  
Iteration 11:  f(p) =  .00339103  
Iteration 12:  f(p) =  .00307475  
Iteration 13:  f(p) =  .00294632  
Iteration 14:  f(p) =  .00289422  
Iteration 15:  f(p) =    .002875  
Iteration 16:  f(p) =  .00286076  
Iteration 17:  f(p) =  .00284625  
Iteration 18:  f(p) =  .00283613  
Iteration 19:  f(p) =  .00283499  
Iteration 20:  f(p) =  .00283436  
Iteration 21:  f(p) =  .00283403  
Iteration 22:  f(p) =  .00283223  
Iteration 23:  f(p) =  .00282623  
Iteration 24:  f(p) =  .00282435  
Iteration 25:  f(p) =  .00282288  
Iteration 26:  f(p) =  .00282273  
Iteration 27:  f(p) =  .00282259  
Iteration 28:  f(p) =  .00282245  
Iteration 29:  f(p) =  .00282173  
Iteration 30:  f(p) =  .00282138  
Iteration 31:  f(p) =  .00282137  
Iteration 32:  f(p) =  .00282136  
Iteration 33:  f(p) =  .00282136  
Iteration 34:  f(p) =  .00282136  
Iteration 35:  f(p) =  .00282136  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.128926
        1.x2 |  -1.353003
        1.x3 |  -.5084807
          x4 |  -.2607935
          x5 |   .0476608
          x6 |  -.2087548
          x7 |   .0274109
         x90 |   .1306772
         x91 |  -.1341209
         x92 |   .1086994
         x93 |   .0491809
         x94 |  -.0998047
         x95 |   .0026918
       _cons |   .5325846
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .822     .0873      .171      .302      .463      .707      1.27      2.21      3.76      5.37
         |       408         1      .822     .0873      .171      .302      .463      .707      1.27      2.21      3.76      5.37
         |       408      .164      .101     .0186     .0356     .0615     .0912      .133      .215      .324      .449      .538
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .258      .124     .0552     .0552       .12      .146      .251      .353      .409      .609      .609
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .742     .0873      .178       .32       .51      .883      1.07      1.96      3.71      5.37
         |       500         1      .742     .0873      .178       .32       .51      .883      1.07      1.96      3.71      5.37
         |       500      .181      .112     .0186      .037     .0643      .098      .147      .245      .354      .518      .609
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5066004  -.0392091  -.0781572   .5016695   1.004397
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0120828  -.0012132  -.0116367   .1042572   .9083622
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023715  -.0019759  -.0134755   .1466296   .9263544
             |
          x4 |  .4347826     .44897  -.0141874  -.0284633   .4984448   1.001788
          x5 |  25.46739   25.51543  -.0480365  -.0088239   5.443922    .644616
          x6 |  11.86957   12.02244  -.1528711  -.0952434   1.605057   .5493112
          x7 |  6.858696    6.82087   .0378256    .010635   3.556704   1.145475
         x90 |  .0972024   .0771855   .0200169   .0209868   .9537854    .856898
         x91 | -.0890157  -.0767709  -.0122448  -.0129855   .9429542   .9446754
         x92 |  .0453787   .0302079   .0151708   .0144322   1.051175   1.128915
         x93 |  .0865687   .0784825   .0080862   .0086486   .9349714   .9397043
         x94 | -.1299173  -.1037524  -.0261649  -.0282922   .9248091   .7941215
         x95 | -.0807251  -.0875134   .0067883    .007427    .914005   .8788177
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002733885
  Mean absolute standardized diff.
  .0260928746
  Maximum absolute standardized diff.
  .0952434315
  C.V. of matching weights:
  .7422277718
  S.D. of matching weights:
  .7422277718
  Skewness of matching weights:
  .0911876059
  Kurtosis of matching weights:
  .0167704008
  Maximum matching weight:
  5.368308402

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00093921  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00042753  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00003686  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00002767  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00001518  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.684e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  3.117e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  1.306e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.977e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  7.501e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.838e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  4.674e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.256e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  3.975e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  3.921e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  3.899e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  3.886e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  1.840e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.840e-10  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.143285
        1.x2 |  -1.628315
        1.x3 |  -.5817516
          x4 |   -.259203
          x5 |  -.0050244
          x6 |  -.0247024
          x7 |  -.0640398
         x90 |   .0628364
         x91 |  -.1378518
         x92 |   .0677606
         x93 |  -.0030837
         x94 |  -.1065554
         x95 |  -.0108233
       _cons |   1.418741
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .773     .0855      .249      .405      .511      .686      1.15      2.16      3.61      4.94
         |       408         1      .773     .0855      .249      .405      .511      .686      1.15      2.16      3.61      4.94
         |       408       .38      .144     .0594      .155       .23      .274      .336      .459      .614      .727      .785
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .481      .153      .195      .195      .286      .339      .506      .604      .687      .752      .752
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .698     .0855      .254      .428      .554      .843         1      2.03      3.59      4.94
         |       500         1      .698     .0855      .254      .428      .554      .843         1      2.03      3.59      4.94
         |       500      .398      .151     .0594      .158      .237      .284      .354      .515      .627      .748      .785
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4886649  -.0212736  -.0424055   .5016695   1.004738
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0089759   .0018937   .0181635   .1042572   1.218947
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0189526   .0027865   .0190039   .1466296   1.153503
             |
          x4 |  .4347826   .5038997  -.0691171  -.1386655   .4984448   .9914134
          x5 |  25.46739   24.59121   .8761821   .1609469   5.443922   .7848157
          x6 |  11.86957   12.47577  -.6062095  -.3776873   1.605057   .5168367
          x7 |  6.858696   5.854283   1.004413   .2823998   3.556704   1.158311
         x90 |  .0972024   .0748458   .0223566   .0234399   .9537854   .8431975
         x91 | -.0890157  -.0978482   .0088325   .0093668   .9429542   .9297243
         x92 |  .0453787   .0519352  -.0065566  -.0062374   1.051175   1.100358
         x93 |  .0865687    .045241   .0413277   .0442021   .9349714   .9437199
         x94 | -.1299173  -.1267786  -.0031386  -.0033938   .9248091   .8389463
         x95 | -.0807251  -.0907176   .0099925   .0109327    .914005   .8730806
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  2.58476e-11
  Mean absolute standardized diff.
  .0874496225
  Maximum absolute standardized diff.
  .377687303
  C.V. of matching weights:
  .6983434666
  S.D. of matching weights:
  .6983434666
  Skewness of matching weights:
  .0954310063
  Kurtosis of matching weights:
  .0167621492
  Maximum matching weight:
  4.939789692

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .0255221  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00707055  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00121893  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00077435  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00038439  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00027065  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00020657  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00014905  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004814  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00002729  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00002254  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00001783  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001699  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00001552  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00001133  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  9.051e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  2.745e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  1.278e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.474e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  2.155e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.112e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.949e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.908e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  1.907e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.903e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.893e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.886e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.883e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.882e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.878e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  1.686e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  5.628e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  2.594e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  4.217e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.446e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  1.159e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  2.474e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  2.389e-10  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.5162366
        1.x2 |   -1.63225
        1.x3 |  -.6074194
          x4 |  -.1809629
          x5 |  -.0132043
          x6 |  -.0512298
          x7 |  -.0344641
         x90 |  -.1460405
         x91 |  -.1125863
         x92 |  -.1597617
         x93 |   -.110326
         x94 |  -.0126237
         x95 |  -.1432016
       _cons |   1.379962
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .525      .117      .158       .46      .644      .897      1.22      1.68      2.89       3.4
         |       408         1      .525      .117      .158       .46      .644      .897      1.22      1.68      2.89       3.4
         |       408      .406      .116     .0816      .107      .258      .328      .404       .48      .559      .686       .72
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .463       .11      .138      .138      .327      .395       .46      .538      .615        .7        .7
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .474      .117      .195      .496      .714         1      1.13      1.57      2.84       3.4
         |       500         1      .474      .117      .195      .496      .714         1      1.13      1.57      2.84       3.4
         |       500      .417      .117     .0816      .123       .27      .342      .414      .492       .57       .69       .72
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .6184998  -.1511085  -.3012112   .5016695   1.063984
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .007067   .0038026   .0364734   .1042572   1.545234
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0190847   .0026545   .0181031   .1466296   1.145674
             |
          x4 |  .4347826   .5120366   -.077254  -.1549901   .4984448   .9919279
          x5 |  25.46739   25.20907   .2583189   .0474509   5.443922   .7925318
          x6 |  11.86957   12.55434   -.684773  -.4266348   1.605057   .5017915
          x7 |  6.858696   6.331255   .5274402   .1482947   3.556704   1.139832
         x90 |  .0972024  -.1535064   .2507088   .2628566   .9537854   .8825625
         x91 | -.0890157  -.0816104  -.0074053  -.0078533   .9429542   .9252435
         x92 |  .0453787  -.1829363    .228315   .2171997   1.051175   1.110788
         x93 |  .0865687   -.070593   .1571617   .1680925   .9349714   .8445113
         x94 | -.1299173  -.0124397  -.1174776   -.127029   .9248091   .8367656
         x95 | -.0807251   -.189714   .1089889   .1192432    .914005   .8748324
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.08410e-13
  Mean absolute standardized diff.
  .1565717341
  Maximum absolute standardized diff.
  .4266348428
  C.V. of matching weights:
  .4740568708
  S.D. of matching weights:
  .4740568708
  Skewness of matching weights:
  .0722339771
  Kurtosis of matching weights:
  .0146227314
  Maximum matching weight:
  3.400995323

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw treatvariance cvtarget(1 .75 6)

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .04582637  
Iteration 1:   f(p) =  .04582089  (backed up)
Iteration 2:   f(p) =  .04335948  
Iteration 3:   f(p) =  .04130519  
Iteration 4:   f(p) =  .03946086  
Iteration 5:   f(p) =  .03573644  
Iteration 6:   f(p) =  .03488909  
Iteration 7:   f(p) =  .03392194  
Iteration 8:   f(p) =  .03325829  
Iteration 9:   f(p) =  .03166122  
Iteration 10:  f(p) =  .03075756  
Iteration 11:  f(p) =   .0305981  
Iteration 12:  f(p) =  .03053833  
Iteration 13:  f(p) =  .03050263  
Iteration 14:  f(p) =  .03048252  
Iteration 15:  f(p) =  .03042469  
Iteration 16:  f(p) =  .03034439  
Iteration 17:  f(p) =  .03032746  
Iteration 18:  f(p) =  .03032401  
Iteration 19:  f(p) =  .03031557  
Iteration 20:  f(p) =  .03029889  
Iteration 21:  f(p) =  .03029384  
Iteration 22:  f(p) =  .03029373  
Iteration 23:  f(p) =  .03029372  
Iteration 24:  f(p) =  .03029372  
Iteration 25:  f(p) =  .03029372  
Iteration 26:  f(p) =  .03029372  
Iteration 27:  f(p) =  .03029372  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + IPW (overidentified) + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171262
        1.x2 |  -1.907853
        1.x3 |  -.4398346
          x4 |   -.312735
          x5 |   .0503544
          x6 |  -.2391386
          x7 |   .0260923
         x90 |     .14244
         x91 |  -.1282174
         x92 |   .1072215
         x93 |   .0526791
         x94 |  -.1246876
         x95 |    .022016
       _cons |     .91173
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .915     .0459      .135      .254      .398      .671      1.27      2.31      4.01      6.67
         |       408         1      .915     .0459      .135      .254      .398      .671      1.27      2.31      4.01      6.67
         |       408      .164      .111     .0101     .0292     .0536     .0815       .13      .221       .34      .472      .598
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .152       .26      .364      .429      .665      .665
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .826     .0459      .138      .277      .455      .871      1.06      2.01      3.95      6.67
         |       500         1      .826     .0459      .138      .277      .455      .871      1.06      2.01      3.95      6.67
         |       500      .183      .122     .0101     .0299     .0578     .0914      .147      .253      .376      .555      .665
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4924888  -.0250975  -.0500279   .5016695   1.004448
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0075009   .0033687   .0323112   .1042572   1.456477
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0237246  -.0019854  -.0135405   .1466296   .9259914
             |
          x4 |  .4347826    .438739  -.0039564  -.0079376   .4984448   1.006462
          x5 |  25.46739   25.45848   .0089126   .0016372   5.443922   .6274326
          x6 |  11.86957   11.89571  -.0261456  -.0162895   1.605057   .5589279
          x7 |  6.858696   6.790761   .0679345   .0191004   3.556704   1.140999
         x90 |  .0972024   .0826042   .0145983   .0153056   .9537854   .8460755
         x91 | -.0890157  -.0671111  -.0219046  -.0232298   .9429542    .950224
         x92 |  .0453787   .0234969   .0218818   .0208165   1.051175   1.138208
         x93 |  .0865687   .0848872   .0016815   .0017984   .9349714   .9530463
         x94 | -.1299173  -.1338072   .0038899   .0042062   .9248091   .7816256
         x95 | -.0807251   -.074538  -.0061871  -.0067692    .914005   .8856256
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  3.02732e-06
  Mean absolute standardized diff.
  .0163823042
  Maximum absolute standardized diff.
  .0500279049
  C.V. of matching weights:
  .8262046999
  S.D. of matching weights:
  .8262046999
  Skewness of matching weights:
  .1039854904
  Kurtosis of matching weights:
  .0213120642
  Maximum matching weight:
  6.674946414

. 
. // furthermore, you can target skiwness, kurtosis, or max weight
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance cvtarget(1 .5 6) skewtarget(1 0.07 2)

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .03119523  
Iteration 1:   f(p) =  .02777165  
Iteration 2:   f(p) =   .0261282  (backed up)
Iteration 3:   f(p) =  .01818654  
Iteration 4:   f(p) =  .00858097  
Iteration 5:   f(p) =  .00571921  
Iteration 6:   f(p) =   .0052299  
Iteration 7:   f(p) =   .0049539  
Iteration 8:   f(p) =  .00477142  
Iteration 9:   f(p) =  .00468944  
Iteration 10:  f(p) =  .00460082  
Iteration 11:  f(p) =  .00435433  
Iteration 12:  f(p) =  .00395863  
Iteration 13:  f(p) =   .0034667  
Iteration 14:  f(p) =  .00332922  
Iteration 15:  f(p) =  .00329035  
Iteration 16:  f(p) =  .00325483  
Iteration 17:  f(p) =  .00322843  
Iteration 18:  f(p) =  .00321309  
Iteration 19:  f(p) =  .00321088  
Iteration 20:  f(p) =  .00320996  
Iteration 21:  f(p) =  .00320963  
Iteration 22:  f(p) =  .00320846  
Iteration 23:  f(p) =  .00320582  
Iteration 24:  f(p) =   .0032026  
Iteration 25:  f(p) =  .00319778  
Iteration 26:  f(p) =  .00319696  
Iteration 27:  f(p) =  .00319685  
Iteration 28:  f(p) =  .00319669  
Iteration 29:  f(p) =  .00319644  
Iteration 30:  f(p) =  .00319502  
Iteration 31:  f(p) =  .00319429  
Iteration 32:  f(p) =  .00319426  
Iteration 33:  f(p) =  .00319424  
Iteration 34:  f(p) =  .00319424  
Iteration 35:  f(p) =  .00319424  
Iteration 36:  f(p) =  .00319424  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6) + 1*abs(wgt_skewness()-.07)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |   -1.13974
        1.x2 |  -1.371706
        1.x3 |  -.4994344
          x4 |  -.2478422
          x5 |   .0464634
          x6 |  -.2034413
          x7 |   .0267612
         x90 |   .1245004
         x91 |  -.1318609
         x92 |   .1026308
         x93 |   .0464343
         x94 |  -.0933963
         x95 |  -.0007791
       _cons |    .501482
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .814     .0864      .176      .308      .468      .701      1.25      2.22      3.74      5.01
         |       408         1      .814     .0864      .176      .308      .468      .701      1.25      2.22      3.74      5.01
         |       408      .163        .1     .0183     .0367     .0624     .0918      .131      .213      .325      .447       .52
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .257      .123     .0569     .0569      .121      .144      .243      .354      .408      .601      .601
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .735     .0864      .183      .326      .514      .876      1.05      1.99      3.68      5.01
         |       500         1      .735     .0864      .183      .326      .514      .876      1.05      1.99      3.68      5.01
         |       500      .181      .111     .0183     .0381     .0652     .0983      .146      .242      .354      .506      .601
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5031977  -.0358063  -.0713744   .5016695   1.004263
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0119033  -.0010337  -.0099148   .1042572   .9218945
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0236541  -.0019149  -.0130597   .1466296   .9286837
             |
          x4 |  .4347826   .4543818  -.0195992  -.0393207   .4984448   .9996744
          x5 |  25.46739   25.45655   .0108434   .0019918   5.443922   .6476594
          x6 |  11.86957   12.03036  -.1607967  -.1001813   1.605057   .5490457
          x7 |  6.858696    6.81919   .0395061   .0111075   3.556704   1.145371
         x90 |  .0972024   .0739654    .023237   .0243629   .9537854    .856119
         x91 | -.0890157  -.0742361  -.0147796  -.0156737   .9429542   .9446611
         x92 |  .0453787   .0250391   .0203396   .0193494   1.051175   1.126266
         x93 |  .0865687   .0746315   .0119372   .0127674   .9349714   .9373515
         x94 | -.1299173   -.096251  -.0336663  -.0364035   .9248091   .7971814
         x95 | -.0807251   -.088412   .0076869   .0084101    .914005   .8786005
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002558498
  Mean absolute standardized diff.
  .0279936444
  Maximum absolute standardized diff.
  .100181304
  C.V. of matching weights:
  .7349734748
  S.D. of matching weights:
  .7349734748
  Skewness of matching weights:
  .0877786339
  Kurtosis of matching weights:
  .0154257874
  Maximum matching weight:
  5.01308956

. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance maxtarget(1 10 2) difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =   .5075493  
Iteration 1:   f(p) =  .06535889  (backed up)
Iteration 2:   f(p) =  .05648035  
Iteration 3:   f(p) =  .05340877  
Iteration 4:   f(p) =  .02443434  
Iteration 5:   f(p) =  .01915238  
Iteration 6:   f(p) =  .00693031  
Iteration 7:   f(p) =  .00420386  
Iteration 8:   f(p) =  .00378573  
Iteration 9:   f(p) =  .00291476  
Iteration 10:  f(p) =  .00275299  
Iteration 11:  f(p) =  .00231594  
Iteration 12:  f(p) =  .00202958  
Iteration 13:  f(p) =  .00184473  
Iteration 14:  f(p) =  .00166331  
Iteration 15:  f(p) =  .00159612  
Iteration 16:  f(p) =  .00154143  
Iteration 17:  f(p) =  .00147507  
Iteration 18:  f(p) =  .00144169  
Iteration 19:  f(p) =  .00141877  
Iteration 20:  f(p) =  .00137925  
Iteration 21:  f(p) =  .00132273  
Iteration 22:  f(p) =  .00118848  
Iteration 23:  f(p) =  .00111314  
Iteration 24:  f(p) =  .00106608  
Iteration 25:  f(p) =  .00104062  
Iteration 26:  f(p) =  .00102019  
Iteration 27:  f(p) =  .00099523  
Iteration 28:  f(p) =  .00098078  
Iteration 29:  f(p) =  .00096632  
Iteration 30:  f(p) =  .00095948  
Iteration 31:  f(p) =  .00095782  
Iteration 32:  f(p) =   .0009572  
Iteration 33:  f(p) =   .0009559  
Iteration 34:  f(p) =  .00095311  
Iteration 35:  f(p) =  .00094554  
Iteration 36:  f(p) =  .00094306  
Iteration 37:  f(p) =  .00094294  
Iteration 38:  f(p) =   .0009429  
Iteration 39:  f(p) =  .00094289  
Iteration 40:  f(p) =  .00094288  
Iteration 41:  f(p) =  .00094287  
Iteration 42:  f(p) =  .00094282  
Iteration 43:  f(p) =   .0009428  
Iteration 44:  f(p) =  .00094279  
Iteration 45:  f(p) =  .00094274  
Iteration 46:  f(p) =  .00094269  
Iteration 47:  f(p) =  .00094269  
Iteration 48:  f(p) =  .00094269  
Iteration 49:  f(p) =  .00094269  
Iteration 50:  f(p) =  .00094269  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.341982
        1.x2 |  -1.527825
        1.x3 |   -.642179
          x4 |  -.2909765
          x5 |   .0689699
          x6 |  -.2739381
          x7 |   .0333146
         x90 |   .1718678
         x91 |  -.1717977
         x92 |   .1664977
         x93 |   .0683693
         x94 |  -.1496911
         x95 |   .0262811
       _cons |   .8724488
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.07     .0528      .108      .206      .348      .621      1.24      2.39      4.59        10
         |       408         1      1.07     .0528      .108      .206      .348      .621      1.24      2.39      4.59        10
         |       408      .162      .121     .0118     .0239     .0446      .073      .123      .218      .351       .51      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .154      .039      .039      .105       .14      .262      .385      .452      .718      .718
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .966     .0528      .108      .226      .411      .796      1.04      2.05      4.57        10
         |       500         1      .966     .0528      .108      .226      .411      .796      1.04      2.05      4.57        10
         |       500      .182      .135     .0118     .0239     .0484     .0825       .14      .253      .393      .613      .718
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913    .475182  -.0077906  -.0155294   .5016695   1.006702
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0106709   .0001987    .001906   .1042572   1.027085
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0212789   .0004602   .0031384   .1466296   1.029837
             |
          x4 |  .4347826     .42582   .0089626   .0179811   .4984448   1.013665
          x5 |  25.46739   25.73796  -.2705702  -.0497013   5.443922   .5927602
          x6 |  11.86957    11.7919   .0776634   .0483867   1.605057   .5643898
          x7 |  6.858696   6.816429   .0422663   .0118835   3.556704    1.14552
         x90 |  .0972024   .0941298   .0030726   .0032215   .9537854   .8470025
         x91 | -.0890157  -.0934435   .0044278   .0046957   .9429542    .974533
         x92 |  .0453787   .0669465  -.0215678  -.0205178   1.051175   1.142412
         x93 |  .0865687   .1016144  -.0150457  -.0160922   .9349714   .9709656
         x94 | -.1299173  -.1705264   .0406092   .0439109   .9248091   .7579989
         x95 | -.0807251  -.0799103  -.0008148  -.0008915    .914005   .8962111
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  6.20840e-06
  Mean absolute standardized diff.
  .018296619
  Maximum absolute standardized diff.
  .0497013362
  C.V. of matching weights:
  .9657698677
  S.D. of matching weights:
  .9657698677
  Skewness of matching weights:
  .1445155925
  Kurtosis of matching weights:
  .0421490287
  Maximum matching weight:
  9.999710034
. }

. 
. // * WEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00008909  
Iteration 1:   f(p) =  .00006006  
Iteration 2:   f(p) =  .00005798  
Iteration 3:   f(p) =  .00005798  
Iteration 4:   f(p) =  .00005797  
Iteration 5:   f(p) =  .00005722  
Iteration 6:   f(p) =  .00004799  
Iteration 7:   f(p) =  .00002164  
Iteration 8:   f(p) =  .00001682  
Iteration 9:   f(p) =  .00001603  
Iteration 10:  f(p) =  .00001599  
Iteration 11:  f(p) =  .00001599  
Iteration 12:  f(p) =  .00001598  
Iteration 13:  f(p) =   .0000159  
Iteration 14:  f(p) =  .00001408  
Iteration 15:  f(p) =  7.665e-06  
Iteration 16:  f(p) =  5.086e-06  
Iteration 17:  f(p) =  4.993e-06  
Iteration 18:  f(p) =  4.991e-06  
Iteration 19:  f(p) =  4.991e-06  
Iteration 20:  f(p) =  4.823e-06  
Iteration 21:  f(p) =  2.177e-06  
Iteration 22:  f(p) =  1.975e-06  
Iteration 23:  f(p) =  1.975e-06  
Iteration 24:  f(p) =  1.975e-06  
Iteration 25:  f(p) =  1.973e-06  
Iteration 26:  f(p) =  1.837e-06  
Iteration 27:  f(p) =  8.764e-07  
Iteration 28:  f(p) =  8.670e-07  
Iteration 29:  f(p) =  8.670e-07  
Iteration 30:  f(p) =  8.668e-07  
Iteration 31:  f(p) =  8.606e-07  
Iteration 32:  f(p) =  6.855e-07  
Iteration 33:  f(p) =  3.275e-07  
Iteration 34:  f(p) =  3.129e-07  
Iteration 35:  f(p) =  3.129e-07  
Iteration 36:  f(p) =  3.129e-07  
Iteration 37:  f(p) =  3.126e-07  
Iteration 38:  f(p) =  2.902e-07  
Iteration 39:  f(p) =  1.500e-07  
Iteration 40:  f(p) =  7.211e-08  
Iteration 41:  f(p) =  6.958e-08  
Iteration 42:  f(p) =  6.958e-08  
Iteration 43:  f(p) =  6.957e-08  
Iteration 44:  f(p) =  6.798e-08  
Iteration 45:  f(p) =  9.607e-09  
Iteration 46:  f(p) =  8.088e-09  
Iteration 47:  f(p) =  8.087e-09  
Iteration 48:  f(p) =  8.087e-09  
Iteration 49:  f(p) =  8.082e-09  
Iteration 50:  f(p) =  7.522e-09  
Iteration 51:  f(p) =  1.631e-09  
Iteration 52:  f(p) =  9.271e-10  
Iteration 53:  f(p) =  9.270e-10  
Iteration 54:  f(p) =  9.269e-10  
Iteration 55:  f(p) =  8.642e-10  
Iteration 56:  f(p) =  4.638e-10  
Iteration 57:  f(p) =  1.009e-10  
Iteration 58:  f(p) =  8.912e-11  
Iteration 59:  f(p) =  8.908e-11  
Iteration 60:  f(p) =  8.904e-11  
Iteration 61:  f(p) =  8.811e-11  
Iteration 62:  f(p) =  7.676e-11  
Iteration 63:  f(p) =  2.385e-11  
Iteration 64:  f(p) =  4.228e-12  
Iteration 65:  f(p) =  4.144e-12  
Iteration 66:  f(p) =  4.144e-12  
Iteration 67:  f(p) =  4.135e-12  
Iteration 68:  f(p) =  4.023e-12  
Iteration 69:  f(p) =  2.447e-12  
Iteration 70:  f(p) =  2.077e-13  
Iteration 71:  f(p) =  7.805e-14  
Iteration 72:  f(p) =  7.793e-14  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.502414
        1.x2 |  -2.525402
        1.x3 |  -.8190826
          x4 |  -.3236381
          x5 |   .0771204
          x6 |  -.4884777
          x7 |     .07227
         x90 |   .0234172
         x91 |   .0257841
         x92 |   .2152131
         x93 |  -.0285333
         x94 |  -.3393879
         x95 |  -.0407887
       _cons |   3.075427
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .957      .762      .953      1.26      1.49       1.8      2.11       2.8      5.77        13
         |       408      .999      .435       .78      .784      .792      .809      .864      .985      1.32      2.65      6.64
         |       408       .16      .168     .0019    .00635     .0172      .037     .0987      .209      .409      .707      .883
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.63      .415      .415      .642      .808      1.35       2.6      3.88      9.17      9.17
         |        92      1.02      .828      .188      .188      .318      .405      .739      1.47      1.96      5.21      5.21
         |        92      .288      .192     .0336     .0336     .0892      .119      .237      .431       .55      .931      .931
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.11      .415      .548      1.06      1.41      1.78      2.17      2.99      6.49        13
         |       500         1      .529      .188      .273      .782      .799      .859      1.05      1.49       2.9      6.64
         |       500      .183       .18     .0019    .00715       .02     .0472      .117      .263      .446      .717      .931
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6695178   .6695184  -6.46e-07  -1.37e-06   .4716976   1.004329
             |
          x2 |
          0  |  (empty)
          1  |  .0220668   .0220668   6.91e-08   4.69e-07   .1473103   1.004331
             |
          x3 |
          0  |  (empty)
          1  |  .0366905   .0366911  -6.22e-07  -3.30e-06   .1885247   1.004312
             |
          x4 |   .485133   .4851327   2.59e-07   5.17e-07   .5011717   1.004328
          x5 |  26.17888   26.17889  -.0000146  -2.76e-06   5.300171   .6789016
          x6 |  12.63449   12.63449   1.54e-06   8.34e-07    1.84562    .574066
          x7 |   6.75523   6.755245  -.0000157  -4.34e-06   3.613541   1.187219
         x90 | -.0520319  -.0520316  -2.95e-07  -2.65e-07   1.112554   1.163665
         x91 |  .0164868   .0164855   1.36e-06   1.40e-06   .9683199   .9930967
         x92 | -.0021635  -.0021647   1.18e-06   1.03e-06   1.150401   1.359803
         x93 |  .0456889   .0456925  -3.59e-06  -3.92e-06   .9161116   .8837309
         x94 | -.0910013   -.091001  -2.89e-07  -3.15e-07   .9176254    .785929
         x95 | -.0894584   -.089459   5.51e-07   6.10e-07   .9035881   .8236875
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  7.69409e-13
  Mean absolute standardized diff.
  1.62530e-06
  Maximum absolute standardized diff.
  4.33838e-06
  C.V. of matching weights:
  .5271017302
  S.D. of matching weights:
  .5285016191
  Skewness of matching weights:
  .2026538185
  Kurtosis of matching weights:
  .0762388667
  Maximum matching weight:
  6.642347589

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02296546  
Iteration 1:   f(p) =  .01893921  
Iteration 2:   f(p) =  .01888779  
Iteration 3:   f(p) =  .01864993  
Iteration 4:   f(p) =  .01807794  
Iteration 5:   f(p) =  .01796175  
Iteration 6:   f(p) =  .01796123  
Iteration 7:   f(p) =   .0179521  
Iteration 8:   f(p) =  .01782591  
Iteration 9:   f(p) =  .01781762  
Iteration 10:  f(p) =  .01781752  
Iteration 11:  f(p) =  .01781614  
Iteration 12:  f(p) =  .01780413  
Iteration 13:  f(p) =  .01778114  
Iteration 14:  f(p) =   .0177802  
Iteration 15:  f(p) =  .01778018  
Iteration 16:  f(p) =  .01777992  
Iteration 17:  f(p) =  .01777692  
Iteration 18:  f(p) =  .01777309  
Iteration 19:  f(p) =  .01777274  
Iteration 20:  f(p) =  .01777274  
Iteration 21:  f(p) =  .01777272  
Iteration 22:  f(p) =  .01777235  
Iteration 23:  f(p) =  .01777191  
Iteration 24:  f(p) =  .01777187  
Iteration 25:  f(p) =  .01777187  
Iteration 26:  f(p) =  .01777187  
Iteration 27:  f(p) =  .01777186  
Iteration 28:  f(p) =  .01777185  
Iteration 29:  f(p) =  .01777185  
Iteration 30:  f(p) =  .01777185  
Iteration 31:  f(p) =  .01777185  
Iteration 32:  f(p) =  .01777184  
Iteration 33:  f(p) =  .01777184  
Iteration 34:  f(p) =  .01777184  
Iteration 35:  f(p) =  .01777184  
Iteration 36:  f(p) =  .01777184  
Iteration 37:  f(p) =  .01777184  
Iteration 38:  f(p) =  .01777184  
Iteration 39:  f(p) =  .01777184  
Iteration 40:  f(p) =  .01777184  
Iteration 41:  f(p) =  .01777184  
Iteration 42:  f(p) =  .01777184  
Iteration 43:  f(p) =  .01777184  
Iteration 44:  f(p) =  .01777184  
Iteration 45:  f(p) =  .01777184  
Iteration 46:  f(p) =  .01777184  
Iteration 47:  f(p) =  .01777184  
Iteration 48:  f(p) =  .01777184  
Iteration 49:  f(p) =  .01777184  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + IPW (overidentified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.226645
        1.x2 |  -1.653763
        1.x3 |   -.777684
          x4 |  -.3532497
          x5 |   .0574628
          x6 |  -.2583003
          x7 |   .0080438
         x90 |   .0890277
         x91 |  -.1706886
         x92 |     .17651
         x93 |   .1136715
         x94 |  -.1271349
         x95 |     .02147
       _cons |   1.180156
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .569      .882      1.05      1.37      1.58       1.9      2.22      2.65      3.75      5.18
         |       408      .999      .194      .816      .827      .851      .879      .934      1.05      1.23      1.66      2.64
         |       408       .17      .119     .0115     .0244     .0519     .0816      .136      .228      .345      .513      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.26      .471      .471       .86      1.14      1.52      2.69      3.33      7.65      7.65
         |        92      1.02      .639      .297      .297      .465      .547      .791      1.35      1.75      4.34      4.34
         |        92      .278      .144      .048      .048      .119      .154      .264      .381      .448      .702      .702
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      .744      .471       .68      1.21      1.51      1.87      2.25      2.77      4.93      7.65
         |       500         1      .324      .297      .426      .821      .864      .931      1.07      1.35      2.08      4.34
         |       500       .19      .131     .0115     .0257     .0544     .0922      .151      .268      .394      .595      .702
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6415954   .6970126  -.0554172  -.1152442   .4808681   1.093567
             |
          x2 |
          0  |  (empty)
          1  |  .0142909   .0234703  -.0091794  -.0771266   .1190179    .617275
             |
          x3 |
          0  |  (empty)
          1  |   .033444   .0380925  -.0046485  -.0257831    .180294   .8860285
             |
          x4 |  .4881572   .4821182   .0060389   .0120477   .5012527    1.00505
          x5 |  25.72258   26.31855  -.5959627  -.1118688   5.327339   .7659019
          x6 |  12.33189    12.8994  -.5675068  -.3131294   1.812371   .6135512
          x7 |  6.911085   6.688832    .222253   .0608707   3.651229   1.211887
         x90 | -.0440389  -.0251308  -.0189081  -.0177314   1.066361   1.120774
         x91 |  .0661739  -.0257225   .0918964   .0945969   .9714527   .9753855
         x92 |  -.038201  -.0020298  -.0361712  -.0329913   1.096387    1.20721
         x93 |  .0014103   .0645199  -.0631095  -.0678371   .9303104   .9125526
         x94 | -.1442665  -.0285682  -.1156983  -.1266652   .9134186   .8216035
         x95 | -.1053625    -.07164  -.0337225  -.0377451   .8934263    .803947
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .003405231
  Mean absolute standardized diff.
  .0841259439
  Maximum absolute standardized diff.
  .3131294439
  C.V. of matching weights:
  .3236892892
  S.D. of matching weights:
  .3244154623
  Skewness of matching weights:
  .1499734423
  Kurtosis of matching weights:
  .0569706863
  Maximum matching weight:
  4.343315804

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  4.040e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.955e-07  
Iteration 17:  f(p) =  3.831e-07  
Iteration 18:  f(p) =  1.190e-07  
Iteration 19:  f(p) =  7.818e-08  
Iteration 20:  f(p) =  7.812e-08  
Iteration 21:  f(p) =  7.811e-08  
Iteration 22:  f(p) =  7.807e-08  
Iteration 23:  f(p) =  7.755e-08  
Iteration 24:  f(p) =  6.263e-08  
Iteration 25:  f(p) =  1.494e-08  
Iteration 26:  f(p) =  1.287e-08  
Iteration 27:  f(p) =  1.287e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.222e-08  
Iteration 30:  f(p) =  7.730e-09  
Iteration 31:  f(p) =  3.296e-09  
Iteration 32:  f(p) =  2.965e-09  
Iteration 33:  f(p) =  2.965e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.951e-09  
Iteration 36:  f(p) =  2.273e-09  
Iteration 37:  f(p) =  8.270e-10  
Iteration 38:  f(p) =  6.667e-10  
Iteration 39:  f(p) =  6.665e-10  
Iteration 40:  f(p) =  6.664e-10  
Iteration 41:  f(p) =  6.626e-10  
Iteration 42:  f(p) =  2.464e-10  
Iteration 43:  f(p) =  2.182e-10  
Iteration 44:  f(p) =  2.181e-10  
Iteration 45:  f(p) =  2.180e-10  
Iteration 46:  f(p) =  2.171e-10  
Iteration 47:  f(p) =  1.949e-10  
Iteration 48:  f(p) =  8.678e-11  
Iteration 49:  f(p) =  5.116e-11  
Iteration 50:  f(p) =  5.109e-11  
Iteration 51:  f(p) =  5.109e-11  
Iteration 52:  f(p) =  5.103e-11  
Iteration 53:  f(p) =  4.724e-11  
Iteration 54:  f(p) =  7.501e-12  
Iteration 55:  f(p) =  1.147e-12  
Iteration 56:  f(p) =  1.133e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.075e-12  
Iteration 60:  f(p) =  2.225e-13  
Iteration 61:  f(p) =  1.513e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |      .6266
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.55e-06   .4990018    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.78e-06   .1064741   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.00e-06   .1536741   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.45e-06   .4952368   1.004329
          x5 |  25.44699   25.44697   .0000137   2.52e-06   5.422129   .6144636
          x6 |  11.84757   11.84755   .0000196   .0000119   1.641931   .5982538
          x7 |  7.015422    7.01543  -8.52e-06  -2.40e-06   3.555432   1.161762
         x90 |  .0839738   .0839754  -1.59e-06  -1.65e-06   .9597153   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.31e-06     .93861   .9922921
         x92 |  .0575388   .0575408  -2.03e-06  -1.96e-06    1.03554   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.14e-06   .9463749   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.56e-06   .9147554   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.55e-06   .9069849   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  5.76312e-12
  Mean absolute standardized diff.
  3.59879e-06
  Maximum absolute standardized diff.
  .0000119171
  C.V. of matching weights:
  .9311703388
  S.D. of matching weights:
  .9276236134
  Skewness of matching weights:
  .1133781716
  Kurtosis of matching weights:
  .0229023239
  Maximum matching weight:
  7.00792465

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00053487  
Iteration 1:   f(p) =  .00021848  
Iteration 2:   f(p) =  .00021162  
Iteration 3:   f(p) =  .00021159  
Iteration 4:   f(p) =  .00021001  
Iteration 5:   f(p) =  .00019724  
Iteration 6:   f(p) =   .0001771  
Iteration 7:   f(p) =  .00017502  
Iteration 8:   f(p) =  .00017501  
Iteration 9:   f(p) =  .00017499  
Iteration 10:  f(p) =  .00017464  
Iteration 11:  f(p) =   .0001725  
Iteration 12:  f(p) =  .00017245  
Iteration 13:  f(p) =  .00017239  
Iteration 14:  f(p) =  .00017218  
Iteration 15:  f(p) =  .00017218  
Iteration 16:  f(p) =  .00017218  
Iteration 17:  f(p) =  .00017218  
Iteration 18:  f(p) =  .00017217  
Iteration 19:  f(p) =  .00017216  
Iteration 20:  f(p) =  .00017216  
Iteration 21:  f(p) =  .00017216  
Iteration 22:  f(p) =  .00017216  
Iteration 23:  f(p) =  .00017216  
Iteration 24:  f(p) =  .00017215  
Iteration 25:  f(p) =  .00017215  
Iteration 26:  f(p) =  .00017215  
Iteration 27:  f(p) =  .00017215  
Iteration 28:  f(p) =  .00017215  
Iteration 29:  f(p) =  .00017215  
Iteration 30:  f(p) =  .00017215  
Iteration 31:  f(p) =  .00017215  
Iteration 32:  f(p) =  .00017215  
Iteration 33:  f(p) =  .00017215  
Iteration 34:  f(p) =  .00017215  
Iteration 35:  f(p) =  .00017215  
Iteration 36:  f(p) =  .00017215  
Iteration 37:  f(p) =  .00017215  
Iteration 38:  f(p) =  .00017215  
Iteration 39:  f(p) =  .00017215  
Iteration 40:  f(p) =  .00017215  
Iteration 41:  f(p) =  .00017215  
Iteration 42:  f(p) =  .00017215  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + IPW (overidentified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.393749
        1.x2 |  -1.561035
        1.x3 |  -.4600073
          x4 |  -.3846166
          x5 |   .0606091
          x6 |  -.2482014
          x7 |   .0443351
         x90 |   .1306487
         x91 |  -.1205476
         x92 |   .1453091
         x93 |   .0704761
         x94 |  -.1075638
         x95 |  -.0307915
       _cons |   .7598464
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.12     .0834      .213      .379      .703       1.2      2.44       4.6      9.79      16.6
         |       408      .995      1.01     .0445      .124      .212      .364      .618      1.22      2.32      4.57      7.11
         |       408      .161      .119    .00985     .0269     .0454     .0753      .121      .214      .341      .506      .614
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .153     .0459     .0459     .0999      .133      .243      .375      .464      .695      .695
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.92     .0834      .215      .425      .799      1.47      2.33       4.1       9.5      16.6
         |       500      .996      .916     .0445      .124      .228      .404       .82      1.04      2.07      4.54      7.11
         |       500      .181      .133    .00985     .0269     .0484     .0819      .137      .247       .39      .596      .695
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4553292   -.004106  -.0082285   .4990018   1.002774
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0111963   .0002076   .0019495   .1064741   1.022732
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0242797   -.000216  -.0014058   .1536741    .995612
             |
          x4 |  .4218861   .4235251   -.001639  -.0033096   .4952368   1.003286
          x5 |  25.44699   25.39436   .0526232   .0097053   5.422129   .6141311
          x6 |  11.84757   11.82507   .0224993    .013703   1.641931   .5978372
          x7 |  7.015422   6.978163   .0372587   .0104794   3.555432   1.159171
         x90 |  .0839738   .0816058   .0023681   .0024675   .9597153   .8472278
         x91 | -.0648837  -.0554767   -.009407  -.0100223     .93861   .9892043
         x92 |  .0575388   .0526515   .0048872   .0047195    1.03554   1.121369
         x93 |  .1016523     .09771   .0039423   .0041657   .9463749   1.013686
         x94 | -.1252265   -.131327   .0061005    .006669   .9147554   .7569926
         x95 | -.1044649  -.1015495  -.0029155  -.0032144   .9069849   .8652191
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.53298e-06
  Mean absolute standardized diff.
  .0061568806
  Maximum absolute standardized diff.
  .0137029807
  C.V. of matching weights:
  .9194966014
  S.D. of matching weights:
  .9158853603
  Skewness of matching weights:
  .1127627754
  Kurtosis of matching weights:
  .0230489326
  Maximum matching weight:
  7.109590601

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00026309  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00001126  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  4.733e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.762e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.968e-21  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298301
        1.x2 |   -1.62991
        1.x3 |  -.4511738
          x4 |  -.3553036
          x5 |     .07158
          x6 |  -.2773324
          x7 |   .0371349
         x90 |   .1283826
         x91 |  -.0952385
         x92 |   .1409152
         x93 |   .0743039
         x94 |  -.1419192
         x95 |  -.0201501
       _cons |   1.248956
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.18     .0766      .195      .376      .696      1.22      2.44      4.57      9.98      20.7
         |       408      .998      1.06     .0408      .117      .208       .36       .63      1.18      2.31      4.35      10.6
         |       408       .22      .145     .0139     .0389     .0671      .111      .179      .289      .444      .601      .786
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .351      .168      .068      .068      .152      .203      .322      .485      .552       .79       .79
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.98     .0766      .203      .418      .776       1.5      2.35      4.17      9.35      20.7
         |       500      .998      .961     .0408      .117      .226      .402      .852      1.07      1.96      4.35      10.6
         |       500      .244      .158     .0139      .039     .0719      .119      .203      .332      .494      .685       .79
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231    .487981  -.0367579  -.0736628   .4990018   .9953452
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101189   .0012849   .0120681   .1064741   1.130392
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243904  -.0003267   -.002126   .1536741    .991207
             |
          x4 |  .4218861   .4077073   .0141788   .0286304   .4952368   1.014377
          x5 |  25.44699   25.93854  -.4915548  -.0906572   5.422129   .5820455
          x6 |  11.84757   11.77832   .0692519   .0421771   1.641931   .5870658
          x7 |  7.015422   6.877177   .1382443   .0388826   3.555432   1.150412
         x90 |  .0839738   .0558962   .0280776   .0292562   .9597153   .8505932
         x91 | -.0648837  -.0314162  -.0334675  -.0356565     .93861   .9896463
         x92 |  .0575388   .0508005   .0067383    .006507    1.03554   1.132825
         x93 |  .1016523   .1109109  -.0092586  -.0097833   .9463749   1.021042
         x94 | -.1252265  -.1752569   .0500305   .0546928   .9147554   .7291541
         x95 | -.1044649   -.104167  -.0002979  -.0003285   .9069849   .8690485
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.96769e-21
  Mean absolute standardized diff.
  .03264833
  Maximum absolute standardized diff.
  .0906571707
  C.V. of matching weights:
  .963205406
  S.D. of matching weights:
  .9612474781
  Skewness of matching weights:
  .1583249612
  Kurtosis of matching weights:
  .0508875835
  Maximum matching weight:
  10.57744042

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .01944489  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01784035  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01032757  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00864463  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00309574  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00232235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00091852  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00071553  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00032888  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013226  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00006152  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00004718  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002689  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002163  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.507e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  4.926e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  4.495e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  3.113e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  9.709e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.289e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  2.156e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  2.156e-07  (backed up)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = sum(stddiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.446641
        1.x2 |   -1.54241
        1.x3 |  -.4738988
          x4 |  -.3823256
          x5 |   .0635735
          x6 |  -.2432678
          x7 |   .0476865
         x90 |   .1334605
         x91 |  -.1336202
         x92 |   .1523287
         x93 |    .075763
         x94 |  -.1016271
         x95 |  -.0382574
       _cons |   1.349238
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0811      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03     .0432      .118      .207       .36       .61      1.22       2.3      4.74      7.01
         |       408      .265      .163     .0196     .0516     .0872      .143       .22      .361      .515      .687      .764
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .413      .187     .0911     .0911      .181      .231      .398      .557      .655      .822      .822
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0811      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928     .0432      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .293      .177     .0196     .0523      .095      .155      .242      .404      .571      .753      .822
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512687  -.0000456  -.0000913   .4990018    1.00431
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114402  -.0000363  -.0003409   .1064741   1.001178
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240204   .0000433   .0002818   .1536741   1.006094
             |
          x4 |  .4218861   .4218656   .0000205   .0000414   .4952368   1.004341
          x5 |  25.44699   25.44719  -.0002052  -.0000378   5.422129   .6144531
          x6 |  11.84757    11.8475   .0000671   .0000409   1.641931   .5982325
          x7 |  7.015422   7.015211   .0002106   .0000592   3.555432   1.161757
         x90 |  .0839738   .0839323   .0000415   .0000433   .9597153   .8505088
         x91 | -.0648837  -.0648817  -2.04e-06  -2.18e-06     .93861   .9922887
         x92 |  .0575388   .0575515  -.0000127  -.0000123    1.03554   1.118322
         x93 |  .1016523   .1016534  -1.07e-06  -1.13e-06   .9463749   1.012562
         x94 | -.1252265   -.125259   .0000325   .0000355   .9147554   .7576437
         x95 | -.1044649  -.1044612  -3.73e-06  -4.11e-06   .9069849   .8646937
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  9.11079e-13
  Mean absolute standardized diff.
  .0000762997
  Maximum absolute standardized diff.
  .0003408998
  C.V. of matching weights:
  .9310668686
  S.D. of matching weights:
  .9275217693
  Skewness of matching weights:
  .1133973011
  Kurtosis of matching weights:
  .0229134203
  Maximum matching weight:
  7.010362744

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet stdprogdiff depvars(`depvars') treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00143639  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =   .0006706  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00064802  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =   .0000134  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.064e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.270e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  6.452e-15  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  5.789e-15  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = sum(stdprogdiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298747
        1.x2 |  -1.629983
        1.x3 |  -.4515067
          x4 |   -.357214
          x5 |   .0701838
          x6 |  -.2800586
          x7 |   .0430997
         x90 |   .1194537
         x91 |  -.0953765
         x92 |   .1379619
         x93 |   .0698391
         x94 |  -.1463551
         x95 |  -.0181715
       _cons |   1.248743
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.19     .0755      .197      .369      .672       1.2      2.38       4.5        10      20.3
         |       408      .997      1.07     .0402      .116      .205      .356      .639      1.19      2.32       4.4      10.4
         |       408      .215      .144     .0134     .0374     .0645      .107      .177      .285      .438      .597      .777
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .345      .168     .0683     .0683      .147      .194      .315      .475      .549      .795      .795
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.99     .0755      .204      .406      .766       1.5      2.34       4.1       9.5      20.3
         |       500      .998      .963     .0402      .116      .223      .396      .841      1.07      1.98      4.39      10.4
         |       500      .239      .157     .0134     .0375     .0695      .116      .196      .324      .483      .682      .795
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231    .484127  -.0329038  -.0659393   .4990018   .9957736
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101286   .0012753   .0119773   .1064741   1.129324
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243611  -.0002974  -.0019351   .1536741   .9923708
             |
          x4 |  .4218861   .4098975   .0119886   .0242079   .4952368   1.012702
          x5 |  25.44699    25.8721  -.4251097  -.0784027   5.422129   .5828017
          x6 |  11.84757   11.76324   .0843352   .0513634   1.641931   .5902452
          x7 |  7.015422   6.941206   .0742153   .0208738   3.555432   1.153544
         x90 |  .0839738   .0479702   .0360036   .0375149   .9597153   .8485516
         x91 | -.0648837  -.0313865  -.0334972  -.0356881     .93861   .9913576
         x92 |  .0575388   .0445559   .0129828   .0125373    1.03554   1.135082
         x93 |  .1016523   .1048846  -.0032323  -.0034154   .9463749   1.017147
         x94 | -.1252265  -.1776542   .0524278   .0573134   .9147554    .731671
         x95 | -.1044649  -.0999146  -.0045503   -.005017   .9069849   .8678598
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  3.81461e-06
  Mean absolute standardized diff.
  .0312450446
  Maximum absolute standardized diff.
  .0784027352
  C.V. of matching weights:
  .9655273278
  S.D. of matching weights:
  .9632833299
  Skewness of matching weights:
  .1533416123
  Kurtosis of matching weights:
  .0473392743
  Maximum matching weight:
  10.35636678
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.435     3431.435  -1.17e-06  -7.17e-09   3431.435
   y1_binary |    .9507806     .9507806  -3.83e-09  -7.57e-08   .9507806
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.444e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -373.2561   49.21885    -7.58   0.000    -469.7233   -276.7889
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3424.879   30.82585   111.10   0.000     3364.462    3485.297
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3424.8791

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752    .0041102      1.338962   1.000571
                  |
               x2 |
               1  |  -.1180374    .0011686      .4133173   1.011157
                  |
               x3 |
               1  |  -.1253201   -.0169419      .5085817   .8975379
                  |
               x4 |  -.1207472    .0136004      .9914484   1.003798
               x5 |  -.1944638     .003179      .8589874   .5855492
               x6 |  -.6542694    .0947099      .4958356   .5643304
               x7 |   .0473848    .0177567      1.160037   1.134687
              x90 |   .1499304    .0348222      .9289414    .817157
              x91 |  -.0833726   -.0675073      .8791918     .96061
              x92 |   .0662245   -.0005441      1.090179   1.148892
              x93 |   .0479737    -.020065      .8926169   .9606022
              x94 |  -.1521926    .0315996      .8686432   .7548902
              x95 |  -.0155155    .0398234      .8285405   .8815991
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125404   .4990018   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0088535   .1064741   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007058   .1536741   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192434   .4952368   .9986039
          x5 |  25.44699   25.25275   .1942356   .0358228   5.422129   .5945665
          x6 |  11.84757   11.67955   .1680205   .1023311   1.641931   .5984287
          x7 |  7.015422   6.824197   .1912245   .0537838   3.555432   1.151353
         x90 |  .0839738   .0777469   .0062269   .0064883   .9597153   .8303562
         x91 | -.0648837   -.033852  -.0310317  -.0330613     .93861    .990382
         x92 |  .0575388   .0480591   .0094797   .0091543    1.03554   1.130693
         x93 |  .1016523   .1032412  -.0015889  -.0016789   .9463749   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0539402   .9147554   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0077149   .9069849   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002630856
  Mean absolute standardized diff.
  .0265629657
  Maximum absolute standardized diff.
  .1023310562
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. gmatchcall reweight()

. gmatchcall balanceresults()
  Unmatched data
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4653368   .0020545   .0040954   .5016695   1.009059
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0107485   .0001211   .0011614   .1042572   1.019734
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0242844  -.0025453  -.0173586   .1466296   .9051513
             |
          x4 |  .4347826   .4280333   .0067493   .0135406   .4984448   1.012313
          x5 |  25.46739   25.44732   .0200675   .0036862   5.443922   .5905162
          x6 |  11.86957   11.69122   .1783475   .1111161   1.605057   .5691173
          x7 |  6.858696   6.797654   .0610413   .0171623   3.556704   1.144312
         x90 |  .0972024   .0623017   .0349007   .0365918   .9537854   .8240885
         x91 | -.0890157  -.0249321  -.0640836  -.0679605   .9429542   .9687584
         x92 |  .0453787   .0459298  -.0005512  -.0005243   1.051175   1.158638
         x93 |  .0865687   .1054548  -.0188862  -.0201997   .9349714   .9687505
         x94 | -.1299173  -.1613151   .0313979   .0339506   .9248091   .7612936
         x95 | -.0807251  -.1181964   .0374713   .0409968    .914005   .8890772
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0001444769
  Mean absolute standardized diff.
  .0283341849
  Maximum absolute standardized diff.
  .1111160516
  C.V. of matching weights:
  0
  S.D. of matching weights:
  0
  Skewness of matching weights:
  .
  Kurtosis of matching weights:
  .
  Maximum matching weight:
  1

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw averagevariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125404   .4990018   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0088535   .1064741   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007058   .1536741   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192434   .4952368   .9986039
          x5 |  25.44699   25.25275   .1942356   .0358228   5.422129   .5945665
          x6 |  11.84757   11.67955   .1680205   .1023311   1.641931   .5984287
          x7 |  7.015422   6.824197   .1912245   .0537838   3.555432   1.151353
         x90 |  .0839738   .0777469   .0062269   .0064883   .9597153   .8303562
         x91 | -.0648837   -.033852  -.0310317  -.0330613     .93861    .990382
         x92 |  .0575388   .0480591   .0094797   .0091543    1.03554   1.130693
         x93 |  .1016523   .1032412  -.0015889  -.0016789   .9463749   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0539402   .9147554   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0077149   .9069849   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0002630856
  Mean absolute standardized diff.
  .0265629657
  Maximum absolute standardized diff.
  .1023310562
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], ate aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  2.423e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |  -332.1348   56.53175    -5.88   0.000     -442.935   -221.3346
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3453.029    20.1341   171.50   0.000     3413.567    3492.491
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .572      .862      1.06      1.36      1.59       1.9      2.23      2.72      3.72      5.29
         |       408      .999      .196      .823      .836      .852      .877      .929      1.03      1.26      1.65      2.49
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.31      .475      .475      .807      1.08      1.51      2.47      3.54      8.32      8.32
         |        92      1.02      .684      .274      .274      .443      .535      .795       1.4      1.78      4.73      4.73
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .76      .475      .645      1.19      1.51      1.87      2.26      2.83      4.93      8.32
         |       500         1      .341      .274      .398      .832      .866      .925      1.06      1.39      2.29      4.73
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6613089   .6933653  -.0320564  -.0675465   .4745835   1.058036
             |
          x2 |
          0  |  (empty)
          1  |  .0128589   .0239773  -.0111184  -.0984106   .1129797   .5447519
             |
          x3 |
          0  |  (empty)
          1  |  .0265737   .0393435  -.0127698   -.079177    .161282   .6873677
             |
          x4 |  .4958234   .4853442   .0104792   .0209008   .5013759   1.005121
          x5 |  25.79221   26.26742  -.4752185  -.0902562   5.265216   .7434191
          x6 |  12.37135   12.88246  -.5111083  -.2828652   1.806897   .6063944
          x7 |  6.760858   6.737452    .023406   .0064602   3.623093   1.194134
         x90 | -.1082151   -.017539  -.0906761  -.0848916   1.068141   1.121318
         x91 |   .033412  -.0122333   .0456452   .0475293   .9603591   .9566022
         x92 |  .0165767  -.0117433     .02832   .0258227   1.096708   1.209921
         x93 |  .0109477   .0569505  -.0460028  -.0491777   .9354401   .9220023
         x94 | -.1467208  -.0286143  -.1181065  -.1303608   .9059973   .8106047
         x95 | -.0857581  -.0773517  -.0084064  -.0094126   .8931054   .7990227
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0037058594
  Mean absolute standardized diff.
  .0763700883
  Maximum absolute standardized diff.
  .2828651754
  C.V. of matching weights:
  .3403902484
  S.D. of matching weights:
  .3414490721
  Skewness of matching weights:
  .1624622214
  Kurtosis of matching weights:
  .0662787313
  Maximum matching weight:
  4.725180198

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.908e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |   321.4309   62.35166     5.16   0.000     199.2239    443.6379
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3138.003   59.50596    52.73   0.000     3021.374    3254.633
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.299227   .2371935     5.48   0.000     .8343367    1.764118
                        |
                     x2 |
                     1  |   1.630014    .746001     2.19   0.029     .1678787    3.092149
                        |
                     x3 |
                     1  |   .4513753   .5770312     0.78   0.434    -.6795851    1.582336
                     x4 |   .3551911    .204881     1.73   0.083    -.0463684    .7567506
                     x5 |   -.058452   .0195046    -3.00   0.003    -.0966803   -.0202237
                     x6 |   .2821622    .049775     5.67   0.000      .184605    .3797195
                     x7 |  -.0332008   .0279849    -1.19   0.235    -.0880501    .0216486
                    x90 |  -.1276778   .0907109    -1.41   0.159     -.305468    .0501124
                    x91 |   .0961159   .0916737     1.05   0.294    -.0835612     .275793
                    x92 |  -.1400043   .0976573    -1.43   0.152    -.3314091    .0514004
                    x93 |  -.0734557   .0916967    -0.80   0.423     -.253178    .1062665
                    x94 |   .1435742   .0862727     1.66   0.096    -.0255172    .3126656
                    x95 |   .0212452   .0898768     0.24   0.813    -.1549102    .1974006
                  _cons |   -1.24872   .6712769    -1.86   0.063    -2.564399    .0669587
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ateu ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .398      .881      1.17      1.44      1.68      1.96      2.23      2.48      2.83      3.24
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.62      .218      .218      .607      .827      1.32      2.63      3.86      9.94      9.94
         |        92      1.03      .852     .0953     .0953      .305      .421      .745       1.5      1.98      5.65      5.65
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .78      .218      .418      1.22       1.6      1.94      2.27      2.59      4.66      9.94
         |       500         1      .364     .0953       .25      .813         1         1         1         1      2.54      5.65
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  4.040e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.955e-07  
Iteration 17:  f(p) =  3.831e-07  
Iteration 18:  f(p) =  1.190e-07  
Iteration 19:  f(p) =  7.818e-08  
Iteration 20:  f(p) =  7.812e-08  
Iteration 21:  f(p) =  7.811e-08  
Iteration 22:  f(p) =  7.807e-08  
Iteration 23:  f(p) =  7.755e-08  
Iteration 24:  f(p) =  6.263e-08  
Iteration 25:  f(p) =  1.494e-08  
Iteration 26:  f(p) =  1.287e-08  
Iteration 27:  f(p) =  1.287e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.222e-08  
Iteration 30:  f(p) =  7.730e-09  
Iteration 31:  f(p) =  3.296e-09  
Iteration 32:  f(p) =  2.965e-09  
Iteration 33:  f(p) =  2.965e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.951e-09  
Iteration 36:  f(p) =  2.273e-09  
Iteration 37:  f(p) =  8.270e-10  
Iteration 38:  f(p) =  6.667e-10  
Iteration 39:  f(p) =  6.665e-10  
Iteration 40:  f(p) =  6.664e-10  
Iteration 41:  f(p) =  6.626e-10  
Iteration 42:  f(p) =  2.464e-10  
Iteration 43:  f(p) =  2.182e-10  
Iteration 44:  f(p) =  2.181e-10  
Iteration 45:  f(p) =  2.180e-10  
Iteration 46:  f(p) =  2.171e-10  
Iteration 47:  f(p) =  1.949e-10  
Iteration 48:  f(p) =  8.678e-11  
Iteration 49:  f(p) =  5.116e-11  
Iteration 50:  f(p) =  5.109e-11  
Iteration 51:  f(p) =  5.109e-11  
Iteration 52:  f(p) =  5.103e-11  
Iteration 53:  f(p) =  4.724e-11  
Iteration 54:  f(p) =  7.501e-12  
Iteration 55:  f(p) =  1.147e-12  
Iteration 56:  f(p) =  1.133e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.075e-12  
Iteration 60:  f(p) =  2.225e-13  
Iteration 61:  f(p) =  1.513e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |      .6266
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.55e-06   .4990018    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.78e-06   .1064741   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.00e-06   .1536741   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.45e-06   .4952368   1.004329
          x5 |  25.44699   25.44697   .0000137   2.52e-06   5.422129   .6144636
          x6 |  11.84757   11.84755   .0000196   .0000119   1.641931   .5982538
          x7 |  7.015422    7.01543  -8.52e-06  -2.40e-06   3.555432   1.161762
         x90 |  .0839738   .0839754  -1.59e-06  -1.65e-06   .9597153   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.31e-06     .93861   .9922921
         x92 |  .0575388   .0575408  -2.03e-06  -1.96e-06    1.03554   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.14e-06   .9463749   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.56e-06   .9147554   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.55e-06   .9069849   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  5.76312e-12
  Mean absolute standardized diff.
  3.59879e-06
  Maximum absolute standardized diff.
  .0000119171
  C.V. of matching weights:
  .9311703388
  S.D. of matching weights:
  .9276236134
  Skewness of matching weights:
  .1133781716
  Kurtosis of matching weights:
  .0229023239
  Maximum matching weight:
  7.00792465

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .75 6)

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00093832  
Iteration 1:   f(p) =  .00004631  
Iteration 2:   f(p) =  .00003859  
Iteration 3:   f(p) =  .00003858  
Iteration 4:   f(p) =  .00003858  
Iteration 5:   f(p) =  .00003857  
Iteration 6:   f(p) =  .00003712  
Iteration 7:   f(p) =  .00001543  
Iteration 8:   f(p) =  .00001516  
Iteration 9:   f(p) =  .00001516  
Iteration 10:  f(p) =  .00001516  
Iteration 11:  f(p) =  .00001516  
Iteration 12:  f(p) =  .00001496  
Iteration 13:  f(p) =  .00001329  
Iteration 14:  f(p) =  .00001318  
Iteration 15:  f(p) =  .00001318  
Iteration 16:  f(p) =  .00001318  
Iteration 17:  f(p) =  .00001318  
Iteration 18:  f(p) =  .00001317  
Iteration 19:  f(p) =  .00001306  
Iteration 20:  f(p) =  .00001275  
Iteration 21:  f(p) =  .00001268  
Iteration 22:  f(p) =  .00001268  
Iteration 23:  f(p) =  .00001268  
Iteration 24:  f(p) =  .00001268  
Iteration 25:  f(p) =  .00001268  
Iteration 26:  f(p) =  .00001266  
Iteration 27:  f(p) =   .0000125  
Iteration 28:  f(p) =   .0000125  
Iteration 29:  f(p) =   .0000125  
Iteration 30:  f(p) =   .0000125  
Iteration 31:  f(p) =   .0000125  
Iteration 32:  f(p) =   .0000125  
Iteration 33:  f(p) =  .00001248  
Iteration 34:  f(p) =  .00001247  
Iteration 35:  f(p) =  .00001247  
Iteration 36:  f(p) =  .00001247  
Iteration 37:  f(p) =  .00001247  
Iteration 38:  f(p) =  .00001247  
Iteration 39:  f(p) =  .00001247  
Iteration 40:  f(p) =  .00001247  
Iteration 41:  f(p) =  .00001247  
Iteration 42:  f(p) =  .00001247  
Iteration 43:  f(p) =  .00001247  
Iteration 44:  f(p) =  .00001247  
Iteration 45:  f(p) =  .00001247  
Iteration 46:  f(p) =  .00001247  
Iteration 47:  f(p) =  .00001247  
Iteration 48:  f(p) =  .00001247  
Iteration 49:  f(p) =  .00001246  
Iteration 50:  f(p) =  .00001246  
Iteration 51:  f(p) =  .00001246  
Iteration 52:  f(p) =  .00001246  
Iteration 53:  f(p) =  .00001246  
Iteration 54:  f(p) =  .00001246  
Iteration 55:  f(p) =  .00001246  
Iteration 56:  f(p) =  .00001246  
Iteration 57:  f(p) =  .00001246  
Iteration 58:  f(p) =  .00001246  
Iteration 59:  f(p) =  .00001246  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.254181
        1.x2 |  -1.322943
        1.x3 |  -.3737877
          x4 |  -.3150736
          x5 |    .053865
          x6 |   -.207347
          x7 |   .0392197
         x90 |   .1112074
         x91 |  -.1096079
         x92 |   .1251037
         x93 |    .065952
         x94 |    -.09382
         x95 |  -.0291289
       _cons |   .4369062
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.81      .136      .285      .497       .83      1.32      2.51      4.37       8.5      13.5
         |       408      .996      .864     .0724       .17      .273      .438       .68      1.24      2.21      3.95      5.51
         |       408      .172      .109     .0168     .0384     .0605     .0937      .138      .226      .342      .482      .565
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .275      .138      .063      .063      .116      .147      .252      .373      .453      .641      .641
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.65      .136      .289      .555      .918      1.55      2.36      3.96      8.34      13.5
         |       500      .997       .78     .0724      .171      .297      .476      .864      1.06      1.98      3.95      5.51
         |       500      .191      .122     .0168     .0388     .0653        .1      .152      .255      .382      .553      .641
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4880522  -.0368291  -.0738055   .4990018   .9953384
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0133716  -.0019677  -.0184809   .1064741   .8582417
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0267065  -.0026428  -.0171972   .1536741   .9074008
             |
          x4 |  .4218861   .4355797  -.0136936  -.0276505   .4952368   .9963546
          x5 |  25.44699   25.52567  -.0786887  -.0145125   5.422129   .6374814
          x6 |  11.84757    12.0082  -.1606282  -.0978288   1.641931   .5789037
          x7 |  7.015422    6.96308   .0523414   .0147215   3.555432   1.157512
         x90 |  .0839738   .0663453   .0176285   .0183685   .9597153   .8599203
         x91 | -.0648837  -.0552227   -.009661  -.0102929     .93861   .9716611
         x92 |  .0575388   .0443219   .0132168   .0127632    1.03554   1.110882
         x93 |  .1016523   .0920433    .009609   .0101535   .9463749   .9946047
         x94 | -.1252265  -.1096389  -.0155876  -.0170402   .9147554    .770958
         x95 | -.1044649  -.0986898  -.0057752  -.0063674   .9069849   .8554811
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .00030536
  Mean absolute standardized diff.
  .0260909737
  Maximum absolute standardized diff.
  .0978288287
  C.V. of matching weights:
  .7824738141
  S.D. of matching weights:
  .7798918518
  Skewness of matching weights:
  .0960999276
  Kurtosis of matching weights:
  .0177242444
  Maximum matching weight:
  5.513144506

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .50 6)

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .03149775  
Iteration 1:   f(p) =  .00028651  
Iteration 2:   f(p) =  .00020393  
Iteration 3:   f(p) =  .00019258  
Iteration 4:   f(p) =  .00019213  
Iteration 5:   f(p) =  .00019201  
Iteration 6:   f(p) =  .00019201  
Iteration 7:   f(p) =  .00019103  
Iteration 8:   f(p) =  .00015742  
Iteration 9:   f(p) =  .00012551  
Iteration 10:  f(p) =  .00012396  
Iteration 11:  f(p) =  .00012368  
Iteration 12:  f(p) =  .00012357  
Iteration 13:  f(p) =  .00012356  
Iteration 14:  f(p) =  .00012356  
Iteration 15:  f(p) =  .00012354  
Iteration 16:  f(p) =  .00012337  
Iteration 17:  f(p) =  .00011093  
Iteration 18:  f(p) =  .00008529  
Iteration 19:  f(p) =  .00008129  
Iteration 20:  f(p) =  .00008115  
Iteration 21:  f(p) =  .00008114  
Iteration 22:  f(p) =  .00008114  
Iteration 23:  f(p) =  .00008114  
Iteration 24:  f(p) =  .00008114  
Iteration 25:  f(p) =  .00008097  
Iteration 26:  f(p) =  .00008013  
Iteration 27:  f(p) =  .00007994  
Iteration 28:  f(p) =  .00007994  
Iteration 29:  f(p) =  .00007994  
Iteration 30:  f(p) =  .00007994  
Iteration 31:  f(p) =  .00007993  
Iteration 32:  f(p) =  .00007982  
Iteration 33:  f(p) =  .00007971  
Iteration 34:  f(p) =  .00007971  
Iteration 35:  f(p) =  .00007971  
Iteration 36:  f(p) =  .00007971  
Iteration 37:  f(p) =  .00007971  
Iteration 38:  f(p) =  .00007968  
Iteration 39:  f(p) =  .00007968  
Iteration 40:  f(p) =  .00007968  
Iteration 41:  f(p) =  .00007968  
Iteration 42:  f(p) =  .00007968  
Iteration 43:  f(p) =  .00007967  
Iteration 44:  f(p) =  .00007967  
Iteration 45:  f(p) =  .00007967  
Iteration 46:  f(p) =  .00007967  
Iteration 47:  f(p) =  .00007967  
Iteration 48:  f(p) =  .00007967  
Iteration 49:  f(p) =  .00007967  
Iteration 50:  f(p) =  .00007967  
Iteration 51:  f(p) =  .00007967  
Iteration 52:  f(p) =  .00007967  
Iteration 53:  f(p) =  .00007967  
Iteration 54:  f(p) =  .00007967  
Iteration 55:  f(p) =  .00007967  
Iteration 56:  f(p) =  .00007967  
Iteration 57:  f(p) =  .00007967  
Iteration 58:  f(p) =  .00007967  
Iteration 59:  f(p) =  .00007967  
Iteration 60:  f(p) =  .00007967  
Iteration 61:  f(p) =  .00007967  
Iteration 62:  f(p) =  .00007967  
Iteration 63:  f(p) =  .00007967  
Iteration 64:  f(p) =  .00007967  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.9697348
        1.x2 |  -1.009948
        1.x3 |  -.2681193
          x4 |  -.2328724
          x5 |   .0401949
          x6 |  -.1592826
          x7 |   .0284828
         x90 |   .0826327
         x91 |  -.0793657
         x92 |   .0918013
         x93 |   .0506792
         x94 |  -.0790893
         x95 |  -.0177969
       _cons |   .1432518
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.38      .271      .445      .706      1.03      1.54      2.49      3.85      6.84      9.73
         |       408      .997      .647      .144      .273      .397      .566      .778      1.24         2      3.05      3.88
         |       408      .186     .0903     .0345     .0633     .0893      .123      .161      .235      .331       .43       .49
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .27      .107     .0905     .0905      .143      .171      .257      .348      .405      .555      .555
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.26      .271      .449      .762      1.16      1.68      2.38      3.55      6.55      9.73
         |       500      .997      .584      .144      .275      .418      .597      .937      1.08      1.82      3.03      3.88
         |       500      .202      .099     .0345     .0637     .0933      .127      .174      .264      .355       .48      .555
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5455565  -.0943334  -.1890441   .4990018   1.003097
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0163288  -.0049249  -.0462544   .1064741   .7049256
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0302591  -.0061954  -.0403152   .1536741   .8037994
             |
          x4 |  .4218861   .4518912  -.0300051  -.0605875   .4952368   .9889709
          x5 |  25.44699   25.68607  -.2390886   -.044095   5.422129   .6743964
          x6 |  11.84757   12.24705  -.3994826  -.2433005   1.641931   .5553463
          x7 |  7.015422    6.89603   .1193915     .03358   3.555432   1.154005
         x90 |  .0839738   .0421686   .0418053   .0435601   .9597153   .8752326
         x91 | -.0648837  -.0430191  -.0218646  -.0232946     .93861   .9459255
         x92 |  .0575388   .0282771   .0292616   .0282573    1.03554   1.101599
         x93 |  .1016523   .0789374   .0227149    .024002   .9463749   .9718368
         x94 | -.1252265  -.0859457  -.0392808  -.0429413   .9147554   .7889919
         x95 | -.1044649  -.0909646  -.0135004  -.0148849   .9069849   .8447606
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0019585257
  Mean absolute standardized diff.
  .0641628438
  Maximum absolute standardized diff.
  .2433005272
  C.V. of matching weights:
  .5854551312
  S.D. of matching weights:
  .5839538516
  Skewness of matching weights:
  .0751394198
  Kurtosis of matching weights:
  .0127294311
  Maximum matching weight:
  3.883536588

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00118407  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00047827  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00006974  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00004509  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.893e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.962e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  1.695e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  6.547e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  2.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.307e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.558e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  7.610e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  6.398e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  6.152e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  6.114e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  6.091e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.081e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  5.990e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.587e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  4.159e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.449e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.547e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.434e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  3.144e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.694e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  6.220e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  2.530e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.124e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  4.820e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  4.572e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  3.313e-12  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.201696
        1.x2 |  -1.629604
        1.x3 |  -.4536638
          x4 |    -.31763
          x5 |   .0039335
          x6 |  -.0017811
          x7 |  -.0819355
         x90 |   .0141398
         x91 |  -.1286664
         x92 |    .040549
         x93 |  -.0181838
         x94 |  -.0913752
         x95 |   -.059869
       _cons |   1.261863
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.59      .142      .392      .715      .975      1.41      2.51      3.98      7.97      11.4
         |       408      .999      .761     .0779      .275      .408      .515      .731      1.19      1.97      3.79      5.35
         |       408      .424      .144     .0653      .198      .268      .316      .396      .517      .638      .773      .827
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .518      .157      .214      .214      .302      .393      .517      .642      .708      .822      .822
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.45      .142      .396      .767      1.08       1.6      2.38      3.58      7.65      11.4
         |       500      .999      .687     .0779       .28      .423      .561      .886      1.06      1.82      3.76      5.35
         |       500      .442      .151     .0653      .201      .271      .325      .413      .546      .666      .794      .827
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5058141   -.054591  -.1094004   .4990018   .9949046
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096766   .0017273   .0162227   .1064741   1.181539
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0212238   .0028399   .0184802   .1536741   1.135412
             |
          x4 |  .4218861   .4772866  -.0554005  -.1118666   .4952368   .9818413
          x5 |  25.44699   25.00536   .4416251   .0814487   5.422129   .7768304
          x6 |  11.84757   12.59971  -.7521439   -.458085   1.641931   .5263603
          x7 |  7.015422   5.724031    1.29139   .3632162   3.555432   1.163232
         x90 |  .0839738   .0201523   .0638215   .0665005   .9597153   .8428559
         x91 | -.0648837  -.1001377    .035254   .0375598     .93861   .9525308
         x92 |  .0575388   .0452136   .0123252   .0119022    1.03554   1.081337
         x93 |  .1016523   .0432662   .0583861   .0616945   .9463749   .9728774
         x94 | -.1252265  -.1330996   .0078732   .0086069   .9147554   .8096563
         x95 | -.1044649  -.1169053   .0124403   .0137161   .9069849   .8533958
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  1.15853e-13
  Mean absolute standardized diff.
  .1045153596
  Maximum absolute standardized diff.
  .4580850209
  C.V. of matching weights:
  .6881261634
  S.D. of matching weights:
  .687337207
  Skewness of matching weights:
  .1077369259
  Kurtosis of matching weights:
  .0216811379
  Maximum matching weight:
  5.346641394

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .03174366  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01880683  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01499079  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00460016  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00088681  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00069868  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00016284  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00008031  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004972  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003906  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003723  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00002755  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001175  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  8.513e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  7.187e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.095e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.862e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  6.265e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  2.862e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.003e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.684e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.695e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.197e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  9.993e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  9.394e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  9.361e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  9.192e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  9.100e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  9.094e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  9.020e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  9.010e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  8.999e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  8.402e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  3.074e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.580e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  1.254e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  5.489e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  2.256e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  2.517e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  1.519e-11  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.6148131
        1.x2 |  -1.629519
        1.x3 |  -.4696456
          x4 |  -.2212177
          x5 |  -.0094296
          x6 |  -.0315781
          x7 |  -.0258518
         x90 |  -.1280055
         x91 |  -.1426087
         x92 |  -.1529322
         x93 |  -.1004651
         x94 |  -.0584315
         x95 |    -.16078
       _cons |   1.248045
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.12      .221      .361      .862      1.21      1.74      2.39      3.44      6.12      8.55
         |       408      .998      .514      .118      .193      .484       .64      .892      1.21      1.68      2.77      3.25
         |       408      .451      .117     .0978      .151      .308       .37       .45      .526      .606      .718      .749
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .512      .115      .191      .191      .372      .441      .508      .592      .664      .758      .758
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.03      .221      .387      .899      1.27      1.82      2.36      3.22      6.09      8.55
         |       500      .999      .464      .118      .223      .504        .7         1      1.12       1.6       2.7      3.25
         |       500      .462      .119     .0978       .17      .314      .383      .461      .537      .613      .724      .758
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .6125388  -.1613157  -.3232767   .4990018   1.047854
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0077211   .0036828   .0345885   .1064741   1.477864
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0214176   .0026462   .0172193   .1536741   1.125362
             |
          x4 |  .4218861   .5019654  -.0800793   -.161699   .4952368   .9798303
          x5 |  25.44699   25.28266   .1643269   .0303067   5.422129   .7928348
          x6 |  11.84757   12.62257  -.7750008  -.4720057   1.641931   .5238177
          x7 |  7.015422   6.447136   .5682861    .159836   3.555432   1.124647
         x90 |  .0839738  -.1286873   .2126611   .2215877   .9597153   .8777453
         x91 | -.0648837  -.1159094   .0510257    .054363     .93861   .9514721
         x92 |  .0575388  -.1708896   .2284284   .2205886    1.03554   1.089134
         x93 |  .1016523  -.0481191   .1497714    .158258   .9463749   .8931681
         x94 | -.1252265  -.0777641  -.0474624  -.0518853   .9147554   .8221164
         x95 | -.1044649  -.2061288   .1016638   .1120899   .9069849   .8476239
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  4.98176e-12
  Mean absolute standardized diff.
  .1552080283
  Maximum absolute standardized diff.
  .4720057498
  C.V. of matching weights:
  .4647073663
  S.D. of matching weights:
  .4640172272
  Skewness of matching weights:
  .0690477327
  Kurtosis of matching weights:
  .0135481966
  Maximum matching weight:
  3.254028265

. 
. // you can also target skiwness, kurtosis, or max weight, but it's finicky
. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance maxtarget(1 10 2) difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .9280066  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .08139982  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01131328  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00131793  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00061114  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00059138  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =   .0002708  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00023009  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00007024  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003343  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  6.729e-06  
Iteration 11:  f(p) =  2.710e-08  
Iteration 12:  f(p) =  2.158e-09  
Iteration 13:  f(p) =  1.193e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  2.454e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  5.869e-21  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweighting
Loss = mean(stddiff())^2 + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.318255
        1.x2 |  -1.638626
        1.x3 |  -.4670965
          x4 |  -.3829449
          x5 |   .0796804
          x6 |  -.2472425
          x7 |   .0533036
         x90 |   .0647898
         x91 |  -.1421803
         x92 |   .0748203
         x93 |   .0108845
         x94 |  -.1743659
         x95 |  -.0598728
       _cons |   1.249574
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       2.1     .0713      .237      .426      .707      1.23      2.45      4.29      10.3      19.6
         |       408         1      1.04      .038      .123      .229      .364      .649      1.26      2.02       4.7        10
         |       408      .338      .174      .025     .0766      .134      .197      .305      .459      .577       .76      .871
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .488      .184      .176      .176      .254      .324      .451      .656      .723      .878      .878
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.91     .0713      .239      .457      .837      1.51      2.33       3.8      10.3      19.6
         |       500         1      .942      .038      .123      .246      .426      .878      1.06      1.83      4.66        10
         |       500      .366      .185      .025     .0767      .142      .221       .33      .488      .656      .788      .878
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5158857  -.0646626  -.1295838   .4990018   .9957752
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096028   .0018011   .0169158   .1064741    1.19053
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0230895   .0009742   .0063395   .1536741    1.04566
             |
          x4 |  .4218861   .3874422   .0344439   .0695505   .4952368    1.03212
          x5 |  25.44699   26.55341  -1.106424  -.2040571   5.422129   .5963164
          x6 |  11.84757   11.95538  -.1078065  -.0656584   1.641931   .5801817
          x7 |  7.015422   7.109363  -.0939412  -.0264219   3.555432   1.147166
         x90 |  .0839738  -.0185488   .1025226   .1068261   .9597153   .8689711
         x91 | -.0648837  -.0749341   .0100504   .0107077     .93861   1.001296
         x92 |  .0575388  -.0089745   .0665133   .0642305    1.03554   1.137144
         x93 |  .1016523   .0554893   .0461631   .0487788   .9463749   .9764335
         x94 | -.1252265  -.2080042   .0827777   .0904917   .9147554   .7282621
         x95 | -.1044649  -.1152405   .0107755   .0118806   .9069849    .854426
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  5.40661e-21
  Mean absolute standardized diff.
  .0654955692
  Maximum absolute standardized diff.
  .204057104
  C.V. of matching weights:
  .942110983
  S.D. of matching weights:
  .9417348009
  Skewness of matching weights:
  .1565311839
  Kurtosis of matching weights:
  .0471001604
  Maximum matching weight:
  10
. }

. 
. log close gmatch_example_ado
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Downloads\Ado-clone\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 closed on:  27 Apr 2018, 10:12:11
----------------------------------------------------------------------------------------------------------------------------------------------------------------
