----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 opened on:  22 Feb 2018, 12:59:34

. 
. di as txt "Current user: `c(username)'" _n "Environment: `c(os)' `c(machine_type)' `: environment computername'" _n "Stata: `c(stata_version)'" cond(c(stata_v
> ersion)==c(version),""," (set to version `c(version)')") _n "Date: " c(current_date) " " c(current_time)
Current user: KKranker
Environment: Windows PC (64-bit x86-64) KKRANKER
Stata: 15.1
Date: 22 Feb 2018 12:59:34

. desc, short

Contains data from C:\Users\kkranker\Documents\Stata\Multiple-Equation-Models\simple_cattaneo_data.dta
  obs:         4,642                          Cattaneo (2010) study on the effect of maternal smoking on birth weight
 vars:            20                          8 Apr 2015 05:07
 size:       357,434                          
Sorted by: 
     Note: Dataset has changed since last saved.

. local varlist : copy local varlist_orig

. summ `treatvar' `varlist' `tousevar' `wgtvar' `depvars'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       treat |      4,642    .1861267    .3892508          0          1
          x1 |      4,642    .6996984    .4584385          0          1
        1.x2 |      4,642    .0340371    .1813439          0          1
-------------+---------------------------------------------------------
        1.x3 |      4,642    .0534252    .2249042          0          1
          x4 |      4,642    .4379578    .4961893          0          1
          x5 |      4,642    26.50452    5.619026         13         45
          x6 |      4,642    12.68957    2.520661          0         17
          x7 |      4,642    6.540069    3.359167          1         12
-------------+---------------------------------------------------------
         x90 |      4,642   -.0031039    1.020177  -4.107368   3.325766
         x91 |      4,642   -.0212069    1.008708   -4.16458   3.503644
         x92 |      4,642    .0076449    1.004589  -3.449011   3.959166
         x93 |      4,642    .0049339    1.004513  -4.274254   3.777972
         x94 |      4,642    .0124264    .9818583  -3.659006   3.658309
-------------+---------------------------------------------------------
         x95 |      4,642    .0044283    1.010194   -3.41615   3.724456
       touse |      4,642    .1077122      .31005          0          1
         wgt |      4,642    1.993316    .4062602   .6638338   3.540576
          y1 |      4,642     3361.68    578.8196        340       5500
   y1_binary |      4,642    .9396812    .2381022          0          1

. 
. 
. // * UNWEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. cbps `treatvar' `varlist' if `tousevar' , ate logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00451406  
Iteration 2:   f(p) =   .0005336  
Iteration 3:   f(p) =  .00001373  
Iteration 4:   f(p) =  2.637e-08  
Iteration 5:   f(p) =  6.777e-13  
Iteration 6:   f(p) =  1.066e-21  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.441064   .5046768    -2.86   0.004    -2.430213   -.4519161
        1.x2 |  -2.548784   3.501511    -0.73   0.467     -9.41162    4.314051
        1.x3 |   -1.02318   2.005094    -0.51   0.610    -4.953091    2.906732
          x4 |  -.2320966   .5678014    -0.41   0.683    -1.344967    .8807737
          x5 |   .0736983    .042799     1.72   0.085    -.0101862    .1575829
          x6 |  -.4863391   .1923869    -2.53   0.011    -.8634106   -.1092676
          x7 |   .0655415   .0720901     0.91   0.363    -.0757525    .2068354
         x90 |   .0303861    .203675     0.15   0.881    -.3688096    .4295819
         x91 |  -.0236437   .2499136    -0.09   0.925    -.5134655     .466178
         x92 |   .2014652   .2092517     0.96   0.336    -.2086606    .6115911
         x93 |  -.0067202   .2511949    -0.03   0.979    -.4990531    .4856126
         x94 |  -.3662317   .2431817    -1.51   0.132     -.842859    .1103956
         x95 |  -.0080118   .2531324    -0.03   0.975    -.5041423    .4881187
       _cons |   3.127763   1.826429     1.71   0.087    -.4519713    6.707497
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  2.590e-08  
Iteration 1:   f(p) =  2.548e-08  (backed up)
Iteration 2:   f(p) =  1.980e-08  
Iteration 3:   f(p) =  1.652e-08  
Iteration 4:   f(p) =  1.627e-08  
Iteration 5:   f(p) =  1.540e-08  
Iteration 6:   f(p) =  1.451e-08  
Iteration 7:   f(p) =  1.377e-08  
Iteration 8:   f(p) =  1.290e-08  
Iteration 9:   f(p) =  1.195e-08  
Iteration 10:  f(p) =  1.168e-08  
Iteration 11:  f(p) =  1.075e-08  
(switching technique to nr)
Iteration 12:  f(p) =  1.026e-08  
Iteration 13:  f(p) =  7.037e-09  
Iteration 14:  f(p) =  2.042e-10  
Iteration 15:  f(p) =  1.083e-12  
Iteration 16:  f(p) =  4.352e-17  
Iteration 17:  f(p) =  3.960e-25  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441064
        1.x2 |  -2.548784
        1.x3 |   -1.02318
          x4 |  -.2320966
          x5 |   .0736983
          x6 |  -.4863391
          x7 |   .0655415
         x90 |   .0303861
         x91 |  -.0236437
         x92 |   .2014652
         x93 |  -.0067202
         x94 |  -.3662317
         x95 |  -.0080118
       _cons |   3.127763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408      .161      .168    .00228    .00588     .0177     .0388      .102      .214        .4      .697      .887
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92      .289      .189     .0343     .0343     .0927      .126      .242      .423      .526      .928      .928
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500      .185      .179    .00228    .00648     .0207     .0485       .12      .268      .461      .712      .928
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6750468      .6750468      1.72e-11      3.66e-11      .4688264      1.008511  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0219357      .0219357      1.15e-11      7.84e-11      .1466203      1.008511  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0370067      .0370067      2.40e-10      1.27e-09      .1889672      1.008511  |
   7 |           x4      .4861037      .4861037      5.20e-11      1.04e-10      .5003074      1.008511  |
   8 |           x5      26.25386      26.25386      2.87e-11      4.57e-12      6.268993      .6747771  |
   9 |           x6      12.63471      12.63471      4.25e-10      1.81e-10      2.343236      .5637225  |
  10 |           x7      6.724952      6.724952     -2.27e-10     -6.75e-11      3.360602      1.190087  |
  11 |          x90     -.0592246     -.0592246      6.94e-11      6.65e-11      1.042785      1.206644  |
  12 |          x91      .0116973      .0116973     -1.60e-10     -1.63e-10      .9810721      .9436962  |
  13 |          x92     -.0041245     -.0041245     -4.41e-11     -4.33e-11      1.020036      1.339887  |
  14 |          x93      .0443809      .0443809      3.13e-11      3.24e-11      .9681889      .8469644  |
  15 |          x94     -.0856689     -.0856689     -1.31e-11     -1.29e-11      1.015864      .7767335  |
  16 |          x95     -.0859154     -.0859154     -5.96e-12     -6.11e-12      .9766877      .8347645  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.29325e-20
  Mean absolute standardized diff.
  1.58820e-10
  Maximum absolute standardized diff.
  1.26794e-09
  C.V. of matching weights:
  .5275374066
  S.D. of matching weights:
  .5275374066
  Skewness of matching weights:
  .2158747756
  Kurtosis of matching weights:
  .0860729366
  Maximum matching weight:
  6.906400443

. 
. cbps `treatvar' `varlist' if `tousevar' , ate over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .02441999  (not concave)
Iteration 1:   f(p) =    .020112  
Iteration 2:   f(p) =  .01484746  
Iteration 3:   f(p) =   .0142955  
Iteration 4:   f(p) =  .01428412  
Iteration 5:   f(p) =  .01428407  
Iteration 6:   f(p) =  .01428407  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.074574   .2572873    -4.18   0.000    -1.578848      -.5703
        1.x2 |  -1.732571    .847337    -2.04   0.041    -3.393321   -.0718214
        1.x3 |   -.535995   .6259896    -0.86   0.392    -1.762912    .6909221
          x4 |  -.2389831   .2458124    -0.97   0.331    -.7207666    .2428004
          x5 |   .0484453   .0243181     1.99   0.046     .0007828    .0961078
          x6 |  -.2519975   .0459113    -5.49   0.000    -.3419819    -.162013
          x7 |   .0081703   .0322545     0.25   0.800    -.0550474    .0713879
         x90 |    .120204   .1075227     1.12   0.264    -.0905366    .3309445
         x91 |  -.1467757   .1099013    -1.34   0.182    -.3621782    .0686269
         x92 |   .1315867   .1151671     1.14   0.253    -.0941367    .3573101
         x93 |    .086207   .1113523     0.77   0.439    -.1320395    .3044534
         x94 |  -.1702521    .103099    -1.65   0.099    -.3723225    .0318183
         x95 |   .0217906    .112224     0.19   0.846    -.1981643    .2417456
       _cons |   1.206345   .6074599     1.99   0.047      .015746    2.396945
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>7.142, 14) = 0.929

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  9.768e-08  
Iteration 1:   f(p) =  9.599e-08  (backed up)
Iteration 2:   f(p) =  7.672e-08  
Iteration 3:   f(p) =  6.399e-08  
Iteration 4:   f(p) =  6.304e-08  
Iteration 5:   f(p) =  6.026e-08  
Iteration 6:   f(p) =  5.854e-08  
Iteration 7:   f(p) =  5.801e-08  
Iteration 8:   f(p) =  5.780e-08  
Iteration 9:   f(p) =  5.775e-08  
Iteration 10:  f(p) =  5.764e-08  
Iteration 11:  f(p) =  5.743e-08  
(switching technique to nr)
Iteration 12:  f(p) =  5.722e-08  
Iteration 13:  f(p) =  5.714e-08  
Iteration 14:  f(p) =  5.714e-08  
Iteration 15:  f(p) =  5.714e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.074574
        1.x2 |  -1.732571
        1.x3 |  -.5359949
          x4 |   -.238983
          x5 |   .0484453
          x6 |  -.2519974
          x7 |   .0081703
         x90 |    .120204
         x91 |  -.1467757
         x92 |   .1315867
         x93 |    .086207
         x94 |  -.1702521
         x95 |   .0217906
       _cons |   1.206345
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408      .173      .114     .0142     .0324     .0574     .0892       .14      .232      .346      .487      .672
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92      .274       .13     .0508     .0508      .131      .157      .271      .373       .42      .673      .673
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500      .191      .123     .0142     .0339     .0609     .0967      .153      .263      .381       .55      .673
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6406563      .7027893      -.062133     -.1343718      .4623962      1.111543  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0157701      .0233767     -.0076067     -.0518322      .1467555      .6856459  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3       .024807      .0398362     -.0150293     -.0794675      .1891246      .6378543  |
   7 |           x4      .4886894      .4862356      .0024538      .0049044      .5003233      1.008759  |
   8 |           x5      25.82556      26.34781     -.5222463      -.087499      5.968599        .75999  |
   9 |           x6      12.33004       12.9064     -.5763641     -.2576164      2.237296      .5881093  |
  10 |           x7       6.88452      6.669732      .2147883      .0639215      3.360189      1.180429  |
  11 |          x90     -.0713183     -.0265029     -.0448154     -.0441805      1.014371      1.157748  |
  12 |          x91      .0200089     -.0226109      .0426199       .043028      .9905145      .9174008  |
  13 |          x92      .0040221     -.0083767      .0123988       .012151      1.020391      1.200576  |
  14 |          x93      .0229491       .055179       -.03223     -.0331899      .9710769      .8891008  |
  15 |          x94      -.121595     -.0231316     -.0984633     -.0994521       .990058      .8143466  |
  16 |          x95     -.0950136      -.071595     -.0234187     -.0239408      .9781897      .8041468  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0027971508
  Mean absolute standardized diff.
  .0719657756
  Maximum absolute standardized diff.
  .2576163783
  C.V. of matching weights:
  .2958975504
  S.D. of matching weights:
  .2958975504
  Skewness of matching weights:
  .1574497662
  Kurtosis of matching weights:
  .0654318582
  Maximum matching weight:
  4.204588915

. 
. cbps `treatvar' `varlist' if `tousevar' , att logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00006892  
Iteration 2:   f(p) =  1.777e-07  
Iteration 3:   f(p) =  2.570e-12  
Iteration 4:   f(p) =  6.940e-22  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.339291   .3615444    -3.70   0.000    -2.047905   -.6306769
        1.x2 |  -1.525175    1.19071    -1.28   0.200    -3.858923    .8085728
        1.x3 |  -.5996277   .8424377    -0.71   0.477    -2.250775     1.05152
          x4 |  -.3183658   .3103113    -1.03   0.305    -.9265647    .2898331
          x5 |   .0587883     .02835     2.07   0.038     .0032234    .1143533
          x6 |  -.2435676   .0675718    -3.60   0.000    -.3760059   -.1111292
          x7 |   .0341034   .0400884     0.85   0.395    -.0444685    .1126752
         x90 |    .158599   .1286436     1.23   0.218    -.0935378    .4107357
         x91 |  -.1617619    .131618    -1.23   0.219    -.4197284    .0962045
         x92 |   .1391156   .1358437     1.02   0.306    -.1271333    .4053644
         x93 |   .0571151    .134574     0.42   0.671    -.2066451    .3208752
         x94 |  -.1175052   .1193236    -0.98   0.325    -.3513752    .1163649
         x95 |    .011505   .1383574     0.08   0.934    -.2596705    .2826805
       _cons |    .782858    .962964     0.81   0.416    -1.104517    2.670233
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
(switching technique to nr)
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.181e-12  
Iteration 14:  f(p) =  4.655e-16  
Iteration 15:  f(p) =  2.607e-24  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4673913     -1.38e-10     -2.77e-10      .4994352      1.008511  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0108696     -7.66e-11     -7.38e-10      .1037929      1.008511  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0217391     -8.17e-11     -5.60e-10      .1459766      1.008511  |
   7 |           x4      .4347826      .4347826     -4.03e-10     -8.12e-10      .4962249      1.008511  |
   8 |           x5      25.46739      25.46739     -1.76e-09     -2.65e-10      6.664728      .6195799  |
   9 |           x6      11.86957      11.86957     -1.98e-09     -9.69e-10      2.043536      .5669465  |
  10 |           x7      6.858696      6.858696     -1.77e-10     -5.27e-11      3.363971      1.145237  |
  11 |          x90      .0972024      .0972024      4.54e-11      4.44e-11      1.021603       .845302  |
  12 |          x91     -.0890157     -.0890157     -3.25e-11     -3.40e-11      .9556678      .9654928  |
  13 |          x92      .0453787      .0453787      4.05e-11      4.06e-11      .9971707      1.136731  |
  14 |          x93      .0865687      .0865687     -6.32e-11     -6.65e-11        .95074      .9577067  |
  15 |          x94     -.1299173     -.1299173      5.29e-10      5.16e-10       1.02511      .7795321  |
  16 |          x95     -.0807251     -.0807251      8.07e-11      8.42e-11      .9586344      .8888006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  5.64497e-20
  Mean absolute standardized diff.
  3.42968e-10
  Maximum absolute standardized diff.
  9.69352e-10
  C.V. of matching weights:
  .892680365
  S.D. of matching weights:
  .892680365
  Skewness of matching weights:
  .1100078305
  Kurtosis of matching weights:
  .0225364399
  Maximum matching weight:
  7.032260601

. 
. cbps `treatvar' `varlist' if `tousevar' , att over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .04521356  
Iteration 1:   f(p) =  .03210384  
Iteration 2:   f(p) =   .0303286  
Iteration 3:   f(p) =   .0302734  
Iteration 4:   f(p) =  .03027339  
Iteration 5:   f(p) =  .03027339  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.171988   .2187737    -5.36   0.000    -1.600776   -.7431991
        1.x2 |  -1.909814   .6607307    -2.89   0.004    -3.204822   -.6148052
        1.x3 |  -.4402667   .7269474    -0.61   0.545    -1.865057     .984524
          x4 |  -.3130788   .2251092    -1.39   0.164    -.7542848    .1281272
          x5 |   .0503881   .0191417     2.63   0.008     .0128711    .0879051
          x6 |  -.2393185   .0575186    -4.16   0.000     -.352053   -.1265841
          x7 |   .0261168   .0311563     0.84   0.402    -.0349484    .0871821
         x90 |   .1425533   .1007579     1.41   0.157    -.0549285    .3400351
         x91 |  -.1282785   .1127153    -1.14   0.255    -.3491964    .0926393
         x92 |      .1073   .1112316     0.96   0.335    -.1107099    .3253099
         x93 |   .0527165   .1101053     0.48   0.632    -.1630859    .2685189
         x94 |  -.1248021   .0971592    -1.28   0.199    -.3152305    .0656263
         x95 |   .0220743   .1115296     0.20   0.843    -.1965196    .2406683
       _cons |   .9132207   .6048419     1.51   0.131    -.2722476    2.098689
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>15.137, 14) = 0.369

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  1.809e-07  
Iteration 1:   f(p) =  1.775e-07  (backed up)
Iteration 2:   f(p) =  1.749e-07  
Iteration 3:   f(p) =  1.665e-07  
Iteration 4:   f(p) =  1.593e-07  
Iteration 5:   f(p) =  1.436e-07  
Iteration 6:   f(p) =  1.400e-07  
Iteration 7:   f(p) =  1.356e-07  
Iteration 8:   f(p) =  1.328e-07  
Iteration 9:   f(p) =  1.272e-07  
Iteration 10:  f(p) =  1.231e-07  
Iteration 11:  f(p) =  1.224e-07  
(switching technique to nr)
Iteration 12:  f(p) =  1.220e-07  
Iteration 13:  f(p) =  1.211e-07  
Iteration 14:  f(p) =  1.211e-07  
Iteration 15:  f(p) =  1.211e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171988
        1.x2 |  -1.909811
        1.x3 |  -.4402667
          x4 |  -.3130788
          x5 |   .0503881
          x6 |  -.2393185
          x7 |   .0261168
         x90 |   .1425533
         x91 |  -.1282785
         x92 |   .1072999
         x93 |   .0527165
         x94 |  -.1248021
         x95 |   .0220743
       _cons |   .9132204
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408      .164      .111     .0101     .0291     .0535     .0814       .13      .221       .34      .472      .599
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .151       .26      .364      .429      .666      .666
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500      .183      .122     .0101     .0298     .0577     .0913      .147      .253      .376      .555      .666
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4923283     -.0249369      -.049839      .5003503      1.004458  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0074884      .0033811      .0376593      .0897825      1.458884  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391       .023711     -.0019719     -.0130452       .151158      .9265074  |
   7 |           x4      .4347826      .4386729     -.0038903     -.0078334      .4966326      1.006495  |
   8 |           x5      25.46739      25.45801      .0093781      .0014148      6.628535      .6273162  |
   9 |           x6      11.86957      11.89491     -.0253428     -.0123239        2.0564       .559006  |
  10 |           x7      6.858696      6.790863      .0678324      .0201339       3.36906      1.140985  |
  11 |          x90      .0972024      .0826851      .0145173      .0142151      1.021263      .8460037  |
  12 |          x91     -.0890157     -.0671192     -.0218965     -.0227622      .9619657      .9503048  |
  13 |          x92      .0453787      .0235132      .0218655      .0219385      .9966695      1.138269  |
  14 |          x93      .0865687      .0849356       .001633      .0017143      .9526181      .9531308  |
  15 |          x94     -.1299173     -.1339674      .0040501      .0039553      1.023979      .7815571  |
  16 |          x95     -.0807251     -.0745052     -.0062199     -.0064787      .9600495      .8856706  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  7.49047e-07
  Mean absolute standardized diff.
  .016408746
  Maximum absolute standardized diff.
  .0498389801
  C.V. of matching weights:
  .826886455
  S.D. of matching weights:
  .826886455
  Skewness of matching weights:
  .1040781457
  Kurtosis of matching weights:
  .0213437013
  Maximum matching weight:
  6.683351127

. 
. // After calling gmatch, the data is stored in a class instance named gmatch_ado_most_recent
. // You can print any of the public functions or variables to the screen with gmatchcall. For example:
. gmatchcall diff()
                  1              2              3              4              5              6              7              8              9             10
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
  1 |   -.024936947              0    .0033811488              0     -.00197189   -.0038903335    .0093781253   -.0253427887    .0678324389    .0145173066
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
                 11             12             13             14             15
     ----------------------------------------------------------------------------+
  1    -.0218964669    .0218654677    .0016330441    .0040501466   -.0062199127  |
     ----------------------------------------------------------------------------+

. gmatchcall balancetable()
                 1            2            3            4            5            6            7
     +--------------------------------------------------------------------------------------------+
   1 |    Variable     mean (T)     mean (C)       diff()    stddiff()       sd (T)   varratio()  |
   2 |          x1     .4673913     .4923283    -.0249369    -.0497079     .5016695     1.004458  |
   3 |       0b.x2            0            0            0            .            0            .  |
   4 |        1.x2     .0108696     .0074884     .0033811     .0324308     .1042572     1.458884  |
   5 |       0b.x3            0            0            0            .            0            .  |
   6 |        1.x3     .0217391      .023711    -.0019719    -.0134481     .1466296     .9265074  |
   7 |          x4     .4347826     .4386729    -.0038903    -.0078049     .4984448     1.006495  |
   8 |          x5     25.46739     25.45801     .0093781     .0017227     5.443922     .6273162  |
   9 |          x6     11.86957     11.89491    -.0253428    -.0157893     1.605057      .559006  |
  10 |          x7     6.858696     6.790863     .0678324     .0190717     3.556704     1.140985  |
  11 |         x90     .0972024     .0826851     .0145173     .0152207     .9537854     .8460037  |
  12 |         x91    -.0890157    -.0671192    -.0218965    -.0232211     .9429542     .9503048  |
  13 |         x92     .0453787     .0235132     .0218655      .020801     1.051175     1.138269  |
  14 |         x93     .0865687     .0849356      .001633     .0017466     .9349714     .9531308  |
  15 |         x94    -.1299173    -.1339674     .0040501     .0043794     .9248091     .7815571  |
  16 |         x95    -.0807251    -.0745052    -.0062199    -.0068051      .914005     .8856706  |
     +--------------------------------------------------------------------------------------------+
                   1              2              3              4              5              6
     +-------------------------------------------------------------------------------------------+
   1 |   .4673913043    .4923282514    -.024936947   -.0497079239    .5016694537    1.004458061  |
   2 |             0              0              0              .              0              .  |
   3 |   .0108695652    .0074884165    .0033811488    .0324308396     .104257207    1.458884284  |
   4 |             0              0              0              .              0              .  |
   5 |   .0217391304    .0237110204     -.00197189   -.0134481032    .1466295976    .9265074175  |
   6 |   .4347826087    .4386729422   -.0038903335   -.0078049437    .4984447863    1.006494803  |
   7 |    25.4673913    25.45801318    .0093781253    .0017226781    5.443922081    .6273161667  |
   8 |   11.86956522    11.89490801   -.0253427887   -.0157893436    1.605056511    .5590060153  |
   9 |   6.858695652    6.790863213    .0678324389    .0190717133    3.556703999    1.140985236  |
  10 |   .0972024365    .0826851299    .0145173066    .0152207271    .9537853564    .8460036791  |
  11 |  -.0890156845   -.0671192175   -.0218964669   -.0232211342    .9429542393    .9503048128  |
  12 |   .0453786792    .0235132115    .0218654677    .0208009697    1.051175404    1.138268871  |
  13 |   .0865686693    .0849356252    .0016330441    .0017466245    .9349714429    .9531308328  |
  14 |  -.1299172593    -.133967406    .0040501466    .0043794409    .9248090545    .7815571022  |
  15 |  -.0807250915   -.0745051788   -.0062199127    -.006805119    .9140049864    .8856705764  |
     +-------------------------------------------------------------------------------------------+

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00032638  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  8.089e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  5.298e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.466e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.466e-13  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206443
        1.x2 |  -1.628676
        1.x3 |  -.5803099
          x4 |  -.2832337
          x5 |    .069416
          x6 |   -.278787
          x7 |   .0283208
         x90 |   .1446874
         x91 |  -.1322013
         x92 |   .1288213
         x93 |   .0633599
         x94 |  -.1645469
         x95 |   .0190734
       _cons |    1.37953
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408      .232      .146     .0183     .0376     .0766      .119      .196      .313      .465      .614      .804
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .364      .163     .0707     .0707      .176      .215      .347      .492      .558      .798      .798
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500      .257      .158     .0183     .0409     .0838      .136      .216       .35      .497      .687      .804
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5065699     -.0391786     -.0782789      .5005003      1.004395  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0094032      .0014663      .0149666      .0979729       1.16405  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0217076      .0000315       .000216      .1458921      1.009943  |
   7 |           x4      .4347826      .4181838      .0165988      .0335836      .4942521      1.018627  |
   8 |           x5      25.46739      26.05539     -.5880032     -.0858609      6.848323      .5832672  |
   9 |           x6      11.86957      11.79935      .0702201      .0339782      2.066626      .5528997  |
  10 |           x7      6.858696       6.77528      .0834157      .0247604      3.368912      1.141156  |
  11 |          x90      .0972024       .056997      .0402054      .0394186       1.01996      .8487816  |
  12 |          x91     -.0890157      -.062197     -.0268186     -.0280778      .9551534      .9668971  |
  13 |          x92      .0453787      .0391245      .0062542       .006305      .9919318      1.151879  |
  14 |          x93      .0865687        .10444     -.0178714     -.0188337      .9489023      .9622811  |
  15 |          x94     -.1299173     -.1873487      .0574314       .054986      1.044474      .7465149  |
  16 |          x95     -.0807251     -.0886595      .0079344      .0082921      .9568576      .8927751  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.76089e-07
  Mean absolute standardized diff.
  .0328890789
  Maximum absolute standardized diff.
  .0858609075
  C.V. of matching weights:
  .9404771682
  S.D. of matching weights:
  .9404771682
  Skewness of matching weights:
  .1710872074
  Kurtosis of matching weights:
  .0624911056
  Maximum matching weight:
  11.09495523

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet sd_sq treatvariance difficult nonrtolerance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .02141594  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .02005607  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01097598  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00782372  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00292673  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00193285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00085471  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00063406  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00028285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013476  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00008047  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00006324  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =   .0000443  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00004163  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00003568  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00003416  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  .00002911  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  .00002237  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =    .000022  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  .00001249  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  .00001002  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  8.756e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.572e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  7.164e-06  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  6.172e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  5.933e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  5.174e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  4.769e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  4.741e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  4.696e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  4.587e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  4.581e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  4.581e-06  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = sum(stddiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.341704
        1.x2 |   -1.54377
        1.x3 |  -.5899408
          x4 |  -.3171857
          x5 |   .0590428
          x6 |  -.2438239
          x7 |   .0338901
         x90 |   .1591256
         x91 |  -.1623107
         x92 |    .138865
         x93 |   .0569692
         x94 |  -.1173517
         x95 |   .0110794
       _cons |   1.448512
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .99     .0557      .122      .226      .376      .636      1.25      2.36      4.58      7.05
         |       408         1       .99     .0557      .122      .226      .376      .636      1.25      2.36      4.58      7.05
         |       408       .26      .157     .0239     .0509     .0904      .142      .218      .355       .51      .668      .756
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .403      .177      .081      .081      .192      .238      .411      .548      .623       .81       .81
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .894     .0557      .125      .246      .432      .808      1.05      2.06      4.53      7.05
         |       500         1      .894     .0557      .125      .246      .432      .808      1.05      2.06      4.53      7.05
         |       500      .287       .17     .0239     .0521     .0969      .158      .242      .401      .555      .735       .81
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4672233       .000168      .0003364      .4994262      1.008556  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0107162      .0001534      .0014861      .1032002      1.022786  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0218697     -.0001306     -.0008923      .1463259      1.002624  |
   7 |           x4      .4347826      .4348664     -.0000838     -.0001689      .4962339      1.008466  |
   8 |           x5      25.46739      25.47025     -.0028597      -.000429      6.666539      .6191968  |
   9 |           x6      11.86957      11.86871      .0008586      .0004202      2.043455       .566997  |
  10 |           x7      6.858696      6.856403      .0022926      .0006815      3.364149      1.145085  |
  11 |          x90      .0972024      .0975942     -.0003918     -.0003835      1.021555      .8453963  |
  12 |          x91     -.0890157     -.0894051      .0003894      .0004075      .9555954      .9656707  |
  13 |          x92      .0453787      .0452596      .0001191      .0001194      .9973057      1.136345  |
  14 |          x93      .0865687      .0864977       .000071      .0000747      .9506505      .9579257  |
  15 |          x94     -.1299173     -.1297981     -.0001191     -.0001162      1.025242      .7792962  |
  16 |          x95     -.0807251     -.0810567      .0003316      .0003459      .9586088      .8888576  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  2.09523e-08
  Mean absolute standardized diff.
  .0004508927
  Maximum absolute standardized diff.
  .0014860783
  C.V. of matching weights:
  .8937312772
  S.D. of matching weights:
  .8937312772
  Skewness of matching weights:
  .1101013871
  Kurtosis of matching weights:
  .0225784781
  Maximum matching weight:
  7.052811095

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.978e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -365.5251   68.93598    -5.30   0.000    -500.6371   -230.4131
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3417.895   43.41569    78.72   0.000     3332.801    3502.988
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3417.8947

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752   -.0090577      1.338962   .9989677
                  |
               x2 |
               1  |  -.1180374    .0096998      .4133173   1.098626
                  |
               x3 |
               1  |  -.1253201    .0022927      .5085817   1.015318
                  |
               x4 |  -.1207472   -.0222549      .9914484   .9947225
               x5 |  -.1944638    .0308855      .8589874   .5917507
               x6 |  -.6542694    .0952268      .4958356   .5601212
               x7 |   .0473848    .0429284      1.160037   1.132231
              x90 |   .1499304    .0130255      .9289414   .8182649
              x91 |  -.0833726   -.0288848      .8791918   .9584288
              x92 |   .0662245    .0110605      1.090179   1.139468
              x93 |   .0479737   -.0087695      .8926169   .9659809
              x94 |  -.1521926    .0562648      .8686432   .7583723
              x95 |  -.0155155     .017858      .8285405   .8879817
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4719209     -.0045296     -.0090652      .4996633      1.007399  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0098847      .0009849      .0098566      .0999227      1.107894  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0214054      .0003337      .0023004      .1450795      1.023886  |
   7 |           x4      .4347826       .445852     -.0110694     -.0222576      .4973308      1.003118  |
   8 |           x5      25.46739      25.27307      .1943233      .0286772      6.776222       .596745  |
   9 |           x6      11.86957      11.68981      .1797533      .0877664      2.048089      .5648484  |
  10 |           x7      6.858696      6.711046      .1476493      .0438323      3.368502      1.141787  |
  11 |          x90      .0972024      .0841522      .0130502       .012645      1.032043      .8251709  |
  12 |          x91     -.0890157     -.0615794     -.0274362     -.0287197      .9553102      .9665176  |
  13 |          x92      .0453787      .0341522      .0112265      .0113068       .992897      1.149085  |
  14 |          x93      .0865687      .0948113     -.0082427     -.0087305        .94412      .9741335  |
  15 |          x94     -.1299173     -.1857505      .0558332      .0540116      1.033726      .7647728  |
  16 |          x95     -.0807251     -.0974964      .0167713      .0175493      .9556712      .8954759  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet ipw averagevariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4719209     -.0045296     -.0090652      .4996633      1.007399  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0098847      .0009849      .0098566      .0999227      1.107894  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0214054      .0003337      .0023004      .1450795      1.023886  |
   7 |           x4      .4347826       .445852     -.0110694     -.0222576      .4973308      1.003118  |
   8 |           x5      25.46739      25.27307      .1943233      .0286772      6.776222       .596745  |
   9 |           x6      11.86957      11.68981      .1797533      .0877664      2.048089      .5648484  |
  10 |           x7      6.858696      6.711046      .1476493      .0438323      3.368502      1.141787  |
  11 |          x90      .0972024      .0841522      .0130502       .012645      1.032043      .8251709  |
  12 |          x91     -.0890157     -.0615794     -.0274362     -.0287197      .9553102      .9665176  |
  13 |          x92      .0453787      .0341522      .0112265      .0113068       .992897      1.149085  |
  14 |          x93      .0865687      .0948113     -.0082427     -.0087305        .94412      .9741335  |
  15 |          x94     -.1299173     -.1857505      .0558332      .0540116      1.033726      .7647728  |
  16 |          x95     -.0807251     -.0974964      .0167713      .0175493      .9556712      .8954759  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805
  Maximum matching weight:
  9.288959219

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , ate aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  1.612e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |   -328.878   82.21905    -4.00   0.000    -490.0244   -167.7316
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3452.527   28.58753   120.77   0.000     3396.497    3508.558
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6643106      .6980937     -.0337831     -.0730952      .4621798      1.067096  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0126474      .0237734      -.011126     -.0762399       .145934      .5426396  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0252967      .0398782     -.0145815     -.0769757      .1894293      .6494649  |
   7 |           x4      .5035684      .4859058      .0176626      .0352982       .500383      1.009262  |
   8 |           x5      25.88638       26.3268     -.4404207     -.0736253       5.98192      .7436049  |
   9 |           x6      12.40345      12.88502     -.4815643      -.214612      2.243884      .5994444  |
  10 |           x7      6.783391      6.698872      .0845182      .0251498       3.36059      1.188955  |
  11 |          x90     -.1279394     -.0237456     -.1041937     -.1022979      1.018533      1.179133  |
  12 |          x91      .0259183     -.0177924      .0437107      .0442269      .9883275      .9105384  |
  13 |          x92      .0197006     -.0121531      .0318537      .0312437      1.019527      1.201641  |
  14 |          x93      .0303493      .0505445     -.0201952     -.0208151      .9702151      .8788976  |
  15 |          x94      -.142924     -.0216133     -.1213108     -.1226343      .9892079      .7980325  |
  16 |          x95     -.0930146     -.0717394     -.0212752     -.0217631      .9775833      .7971968  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0024703949
  Mean absolute standardized diff.
  .0706136183
  Maximum absolute standardized diff.
  .2146119676
  C.V. of matching weights:
  .3337259551
  S.D. of matching weights:
  .3337259551
  Skewness of matching weights:
  .1843123883
  Kurtosis of matching weights:
  .0838509706
  Maximum matching weight:
  4.89816874

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  3.813e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |     319.07   91.15096     3.50   0.000     140.4174    497.7225
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3141.406   87.28586    35.99   0.000     2970.328    3312.483
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.207512   .3268258     3.69   0.000     .5669452    1.848079
                        |
                     x2 |
                     1  |   1.628792   1.054719     1.54   0.123    -.4384199    3.696005
                        |
                     x3 |
                     1  |   .5805318   .8259794     0.70   0.482    -1.038358    2.199422
                     x4 |   .2831153   .2838113     1.00   0.318    -.2731445    .8393752
                     x5 |  -.0545179   .0270259    -2.02   0.044    -.1074878   -.0015481
                     x6 |   .2844593   .0688093     4.13   0.000     .1495955     .419323
                     x7 |   -.023871   .0390129    -0.61   0.541    -.1003349    .0525929
                    x90 |  -.1439494   .1292697    -1.11   0.265    -.3973133    .1094145
                    x91 |   .1331182   .1248073     1.07   0.286    -.1114997    .3777361
                    x92 |  -.1277527    .133834    -0.95   0.340    -.3900625    .1345572
                    x93 |  -.0623585   .1243317    -0.50   0.616    -.3060441    .1813271
                    x94 |   .1663354   .1194682     1.39   0.164    -.0678179    .4004887
                    x95 |   -.017776   .1254901    -0.14   0.887     -.263732    .2281801
                  _cons |  -1.379538   .9297905    -1.48   0.138    -3.201894    .4428177
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ateu ipw treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .7133644           .75     -.0366356     -.0837821      .4372727      1.099818  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0130902      .0269608     -.0138706     -.0897954      .1544686      .4966403  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0261829      .0441176     -.0179347     -.0905493      .1980657       .609761  |
   7 |           x4      .5207033       .495098      .0256053      .0511594      .5005007      1.006879  |
   8 |           x5      25.99075      26.56863      -.577878     -.1002906      5.762036      .7963305  |
   9 |           x6      12.53645      13.15931     -.6228673     -.2813566        2.2138      .6382822  |
  10 |           x7      6.764632      6.696078      .0685532      .0204092      3.358927      1.200431  |
  11 |          x90     -.1840235      -.048508     -.1355155     -.1337092      1.013509      1.263776  |
  12 |          x91       .054549     -.0077434      .0622924      .0625861      .9953062      .8955527  |
  13 |          x92       .013304     -.0227801      .0360842      .0351881      1.025465       1.21557  |
  14 |          x93      .0163448      .0403853     -.0240406     -.0246383      .9757395       .857822  |
  15 |          x94     -.1461641      .0160559     -.1622201     -.1661874       .976127      .8119355  |
  16 |          x95      -.096076     -.0658282     -.0302478     -.0307892      .9824155      .7755988  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0040935914
  Mean absolute standardized diff.
  .0900339258
  Maximum absolute standardized diff.
  .2813566299
  C.V. of matching weights:
  .3545137453
  S.D. of matching weights:
  .3545137453
  Skewness of matching weights:
  .2680619555
  Kurtosis of matching weights:
  .1550433574
  Maximum matching weight:
  5.869225798

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
(switching technique to nr)
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.181e-12  
Iteration 14:  f(p) =  4.655e-16  
Iteration 15:  f(p) =  2.607e-24  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4673913     -1.38e-10     -2.77e-10      .4994352      1.008511  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0108696     -7.66e-11     -7.38e-10      .1037929      1.008511  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0217391     -8.17e-11     -5.60e-10      .1459766      1.008511  |
   7 |           x4      .4347826      .4347826     -4.03e-10     -8.12e-10      .4962249      1.008511  |
   8 |           x5      25.46739      25.46739     -1.76e-09     -2.65e-10      6.664728      .6195799  |
   9 |           x6      11.86957      11.86957     -1.98e-09     -9.69e-10      2.043536      .5669465  |
  10 |           x7      6.858696      6.858696     -1.77e-10     -5.27e-11      3.363971      1.145237  |
  11 |          x90      .0972024      .0972024      4.54e-11      4.44e-11      1.021603       .845302  |
  12 |          x91     -.0890157     -.0890157     -3.25e-11     -3.40e-11      .9556678      .9654928  |
  13 |          x92      .0453787      .0453787      4.05e-11      4.06e-11      .9971707      1.136731  |
  14 |          x93      .0865687      .0865687     -6.32e-11     -6.65e-11        .95074      .9577067  |
  15 |          x94     -.1299173     -.1299173      5.29e-10      5.16e-10       1.02511      .7795321  |
  16 |          x95     -.0807251     -.0807251      8.07e-11      8.42e-11      .9586344      .8888006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  5.64497e-20
  Mean absolute standardized diff.
  3.42968e-10
  Maximum absolute standardized diff.
  9.69352e-10
  C.V. of matching weights:
  .892680365
  S.D. of matching weights:
  .892680365
  Skewness of matching weights:
  .1100078305
  Kurtosis of matching weights:
  .0225364399
  Maximum matching weight:
  7.032260601

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00061284  
Iteration 1:   f(p) =  2.180e-07  
Iteration 2:   f(p) =  1.269e-07  
Iteration 3:   f(p) =  1.206e-07  
Iteration 4:   f(p) =  1.176e-07  
Iteration 5:   f(p) =  1.170e-07  
Iteration 6:   f(p) =  1.170e-07  
Iteration 7:   f(p) =  1.161e-07  
Iteration 8:   f(p) =  8.900e-08  
Iteration 9:   f(p) =  8.301e-08  
Iteration 10:  f(p) =  8.238e-08  
Iteration 11:  f(p) =  8.232e-08  
(switching technique to nr)
Iteration 12:  f(p) =  8.209e-08  
Iteration 13:  f(p) =  7.516e-08  
Iteration 14:  f(p) =  6.789e-08  
Iteration 15:  f(p) =  4.227e-08  
Iteration 16:  f(p) =  2.563e-08  (not concave)
Iteration 17:  f(p) =  1.606e-08  
Iteration 18:  f(p) =  1.235e-08  
Iteration 19:  f(p) =  1.146e-08  
Iteration 20:  f(p) =  1.143e-08  
Iteration 21:  f(p) =  1.143e-08  
Iteration 22:  f(p) =  1.143e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.069921
        1.x2 |  -1.301676
        1.x3 |  -.4865721
          x4 |  -.2463172
          x5 |   .0447741
          x6 |  -.1995635
          x7 |   .0257331
         x90 |   .1236242
         x91 |  -.1270511
         x92 |   .1015911
         x93 |   .0470551
         x94 |  -.0948947
         x95 |   .0008498
       _cons |   .4556058
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .778     .0982      .186      .326      .484      .726      1.27      2.16      3.56         5
         |       408         1      .778     .0982      .186      .326      .484      .726      1.27      2.16      3.56         5
         |       408      .163     .0963     .0205     .0382     .0651     .0937      .134      .213      .316      .432      .516
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .252      .117     .0584     .0584      .123      .148      .246      .342      .394      .585      .585
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .703     .0982      .194      .341      .532      .903      1.07      1.93      3.51         5
         |       500         1      .703     .0982      .194      .341      .532      .903      1.07      1.93      3.51         5
         |       500      .179      .106     .0205     .0398     .0673        .1      .148       .24      .344      .498      .585
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5182506     -.0508593     -.1016329      .5004216      1.005561  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696       .012455     -.0015855     -.0144495      .1097244      .8815459  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0242826     -.0025435     -.0166652       .152624      .9052271  |
   7 |           x4      .4347826      .4521396     -.0173569     -.0348614      .4978848       1.00052  |
   8 |           x5      25.46739      25.54157     -.0741744     -.0113793      6.518363      .6518318  |
   9 |           x6      11.86957      12.06656     -.1969954     -.0946412      2.081497      .5447873  |
  10 |           x7      6.858696      6.811629       .047067       .013994      3.363384      1.145782  |
  11 |          x90      .0972024      .0715906      .0256118      .0252581      1.014003      .8605673  |
  12 |          x91     -.0890157     -.0737238     -.0152918     -.0158205      .9665824      .9393008  |
  13 |          x92      .0453787      .0269169      .0184618        .01845      1.000638      1.126957  |
  14 |          x93      .0865687       .076542      .0100267      .0104435      .9600932      .9352735  |
  15 |          x94     -.1299173     -.0967908     -.0331264     -.0326327      1.015129       .797834  |
  16 |          x95     -.0807251     -.0889147      .0081896      .0084926      .9643199      .8763149  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0003564678
  Mean absolute standardized diff.
  .0306708412
  Maximum absolute standardized diff.
  .101632926
  C.V. of matching weights:
  .702695044
  S.D. of matching weights:
  .702695044
  Skewness of matching weights:
  .0867263832
  Kurtosis of matching weights:
  .0156197301
  Maximum matching weight:
  4.997305895

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvtarget(1 .50 6)

_cvopt:         1 .5 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .02519572  
Iteration 1:   f(p) =  .00037232  
Iteration 2:   f(p) =  .00018115  
Iteration 3:   f(p) =  .00007047  
Iteration 4:   f(p) =  .00006335  
Iteration 5:   f(p) =  .00005995  
Iteration 6:   f(p) =  .00003158  
Iteration 7:   f(p) =  .00001706  
Iteration 8:   f(p) =  .00001448  
Iteration 9:   f(p) =  .00001017  
Iteration 10:  f(p) =  9.753e-06  
Iteration 11:  f(p) =  9.539e-06  
(switching technique to nr)
Iteration 12:  f(p) =  9.503e-06  (not concave)
Iteration 13:  f(p) =  6.831e-06  (not concave)
Iteration 14:  f(p) =  5.276e-06  (not concave)
Iteration 15:  f(p) =  3.205e-06  (not concave)
Iteration 16:  f(p) =  1.200e-06  (not concave)
Iteration 17:  f(p) =  1.542e-07  (not concave)
Iteration 18:  f(p) =  1.120e-07  
Iteration 19:  f(p) =  9.309e-08  (not concave)
Iteration 20:  f(p) =  9.006e-08  (not concave)
Iteration 21:  f(p) =  8.342e-08  
Iteration 22:  f(p) =  7.002e-08  
Iteration 23:  f(p) =  5.958e-08  
(switching technique to bfgs)
Iteration 24:  f(p) =  5.389e-08  
Iteration 25:  f(p) =  5.205e-08  
Iteration 26:  f(p) =  5.135e-08  
Iteration 27:  f(p) =  5.121e-08  
Iteration 28:  f(p) =  5.115e-08  
Iteration 29:  f(p) =  5.114e-08  
Iteration 30:  f(p) =  5.114e-08  
Iteration 31:  f(p) =  5.114e-08  
Iteration 32:  f(p) =  5.114e-08  
Iteration 33:  f(p) =  5.114e-08  
Iteration 34:  f(p) =  5.114e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.7223993
        1.x2 |  -.9764489
        1.x3 |  -.3664455
          x4 |  -.1681781
          x5 |   .0290496
          x6 |  -.1459139
          x7 |   .0167632
         x90 |   .0854724
         x91 |  -.0882866
         x92 |   .0659923
         x93 |   .0343075
         x94 |  -.0658922
         x95 |  -.0067045
       _cons |  -.0849073
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .532      .195      .322      .466      .622      .841      1.25      1.82      2.59      3.28
         |       408         1      .532      .195      .322      .466      .622      .841      1.25      1.82      2.59      3.28
         |       408      .153     .0657     .0355     .0574     .0809      .105      .137      .191      .256      .329      .382
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .213     .0737     .0763     .0763      .132      .149      .213      .269      .301      .429      .429
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .481      .195      .328      .492      .675      .991      1.11      1.68      2.57      3.28
         |       500         1      .481      .195      .328      .492      .675      .991      1.11      1.68      2.57      3.28
         |       500      .164     .0711     .0355     .0584     .0847      .112      .148      .205      .274      .369      .429
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5906793      -.123288      -.248639      .4958513      1.038375  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0149904     -.0041208     -.0347557      .1185653       .734333  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0280471      -.006308     -.0389589      .1619135      .7867638  |
   7 |           x4      .4347826      .4668556      -.032073     -.0642781      .4989723      .9957285  |
   8 |           x5      25.46739      25.77285     -.3054553     -.0483167      6.321939      .6996672  |
   9 |           x6      11.86957      12.34748     -.4779169     -.2245612      2.128225      .5220235  |
  10 |           x7      6.858696      6.764905      .0937905      .0279099      3.360478        1.1484  |
  11 |          x90      .0972024      .0379772      .0592253       .059065      1.002713        .88436  |
  12 |          x91     -.0890157      -.056921     -.0320946     -.0327892      .9788183      .9113454  |
  13 |          x92      .0453787      .0111821      .0341965      .0340355      1.004732      1.115678  |
  14 |          x93      .0865687       .066104      .0204647      .0211088      .9694889      .9136039  |
  15 |          x94     -.1299173     -.0574526     -.0724647     -.0721558       1.00428      .8189386  |
  16 |          x95     -.0807251     -.0931441       .012419      .0127921      .9708345      .8623481  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0021984804
  Mean absolute standardized diff.
  .070720454
  Maximum absolute standardized diff.
  .2486390074
  C.V. of matching weights:
  .4805835093
  S.D. of matching weights:
  .4805835093
  Skewness of matching weights:
  .0629289434
  Kurtosis of matching weights:
  .010802625
  Maximum matching weight:
  3.275096518

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00093921  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00042753  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00003686  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00002767  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00001518  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.684e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  3.117e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  1.306e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.977e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  7.501e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.838e-08  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  4.674e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.275e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  4.460e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  3.813e-11  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.676e-11  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  3.286e-13  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  9.610e-14  (not concave)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.203523
        1.x2 |  -1.648298
        1.x3 |  -.6889611
          x4 |  -.2537764
          x5 |   .0119766
          x6 |  -.0732706
          x7 |   -.016487
         x90 |   .0761476
         x91 |  -.1312031
         x92 |   .0695374
         x93 |  -.0139102
         x94 |  -.1188985
         x95 |  -.0241542
       _cons |   1.404818
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .757       .11      .216      .413      .521      .686      1.11      2.24      3.47      4.33
         |       408         1      .757       .11      .216      .413      .521      .686      1.11      2.24      3.47      4.33
         |       408      .395      .146       .08      .146      .246      .291      .351      .467      .638      .733      .774
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .514      .153      .226      .226      .331      .365      .511      .657      .704      .756      .756
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .683       .11      .222      .428      .562      .809         1      2.14      3.31      4.33
         |       500         1      .683       .11      .222      .428      .562      .809         1      2.14      3.31      4.33
         |       500      .416      .154       .08      .149      .252      .304      .372      .557      .658      .752      .774
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913       .481706     -.0143146     -.0286257      .5000621      1.005568  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0086891      .0021805      .0229515      .0950038      1.258816  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0172314      .0045077      .0338154      .1333047      1.266503  |
   7 |           x4      .4347826      .4922655     -.0574829     -.1149279       .500165      .9915903  |
   8 |           x5      25.46739      24.77346      .6939284      .1122576       6.18157      .7384288  |
   9 |           x6      11.86957      12.34392     -.4743546     -.2243554        2.1143      .5297315  |
  10 |           x7      6.858696      6.372816      .4858801      .1434997      3.385931      1.131086  |
  11 |          x90      .0972024      .0708831      .0263193       .025736      1.022666      .8433151  |
  12 |          x91     -.0890157     -.0850236     -.0039921     -.0041326      .9659871      .9406624  |
  13 |          x92      .0453787      .0288604      .0165183      .0164045      1.006938      1.109397  |
  14 |          x93      .0865687      .0246953      .0618733      .0640779      .9655958      .9231214  |
  15 |          x94     -.1299173     -.1327696      .0028523        .00286      .9973271      .8317584  |
  16 |          x95     -.0807251     -.0947339      .0140089      .0144874      .9669652      .8706165  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000242732
  Mean absolute standardized diff.
  .062163969
  Maximum absolute standardized diff.
  .2243554233
  C.V. of matching weights:
  .6832597515
  S.D. of matching weights:
  .6832597515
  Skewness of matching weights:
  .0830111672
  Kurtosis of matching weights:
  .0131708314
  Maximum matching weight:
  4.326992178

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

_cvopt:         1 .5 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =   .0255221  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00707055  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00121893  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00077435  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00038439  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00027065  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00020657  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00014905  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004814  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00002729  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00002254  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00001783  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001699  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.708e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  2.990e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  1.435e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.177e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  7.334e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.259e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.611e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.353e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  4.347e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  4.094e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  1.637e-07  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.536e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.465e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.080e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.045e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.045e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.040e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  9.998e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  9.894e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  9.891e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  9.891e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.8576316
        1.x2 |  -2.278638
        1.x3 |  -.4867771
          x4 |  -.1207335
          x5 |   .0125525
          x6 |  -.0391369
          x7 |   -.025396
         x90 |  -.0985809
         x91 |  -.1684552
         x92 |  -.1083939
         x93 |  -.1066118
         x94 |  -.0849797
         x95 |  -.1678559
       _cons |   3.357107
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .568     .0556      .133      .465      .622      .842      1.24      1.78      2.97      3.43
         |       408         1      .568     .0556      .133      .465      .622      .842      1.24      1.78      2.97      3.43
         |       408      .891     .0681      .377      .591      .835      .871      .902      .931      .951       .97      .974
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .919     .0469      .637      .637       .87        .9      .925      .952      .961      .979      .979
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .513     .0556      .141      .496       .68      .989      1.12      1.63      2.94      3.43
         |       500         1      .513     .0556      .141      .496       .68      .989      1.12      1.63      2.94      3.43
         |       500      .896     .0656      .377      .604      .843      .876      .906      .935      .954      .973      .979
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5896186     -.1222273     -.2464411      .4959695      1.037554  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0041996        .00667      .0906977      .0735407      2.592787  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0197748      .0019643      .0139702       .140607      1.106468  |
   7 |           x4      .4347826      .5050962     -.0703136     -.1405037      .5004392      .9914561  |
   8 |           x5      25.46739      25.59679     -.1293958     -.0210942      6.134192      .7501985  |
   9 |           x6      11.86957      12.63182     -.7622568     -.3495821       2.18048      .5006192  |
  10 |           x7      6.858696      6.396986      .4617095      .1362287      3.389223      1.127903  |
  11 |          x90      .0972024     -.1098519      .2070543      .2062767      1.003769      .8883868  |
  12 |          x91     -.0890157     -.1310079      .0419922       .043554        .96414      .9453563  |
  13 |          x92      .0453787     -.1269518      .1723304      .1702161      1.012422      1.100395  |
  14 |          x93      .0865687     -.0629131      .1494818      .1489091      1.003846      .8438625  |
  15 |          x94     -.1299173     -.0863392     -.0435781     -.0436613      .9980945      .8305237  |
  16 |          x95     -.0807251     -.2065973      .1258722      .1295847       .971351      .8638318  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001129394
  Mean absolute standardized diff.
  .1339015077
  Maximum absolute standardized diff.
  .3495820888
  C.V. of matching weights:
  .5129608212
  S.D. of matching weights:
  .5129608212
  Skewness of matching weights:
  .0730789382
  Kurtosis of matching weights:
  .0138593555
  Maximum matching weight:
  3.431757019

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00061301  
Iteration 1:   f(p) =  .00010314  
Iteration 2:   f(p) =  .00006546  
Iteration 3:   f(p) =  .00002385  
Iteration 4:   f(p) =  .00001692  
Iteration 5:   f(p) =  .00001277  
Iteration 6:   f(p) =  .00001168  
Iteration 7:   f(p) =  .00001092  
Iteration 8:   f(p) =  8.593e-06  
Iteration 9:   f(p) =  5.345e-06  
Iteration 10:  f(p) =  4.603e-06  
Iteration 11:  f(p) =  4.428e-06  
(switching technique to nr)
Iteration 12:  f(p) =  4.385e-06  (not concave)
Iteration 13:  f(p) =  3.515e-06  (not concave)
Iteration 14:  f(p) =  2.335e-06  (not concave)
Iteration 15:  f(p) =  1.556e-06  (not concave)
Iteration 16:  f(p) =  1.106e-06  (not concave)
Iteration 17:  f(p) =  9.822e-07  (not concave)
Iteration 18:  f(p) =  7.934e-07  (not concave)
Iteration 19:  f(p) =  4.382e-07  (not concave)
Iteration 20:  f(p) =  3.658e-07  (not concave)
Iteration 21:  f(p) =  3.500e-07  (not concave)
Iteration 22:  f(p) =  3.205e-07  (not concave)
Iteration 23:  f(p) =  2.830e-07  (not concave)
(switching technique to bfgs)
Iteration 24:  f(p) =  2.685e-07  
Iteration 25:  f(p) =  2.622e-07  
Iteration 26:  f(p) =  2.463e-07  
Iteration 27:  f(p) =  2.378e-07  
Iteration 28:  f(p) =  2.268e-07  
Iteration 29:  f(p) =  2.244e-07  
Iteration 30:  f(p) =  2.187e-07  
Iteration 31:  f(p) =  2.131e-07  
Iteration 32:  f(p) =  2.122e-07  
Iteration 33:  f(p) =  2.051e-07  
Iteration 34:  f(p) =  1.972e-07  
Iteration 35:  f(p) =  1.949e-07  
(switching technique to nr)
Iteration 36:  f(p) =  1.891e-07  
Iteration 37:  f(p) =  1.768e-07  
Iteration 38:  f(p) =  1.719e-07  
Iteration 39:  f(p) =  1.716e-07  
Iteration 40:  f(p) =  1.716e-07  
Iteration 41:  f(p) =  1.716e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.059191
        1.x2 |   -1.39265
        1.x3 |  -.3876982
          x4 |  -.2597607
          x5 |   .0455692
          x6 |  -.2089932
          x7 |   .0230333
         x90 |   .1272559
         x91 |  -.1212326
         x92 |   .0972184
         x93 |    .048144
         x94 |  -.1060477
         x95 |   .0105288
       _cons |   .6347725
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408      .171      .101       .02       .04     .0674     .0961      .141      .226      .332      .447      .554
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .265       .12     .0589     .0589       .13      .162       .26      .354       .41      .613      .613
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500      .189      .111       .02     .0421     .0698      .105      .158      .255      .363      .521      .613
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5187629     -.0513716     -.1026581       .500414      1.005638  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0118444     -.0009749     -.0090703      .1074807      .9264168  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0264242      -.004685     -.0296554       .157983      .8336934  |
   7 |           x4      .4347826      .4476614     -.0128788     -.0258872      .4974957      1.002336  |
   8 |           x5      25.46739      25.56132     -.0939325     -.0143612      6.540702      .6467529  |
   9 |           x6      11.86957      12.03336     -.1637988     -.0787938      2.078827      .5461046  |
  10 |           x7      6.858696      6.780637      .0780586      .0231963      3.365139      1.144355  |
  11 |          x90      .0972024      .0722594       .024943      .0245696      1.015196      .8581527  |
  12 |          x91     -.0890157     -.0683618     -.0206539     -.0213641      .9667548      .9389306  |
  13 |          x92      .0453787      .0233094      .0220692      .0220814      .9994496      1.130348  |
  14 |          x93      .0865687      .0787138      .0078548      .0082005      .9578498      .9405748  |
  15 |          x94     -.1299173     -.1086981     -.0212191      -.020847      1.017851      .7927288  |
  16 |          x95     -.0807251     -.0823446      .0016195      .0016799      .9640659      .8768563  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002940157
  Mean absolute standardized diff.
  .0294126804
  Maximum absolute standardized diff.
  .1026581439
  C.V. of matching weights:
  .7165196502
  S.D. of matching weights:
  .7165196502
  Skewness of matching weights:
  .0906557423
  Kurtosis of matching weights:
  .0171324352
  Maximum matching weight:
  5.44200661

. 
. // furthermore, you can target skiwness, kurtosis, or max weight
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance cvtarget(1 .5 6) skewtarget(1 0.07 2) 

_cvopt:         1 .5 6 1 .07 2
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .02922492  
Iteration 1:   f(p) =  .00522908  
Iteration 2:   f(p) =  .00462687  
Iteration 3:   f(p) =  .00015808  
Iteration 4:   f(p) =  .00007042  
Iteration 5:   f(p) =  .00005102  
Iteration 6:   f(p) =  .00004883  
Iteration 7:   f(p) =  .00004294  
Iteration 8:   f(p) =   .0000423  
Iteration 9:   f(p) =  .00003874  
Iteration 10:  f(p) =  .00003119  
Iteration 11:  f(p) =  .00001574  
(switching technique to nr)
Iteration 12:  f(p) =  .00001238  (not concave)
Iteration 13:  f(p) =  3.174e-06  (not concave)
Iteration 14:  f(p) =  9.061e-07  (not concave)
Iteration 15:  f(p) =  7.404e-07  (not concave)
Iteration 16:  f(p) =  6.567e-07  (not concave)
Iteration 17:  f(p) =  3.547e-07  (not concave)
Iteration 18:  f(p) =  2.813e-07  (not concave)
Iteration 19:  f(p) =  2.381e-07  (not concave)
Iteration 20:  f(p) =  2.217e-07  (not concave)
Iteration 21:  f(p) =  1.730e-07  (not concave)
Iteration 22:  f(p) =  1.666e-07  (not concave)
Iteration 23:  f(p) =  1.522e-07  (not concave)
(switching technique to bfgs)
Iteration 24:  f(p) =  1.440e-07  
Iteration 25:  f(p) =  1.387e-07  
Iteration 26:  f(p) =  1.252e-07  
Iteration 27:  f(p) =  1.179e-07  
Iteration 28:  f(p) =  1.137e-07  
Iteration 29:  f(p) =  1.095e-07  
Iteration 30:  f(p) =  1.088e-07  
Iteration 31:  f(p) =  1.088e-07  
Iteration 32:  f(p) =  1.088e-07  
Iteration 33:  f(p) =  1.087e-07  
Iteration 34:  f(p) =  1.085e-07  
Iteration 35:  f(p) =  1.070e-07  
(switching technique to nr)
Iteration 36:  f(p) =  1.069e-07  (not concave)
Iteration 37:  f(p) =  1.053e-07  (not concave)
Iteration 38:  f(p) =  1.050e-07  (not concave)
Iteration 39:  f(p) =  1.049e-07  (not concave)
Iteration 40:  f(p) =  1.036e-07  (not concave)
Iteration 41:  f(p) =  1.034e-07  (not concave)
Iteration 42:  f(p) =  1.022e-07  (not concave)
Iteration 43:  f(p) =  1.016e-07  (not concave)
Iteration 44:  f(p) =  1.013e-07  (not concave)
Iteration 45:  f(p) =  1.011e-07  (not concave)
Iteration 46:  f(p) =  1.010e-07  (not concave)
Iteration 47:  f(p) =  1.008e-07  (not concave)
(switching technique to bfgs)
Iteration 48:  f(p) =  1.007e-07  
Iteration 49:  f(p) =  1.005e-07  
Iteration 50:  f(p) =  9.850e-08  
Iteration 51:  f(p) =  9.648e-08  
Iteration 52:  f(p) =  9.399e-08  
Iteration 53:  f(p) =  9.331e-08  
Iteration 54:  f(p) =  9.117e-08  
Iteration 55:  f(p) =  9.013e-08  
Iteration 56:  f(p) =  8.897e-08  
Iteration 57:  f(p) =  8.782e-08  
Iteration 58:  f(p) =  8.646e-08  
Iteration 59:  f(p) =  8.397e-08  
(switching technique to nr)
Iteration 60:  f(p) =  8.393e-08  (not concave)
Iteration 61:  f(p) =  8.315e-08  (not concave)
Iteration 62:  f(p) =  8.309e-08  (not concave)
Iteration 63:  f(p) =  8.303e-08  
Iteration 64:  f(p) =  8.208e-08  (not concave)
Iteration 65:  f(p) =  8.147e-08  (not concave)
Iteration 66:  f(p) =  8.140e-08  (not concave)
Iteration 67:  f(p) =  8.127e-08  (not concave)
Iteration 68:  f(p) =  8.117e-08  (not concave)
Iteration 69:  f(p) =  8.106e-08  (not concave)
Iteration 70:  f(p) =  8.087e-08  (not concave)
Iteration 71:  f(p) =  7.787e-08  (not concave)
(switching technique to bfgs)
Iteration 72:  f(p) =  7.757e-08  
Iteration 73:  f(p) =  7.753e-08  
Iteration 74:  f(p) =  7.741e-08  
Iteration 75:  f(p) =  7.734e-08  
Iteration 76:  f(p) =  7.707e-08  
Iteration 77:  f(p) =  7.682e-08  
Iteration 78:  f(p) =  7.651e-08  
Iteration 79:  f(p) =  7.640e-08  
Iteration 80:  f(p) =  7.597e-08  
Iteration 81:  f(p) =  7.582e-08  
Iteration 82:  f(p) =  7.511e-08  
Iteration 83:  f(p) =  7.502e-08  
(switching technique to nr)
Iteration 84:  f(p) =  7.497e-08  (not concave)
Iteration 85:  f(p) =  7.487e-08  (not concave)
Iteration 86:  f(p) =  7.481e-08  (not concave)
Iteration 87:  f(p) =  7.478e-08  (not concave)
Iteration 88:  f(p) =  7.474e-08  (not concave)
Iteration 89:  f(p) =  7.469e-08  (not concave)
Iteration 90:  f(p) =  7.467e-08  (not concave)
Iteration 91:  f(p) =  7.465e-08  (not concave)
Iteration 92:  f(p) =  7.463e-08  (not concave)
Iteration 93:  f(p) =  7.459e-08  (not concave)
Iteration 94:  f(p) =  7.432e-08  (not concave)
Iteration 95:  f(p) =  7.403e-08  (not concave)
(switching technique to bfgs)
Iteration 96:  f(p) =  7.399e-08  
Iteration 97:  f(p) =  7.397e-08  
Iteration 98:  f(p) =  7.377e-08  
Iteration 99:  f(p) =  7.345e-08  
Iteration 100: f(p) =  7.345e-08  
Iteration 101: f(p) =  7.329e-08  
Iteration 102: f(p) =  7.325e-08  
Iteration 103: f(p) =  7.314e-08  
Iteration 104: f(p) =  7.296e-08  
Iteration 105: f(p) =  7.287e-08  
Iteration 106: f(p) =  7.253e-08  
Iteration 107: f(p) =  6.986e-08  
(switching technique to nr)
Iteration 108: f(p) =  6.805e-08  (not concave)
Iteration 109: f(p) =  6.797e-08  (not concave)
Iteration 110: f(p) =  6.793e-08  (not concave)
Iteration 111: f(p) =  6.790e-08  (not concave)
Iteration 112: f(p) =  6.787e-08  (not concave)
Iteration 113: f(p) =  6.782e-08  (not concave)
Iteration 114: f(p) =  6.780e-08  (not concave)
Iteration 115: f(p) =  6.778e-08  (not concave)
Iteration 116: f(p) =  6.776e-08  (not concave)
Iteration 117: f(p) =  6.773e-08  (not concave)
Iteration 118: f(p) =  6.772e-08  (not concave)
Iteration 119: f(p) =  6.769e-08  (not concave)
(switching technique to bfgs)
Iteration 120: f(p) =  6.767e-08  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6) + 1*abs(wgt_skewness()-.07)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |   -.896892
        1.x2 |   -1.17166
        1.x3 |  -.2434965
          x4 |  -.2822814
          x5 |   .0296602
          x6 |  -.0988635
          x7 |  -.0155226
         x90 |   .0211781
         x91 |  -.0635786
         x92 |   .0130214
         x93 |   .0101829
         x94 |  -.0496173
         x95 |    -.04044
       _cons |  -.3598387
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .533      .148      .353      .514      .622      .828      1.23      1.78      2.65      3.14
         |       408         1      .533      .148      .353      .514      .622      .828      1.23      1.78      2.65      3.14
         |       408      .148     .0634     .0262     .0601     .0851      .101       .13      .182      .244      .325      .363
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .204     .0756     .0806     .0806      .112      .142      .187      .275      .306      .388      .388
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .482      .148      .357      .527      .667      .943      1.07       1.7      2.63      3.14
         |       500         1      .482      .148      .357      .527      .667      .943      1.07       1.7      2.63      3.14
         |       500      .159     .0692     .0262     .0608     .0869      .105      .139        .2       .27      .344      .388
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5799962     -.1126049     -.2265824       .496971      1.030602  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0134646      -.002595     -.0228976      .1133319      .8162827  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0298002     -.0080611     -.0485483       .166043      .7418166  |
   7 |           x4      .4347826      .4432475     -.0084649     -.0170291      .4970856      1.004292  |
   8 |           x5      25.46739      25.98506     -.5176697     -.0824484      6.278707      .7114258  |
   9 |           x6      11.86957      12.48572     -.6161517     -.2867463       2.14877      .5137132  |
  10 |           x7      6.858696      6.452799      .4058965      .1202648      3.375024      1.138954  |
  11 |          x90      .0972024     -.0198819      .1170843      .1162558      1.007126       .876696  |
  12 |          x91     -.0890157     -.0347233     -.0542924     -.0555225      .9778445      .9138647  |
  13 |          x92      .0453787     -.0155798      .0609585      .0606974      1.004301      1.117405  |
  14 |          x93      .0865687      .0516382      .0349305      .0358845      .9734151      .9048988  |
  15 |          x94     -.1299173     -.0478311     -.0820862     -.0814259      1.008109      .8118093  |
  16 |          x95     -.0807251     -.1045611       .023836      .0245714      .9700719      .8640346  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .001271343
  Mean absolute standardized diff.
  .0906826404
  Maximum absolute standardized diff.
  .2867462522
  C.V. of matching weights:
  .4815882971
  S.D. of matching weights:
  .4815882971
  Skewness of matching weights:
  .0699975309
  Kurtosis of matching weights:
  .0117243612
  Maximum matching weight:
  3.144443541

. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar', atet cbps treatvariance maxtarget(1 10 2) difficult nonrtolerance

_cvopt:         0 0 2 0 0 2 0 0 2 1 10 2
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =    .505579  
Iteration 1:   f(p) =  .06009401  (backed up)
Iteration 2:   f(p) =  .00002045  
Iteration 3:   f(p) =  2.925e-06  (backed up)
Iteration 4:   f(p) =  2.883e-06  
Iteration 5:   f(p) =  2.834e-06  
Iteration 6:   f(p) =  2.802e-06  
Iteration 7:   f(p) =  2.553e-06  
Iteration 8:   f(p) =  2.495e-06  
Iteration 9:   f(p) =  2.391e-06  
Iteration 10:  f(p) =  2.361e-06  
Iteration 11:  f(p) =  2.178e-06  
(switching technique to nr)
Iteration 12:  f(p) =  2.141e-06  (not concave)
Iteration 13:  f(p) =  1.920e-06  (not concave)
Iteration 14:  f(p) =  1.557e-06  (not concave)
Iteration 15:  f(p) =  1.333e-06  (not concave)
Iteration 16:  f(p) =  1.238e-06  (not concave)
Iteration 17:  f(p) =  1.230e-06  (not concave)
Iteration 18:  f(p) =  1.230e-06  (not concave)
Iteration 19:  f(p) =  1.110e-06  (not concave)
Iteration 20:  f(p) =  1.085e-06  (not concave)
Iteration 21:  f(p) =  9.754e-07  (not concave)
Iteration 22:  f(p) =  9.288e-07  (not concave)
Iteration 23:  f(p) =  8.634e-07  (not concave)
(switching technique to bfgs)
Iteration 24:  f(p) =  8.263e-07  
Iteration 25:  f(p) =  8.263e-07  
Iteration 26:  f(p) =  8.262e-07  
Iteration 27:  f(p) =  8.259e-07  
Iteration 28:  f(p) =  7.582e-07  
Iteration 29:  f(p) =  7.138e-07  
Iteration 30:  f(p) =  6.919e-07  
Iteration 31:  f(p) =  6.904e-07  
Iteration 32:  f(p) =  6.669e-07  
Iteration 33:  f(p) =  6.344e-07  
Iteration 34:  f(p) =  5.887e-07  
Iteration 35:  f(p) =  5.774e-07  
(switching technique to nr)
Iteration 36:  f(p) =  5.551e-07  (not concave)
Iteration 37:  f(p) =  5.527e-07  (not concave)
Iteration 38:  f(p) =  5.510e-07  (not concave)
Iteration 39:  f(p) =  5.190e-07  (not concave)
Iteration 40:  f(p) =  5.045e-07  (not concave)
Iteration 41:  f(p) =  4.656e-07  (not concave)
Iteration 42:  f(p) =  4.470e-07  (not concave)
Iteration 43:  f(p) =  4.461e-07  (not concave)
Iteration 44:  f(p) =  4.200e-07  (not concave)
Iteration 45:  f(p) =  3.973e-07  (not concave)
Iteration 46:  f(p) =  3.951e-07  (not concave)
Iteration 47:  f(p) =  3.935e-07  (not concave)
(switching technique to bfgs)
Iteration 48:  f(p) =  3.933e-07  
Iteration 49:  f(p) =  3.925e-07  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 50:  f(p) =  3.915e-07  
Iteration 51:  f(p) =  3.900e-07  (backed up)
Iteration 52:  f(p) =  3.860e-07  
Iteration 53:  f(p) =  3.560e-07  
Iteration 54:  f(p) =  3.559e-07  
Iteration 55:  f(p) =  3.416e-07  
Iteration 56:  f(p) =  3.106e-07  
Iteration 57:  f(p) =  2.957e-07  
Iteration 58:  f(p) =  2.110e-07  
Iteration 59:  f(p) =  2.103e-07  
(switching technique to nr)
Iteration 60:  f(p) =  1.886e-07  (not concave)
Iteration 61:  f(p) =  1.825e-07  (not concave)
Iteration 62:  f(p) =  1.820e-07  (not concave)
Iteration 63:  f(p) =  1.776e-07  (not concave)
Iteration 64:  f(p) =  1.759e-07  (not concave)
Iteration 65:  f(p) =  1.659e-07  (not concave)
Iteration 66:  f(p) =  1.592e-07  (not concave)
Iteration 67:  f(p) =  1.566e-07  (not concave)
Iteration 68:  f(p) =  1.563e-07  (not concave)
Iteration 69:  f(p) =  1.562e-07  (not concave)
Iteration 70:  f(p) =  1.562e-07  (not concave)
Iteration 71:  f(p) =  1.561e-07  (not concave)
(switching technique to bfgs)
Iteration 72:  f(p) =  1.560e-07  
Iteration 73:  f(p) =  1.560e-07  
Iteration 74:  f(p) =  1.560e-07  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 75:  f(p) =  1.479e-07  
Iteration 76:  f(p) =  1.478e-07  (backed up)
Iteration 77:  f(p) =  1.453e-07  
Iteration 78:  f(p) =  1.232e-07  
Iteration 79:  f(p) =  1.051e-07  
Iteration 80:  f(p) =  9.878e-08  
Iteration 81:  f(p) =  8.959e-08  
Iteration 82:  f(p) =  8.927e-08  
Iteration 83:  f(p) =  8.219e-08  
(switching technique to nr)
Iteration 84:  f(p) =  7.467e-08  (not concave)
Iteration 85:  f(p) =  7.313e-08  (not concave)
Iteration 86:  f(p) =  7.302e-08  (not concave)
Iteration 87:  f(p) =  6.286e-08  (not concave)
Iteration 88:  f(p) =  6.268e-08  (not concave)
Iteration 89:  f(p) =  6.267e-08  (not concave)
Iteration 90:  f(p) =  6.267e-08  (not concave)
Iteration 91:  f(p) =  5.789e-08  (not concave)
Iteration 92:  f(p) =  5.558e-08  (not concave)
Iteration 93:  f(p) =  5.376e-08  (not concave)
Iteration 94:  f(p) =  5.324e-08  (not concave)
Iteration 95:  f(p) =  5.216e-08  (not concave)
(switching technique to bfgs)
Iteration 96:  f(p) =  4.807e-08  
Iteration 97:  f(p) =  4.804e-08  (backed up)
Iteration 98:  f(p) =  4.789e-08  
Iteration 99:  f(p) =  4.550e-08  
Iteration 100: f(p) =  4.452e-08  
Iteration 101: f(p) =  4.425e-08  
Iteration 102: f(p) =  4.047e-08  
Iteration 103: f(p) =  3.971e-08  
Iteration 104: f(p) =  3.851e-08  
Iteration 105: f(p) =  3.649e-08  
Iteration 106: f(p) =  3.324e-08  
Iteration 107: f(p) =  3.199e-08  
(switching technique to nr)
Iteration 108: f(p) =  2.853e-08  (not concave)
Iteration 109: f(p) =  2.847e-08  (not concave)
Iteration 110: f(p) =  2.629e-08  (not concave)
Iteration 111: f(p) =  2.545e-08  (not concave)
Iteration 112: f(p) =  2.454e-08  (not concave)
Iteration 113: f(p) =  2.413e-08  (not concave)
Iteration 114: f(p) =  2.407e-08  (not concave)
Iteration 115: f(p) =  2.203e-08  (not concave)
Iteration 116: f(p) =  2.102e-08  (not concave)
Iteration 117: f(p) =  2.102e-08  (not concave)
Iteration 118: f(p) =  1.937e-08  (not concave)
Iteration 119: f(p) =  1.918e-08  (not concave)
(switching technique to bfgs)
Iteration 120: f(p) =  1.903e-08  
convergence not achieved
  Warning: convergence not achieved.

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.201459
        1.x2 |  -1.633223
        1.x3 |  -.5773298
          x4 |  -.3030191
          x5 |   .0639027
          x6 |  -.2995716
          x7 |   .0334024
         x90 |   .1358075
         x91 |   -.133452
         x92 |   .1096526
         x93 |    .023246
         x94 |  -.1441088
         x95 |   .0281319
       _cons |   1.366463
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.05      .047     .0974      .213      .331       .64      1.22      2.34      4.46        10
         |       408         1      1.05      .047     .0974      .213      .331       .64      1.22      2.34      4.46        10
         |       408      .176      .127     .0118     .0241     .0513     .0775       .14      .237      .373      .531      .717
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .29      .149     .0461     .0461      .125      .161      .271      .399      .459      .764      .764
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .951      .047      .106      .227      .409      .848      1.06      2.05      4.45        10
         |       500         1      .951      .047      .106      .227      .409      .848      1.06      2.05      4.45        10
         |       500      .197      .138     .0118     .0262     .0541     .0933       .16      .274      .408      .606      .764
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4875666     -.0201753     -.0403312      .5002397      1.004843  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0098049      .0010647      .0106895      .0996022      1.116822  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0221163     -.0003772     -.0025663      .1469832      .9916928  |
   7 |           x4      .4347826      .4288653      .0059173      .0119405      .4955651      1.011833  |
   8 |           x5      25.46739      25.69586     -.2284713     -.0333419      6.852368      .5818691  |
   9 |           x6      11.86957      11.68846      .1811021      .0885639      2.044875      .5668641  |
  10 |           x7      6.858696      6.841041      .0176551      .0052519       3.36167      1.147213  |
  11 |          x90      .0972024      .0525899      .0446125      .0434765       1.02613       .836752  |
  12 |          x91     -.0890157     -.0587132     -.0303025     -.0317813      .9534672      .9711027  |
  13 |          x92      .0453787      .0138085      .0315702      .0318772      .9903697       1.15667  |
  14 |          x93      .0865687      .0635128      .0230558      .0241517      .9546251      .9483789  |
  15 |          x94     -.1299173      -.161137      .0312198      .0299948      1.040841      .7523316  |
  16 |          x95     -.0807251     -.0800286     -.0006965     -.0007295      .9546596       .897706  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001113764
  Mean absolute standardized diff.
  .0272843301
  Maximum absolute standardized diff.
  .0885639076
  C.V. of matching weights:
  .9510022604
  S.D. of matching weights:
  .9510022604
  Skewness of matching weights:
  .1449799238
  Kurtosis of matching weights:
  .0432058914
  Maximum matching weight:
  9.999994785
. }

. 
. // * WEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00008909  
Iteration 1:   f(p) =  .00006006  
Iteration 2:   f(p) =  .00005798  
Iteration 3:   f(p) =  .00005798  
Iteration 4:   f(p) =  .00005797  
Iteration 5:   f(p) =  .00005722  
Iteration 6:   f(p) =  .00004799  
Iteration 7:   f(p) =  .00002164  
Iteration 8:   f(p) =  .00001682  
Iteration 9:   f(p) =  .00001603  
Iteration 10:  f(p) =  .00001599  
Iteration 11:  f(p) =  .00001599  
(switching technique to nr)
Iteration 12:  f(p) =  .00001598  (not concave)
Iteration 13:  f(p) =  9.601e-06  (not concave)
Iteration 14:  f(p) =  3.449e-06  
Iteration 15:  f(p) =  5.937e-07  
Iteration 16:  f(p) =  1.904e-07  
Iteration 17:  f(p) =  1.468e-07  (not concave)
Iteration 18:  f(p) =  1.206e-07  (not concave)
Iteration 19:  f(p) =  8.898e-08  (not concave)
Iteration 20:  f(p) =  2.012e-08  (not concave)
Iteration 21:  f(p) =  4.956e-09  
Iteration 22:  f(p) =  8.632e-11  
Iteration 23:  f(p) =  7.250e-14  
(switching technique to bfgs)
Iteration 24:  f(p) =  1.987e-23  
Iteration 25:  f(p) =  1.596e-26  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.502416
        1.x2 |  -2.525399
        1.x3 |  -.8191009
          x4 |  -.3236397
          x5 |   .0771198
          x6 |  -.4884764
          x7 |   .0722686
         x90 |   .0234165
         x91 |   .0257849
         x92 |   .2152141
         x93 |  -.0285372
         x94 |  -.3393877
         x95 |  -.0407881
       _cons |   3.075437
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .957      .762      .953      1.26      1.49       1.8      2.11       2.8      5.77        13
         |       408      .999      .435       .78      .784      .792      .809      .864      .985      1.32      2.65      6.64
         |       408       .16      .168     .0019    .00635     .0172      .037     .0987      .209      .409      .707      .883
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.63      .415      .415      .642      .808      1.35       2.6      3.88      9.17      9.17
         |        92      1.02      .828      .188      .188      .318      .405      .739      1.47      1.96      5.21      5.21
         |        92      .288      .192     .0336     .0336     .0892      .119      .237      .431       .55      .931      .931
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.11      .415      .548      1.06      1.41      1.78      2.17      2.99      6.49        13
         |       500         1      .528      .188      .273      .782      .799      .859      1.05      1.49       2.9      6.64
         |       500      .183       .18     .0019    .00715       .02     .0472      .117      .263      .446      .717      .931
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6695182      .6695182     -5.48e-13     -1.17e-12      .4706262      1.004328  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0220668      .0220668     -4.95e-14     -3.37e-13      .1469756      1.004328  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0366911      .0366911     -9.94e-14     -5.28e-13       .188098      1.004328  |
   7 |           x4       .485133       .485133      1.24e-13      2.48e-13      .5000334      1.004328  |
   8 |           x5      26.17889      26.17889      5.68e-13      9.11e-14      6.237853      .6789026  |
   9 |           x6      12.63449      12.63449     -4.48e-12     -1.92e-12      2.338005      .5740656  |
  10 |           x7      6.755243      6.755243      1.85e-12      5.48e-13      3.370937      1.187219  |
  11 |          x90     -.0520316     -.0520316     -2.67e-13     -2.55e-13      1.046128      1.163666  |
  12 |          x91      .0164856      .0164856      4.43e-15      4.56e-15      .9705717      .9930954  |
  13 |          x92     -.0021645     -.0021645      2.22e-13      2.18e-13      1.017927      1.359802  |
  14 |          x93      .0456916      .0456916     -3.93e-13     -4.08e-13      .9636159       .883731  |
  15 |          x94     -.0910006     -.0910006     -9.72e-13     -9.59e-13      1.014116      .7859289  |
  16 |          x95     -.0894588     -.0894588      2.22e-13      2.27e-13       .978942      .8236876  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.05915e-25
  Mean absolute standardized diff.
  5.31055e-13
  Maximum absolute standardized diff.
  1.91539e-12
  C.V. of matching weights:
  .5270998694
  S.D. of matching weights:
  .5284997369
  Skewness of matching weights:
  .2026515012
  Kurtosis of matching weights:
  .0762370775
  Maximum matching weight:
  6.642263865

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .02296546  
Iteration 1:   f(p) =  .01893921  
Iteration 2:   f(p) =  .01888779  
Iteration 3:   f(p) =  .01864993  
Iteration 4:   f(p) =  .01807794  
Iteration 5:   f(p) =  .01796175  
Iteration 6:   f(p) =  .01796123  
Iteration 7:   f(p) =   .0179521  
Iteration 8:   f(p) =  .01782591  
Iteration 9:   f(p) =  .01781762  
Iteration 10:  f(p) =  .01781752  
Iteration 11:  f(p) =  .01781614  
(switching technique to nr)
Iteration 12:  f(p) =  .01780413  
Iteration 13:  f(p) =  .01777185  
Iteration 14:  f(p) =  .01777184  
Iteration 15:  f(p) =  .01777184  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.226645
        1.x2 |  -1.653762
        1.x3 |  -.7776876
          x4 |  -.3532491
          x5 |   .0574629
          x6 |  -.2583005
          x7 |   .0080439
         x90 |   .0890276
         x91 |  -.1706881
         x92 |   .1765097
         x93 |   .1136718
         x94 |  -.1271347
         x95 |   .0214704
       _cons |   1.180155
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .569      .882      1.05      1.37      1.58       1.9      2.22      2.65      3.75      5.18
         |       408      .999      .194      .816      .827      .851      .879      .934      1.05      1.23      1.66      2.64
         |       408       .17      .119     .0115     .0244     .0519     .0816      .136      .228      .345      .513      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.26      .471      .471       .86      1.14      1.52      2.69      3.33      7.65      7.65
         |        92      1.02      .639      .297      .297      .465      .547      .791      1.35      1.75      4.34      4.34
         |        92      .278      .144      .048      .048      .119      .154      .264      .381      .448      .702      .702
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      .744      .471       .68      1.21      1.51      1.87      2.25      2.77      4.93      7.65
         |       500         1      .324      .297      .426      .821      .864      .931      1.07      1.35      2.08      4.34
         |       500       .19      .131     .0115     .0257     .0544     .0922      .151      .268      .394      .595      .702
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6415953      .6970127     -.0554173     -.1194311      .4640107      1.093567  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0142909      .0234703     -.0091794     -.0628462      .1460619      .6172753  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0334441      .0380925     -.0046484     -.0245369      .1894462      .8860314  |
   7 |           x4      .4881571      .4821182      .0060389      .0120785       .499973       1.00505  |
   8 |           x5      25.72258      26.31855     -.5959644     -.1000426      5.957105      .7659019  |
   9 |           x6      12.33189       12.8994     -.5675068     -.2533225      2.240254      .6135511  |
  10 |           x7      6.911084      6.688832       .222252      .0657612      3.379685      1.211887  |
  11 |          x90     -.0440388     -.0251309      -.018908     -.0185767       1.01783      1.120774  |
  12 |          x91      .0661735     -.0257224      .0918959      .0936219      .9815644      .9753854  |
  13 |          x92     -.0382008     -.0020298     -.0361709     -.0355957      1.016161       1.20721  |
  14 |          x93      .0014101      .0645199     -.0631098     -.0653399      .9658703      .9125525  |
  15 |          x94     -.1442668     -.0285682     -.1156986     -.1166712      .9916637      .8216037  |
  16 |          x95     -.1053626       -.07164     -.0337226     -.0344811      .9780038       .803947  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0025726925
  Mean absolute standardized diff.
  .0771004085
  Maximum absolute standardized diff.
  .2533225092
  C.V. of matching weights:
  .3236892353
  S.D. of matching weights:
  .3244154086
  Skewness of matching weights:
  .1499732962
  Kurtosis of matching weights:
  .0569705847
  Maximum matching weight:
  4.343313229

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
(switching technique to nr)
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  6.172e-07  
Iteration 14:  f(p) =  2.892e-07  
Iteration 15:  f(p) =  5.356e-08  
Iteration 16:  f(p) =  8.139e-10  
Iteration 17:  f(p) =  8.812e-13  
Iteration 18:  f(p) =  1.377e-20  
Iteration 19:  f(p) =  1.051e-26  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447047
        1.x2 |  -1.546891
        1.x3 |  -.4710623
          x4 |  -.3822539
          x5 |   .0635824
          x6 |   -.243227
          x7 |   .0477027
         x90 |   .1334992
         x91 |  -.1336117
         x92 |   .1522937
         x93 |   .0757732
         x94 |  -.1016171
         x95 |  -.0383391
       _cons |   .6265763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512231     -9.76e-13     -1.96e-12      .4978686      1.004328  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0114039      2.24e-13      2.11e-12      .1062323      1.004328  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0240637      1.66e-14      1.08e-13      .1533251      1.004328  |
   7 |           x4      .4218861      .4218861     -6.23e-13     -1.26e-12       .494112      1.004328  |
   8 |           x5      25.44699      25.44699     -3.22e-12     -4.83e-13      6.665558      .6144662  |
   9 |           x6      11.84757      11.84757     -5.03e-12     -2.46e-12      2.042375      .5982513  |
  10 |           x7      7.015422      7.015422     -6.31e-13     -1.89e-13      3.345323      1.161761  |
  11 |          x90      .0839738      .0839738      3.95e-13      3.85e-13        1.0258      .8505325  |
  12 |          x91     -.0648837     -.0648837     -2.28e-13     -2.42e-13       .941106      .9922891  |
  13 |          x92      .0575388      .0575388      1.13e-12      1.14e-12      .9892732      1.118263  |
  14 |          x93      .1016523      .1016523     -5.35e-13     -5.68e-13      .9410813      1.012572  |
  15 |          x94     -.1252265     -.1252265     -5.33e-14     -5.20e-14      1.026859      .7576623  |
  16 |          x95     -.1044649     -.1044649     -7.43e-13     -7.72e-13      .9627688      .8646431  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.06888e-25
  Mean absolute standardized diff.
  9.02547e-13
  Maximum absolute standardized diff.
  2.46487e-12
  C.V. of matching weights:
  .9311531747
  S.D. of matching weights:
  .9276065877
  Skewness of matching weights:
  .1133761595
  Kurtosis of matching weights:
  .0229016822
  Maximum matching weight:
  7.007741998

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps ipw pooledvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00053487  
Iteration 1:   f(p) =  .00021848  
Iteration 2:   f(p) =  .00021162  
Iteration 3:   f(p) =  .00021159  
Iteration 4:   f(p) =  .00021001  
Iteration 5:   f(p) =  .00019724  
Iteration 6:   f(p) =   .0001771  
Iteration 7:   f(p) =  .00017502  
Iteration 8:   f(p) =  .00017501  
Iteration 9:   f(p) =  .00017499  
Iteration 10:  f(p) =  .00017464  
Iteration 11:  f(p) =   .0001725  
(switching technique to nr)
Iteration 12:  f(p) =  .00017245  
Iteration 13:  f(p) =  .00017215  
Iteration 14:  f(p) =  .00017215  
Iteration 15:  f(p) =  .00017215  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.393749
        1.x2 |  -1.561041
        1.x3 |  -.4600041
          x4 |  -.3846168
          x5 |   .0606092
          x6 |  -.2482012
          x7 |   .0443349
         x90 |   .1306488
         x91 |  -.1205474
         x92 |   .1453092
         x93 |    .070476
         x94 |  -.1075638
         x95 |  -.0307916
       _cons |   .7598453
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.12     .0834      .213      .379      .703       1.2      2.44       4.6      9.79      16.6
         |       408      .995      1.01     .0445      .124      .212      .364      .618      1.22      2.32      4.57      7.11
         |       408      .161      .119    .00985     .0269     .0454     .0753      .121      .214      .341      .506      .614
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .153     .0459     .0459     .0999      .133      .243      .375      .464      .695      .695
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.92     .0834      .215      .425      .799      1.47      2.33       4.1       9.5      16.6
         |       500      .996      .916     .0445      .124      .228      .404       .82      1.04      2.07      4.54      7.11
         |       500      .181      .133    .00985     .0269     .0484     .0819      .137      .247       .39      .596      .695
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4553292      -.004106      -.008242       .498186      1.002774  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0111962      .0002076      .0019689      .1054487      1.022737  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0242798     -.0002161     -.0014043      .1538723      .9956099  |
   7 |           x4      .4218861      .4235251      -.001639     -.0033156       .494322      1.003286  |
   8 |           x5      25.44699      25.39436      .0526224      .0078927      6.667188      .6141311  |
   9 |           x6      11.84757      11.82507      .0224988      .0110125      2.043017      .5978372  |
  10 |           x7      7.015422      6.978162        .03726       .011128      3.348319      1.159171  |
  11 |          x90      .0839738      .0816058       .002368      .0023047      1.027479      .8472278  |
  12 |          x91     -.0648837     -.0554765     -.0094072     -.0099831      .9423132      .9892043  |
  13 |          x92      .0575388      .0526517      .0048871      .0049455      .9881782      1.121369  |
  14 |          x93      .1016523        .09771      .0039424      .0041911      .9406607      1.013686  |
  15 |          x94     -.1252265      -.131327      .0061006      .0059387       1.02725      .7569926  |
  16 |          x95     -.1044649     -.1015494     -.0029155     -.0030291      .9625009      .8652191  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  3.24223e-06
  Mean absolute standardized diff.
  .0057966356
  Maximum absolute standardized diff.
  .0111279635
  C.V. of matching weights:
  .9194965222
  S.D. of matching weights:
  .9158852844
  Skewness of matching weights:
  .1127627417
  Kurtosis of matching weights:
  .0230489168
  Maximum matching weight:
  7.10958804

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00026309  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00001126  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  4.733e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.762e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.968e-21  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298301
        1.x2 |   -1.62991
        1.x3 |  -.4511738
          x4 |  -.3553036
          x5 |     .07158
          x6 |  -.2773324
          x7 |   .0371349
         x90 |   .1283826
         x91 |  -.0952385
         x92 |   .1409152
         x93 |   .0743039
         x94 |  -.1419192
         x95 |  -.0201501
       _cons |   1.248956
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.18     .0766      .195      .376      .696      1.22      2.44      4.57      9.98      20.7
         |       408      .998      1.06     .0408      .117      .208       .36       .63      1.18      2.31      4.35      10.6
         |       408       .22      .145     .0139     .0389     .0671      .111      .179      .289      .444      .601      .786
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .351      .168      .068      .068      .152      .203      .322      .485      .552       .79       .79
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.98     .0766      .203      .418      .776       1.5      2.35      4.17      9.35      20.7
         |       500      .998      .961     .0408      .117      .226      .402      .852      1.07      1.96      4.35      10.6
         |       500      .244      .158     .0139      .039     .0719      .119      .203      .332      .494      .685       .79
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231       .487981     -.0367579     -.0735301      .4999024      .9953452  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0101189      .0012849      .0126869      .1012806      1.130392  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0243904     -.0003267     -.0021194      .1541516       .991207  |
   7 |           x4      .4218861      .4077073      .0141788      .0288106      .4921399      1.014377  |
   8 |           x5      25.44699      25.93854     -.4915548     -.0719755      6.829476      .5820455  |
   9 |           x6      11.84757      11.77832      .0692519      .0336233      2.059639      .5870658  |
  10 |           x7      7.015422      6.877177      .1382443      .0411586      3.358822      1.150412  |
  11 |          x90      .0839738      .0558962      .0280776      .0273707      1.025826      .8505932  |
  12 |          x91     -.0648837     -.0314162     -.0334675     -.0355197       .942223      .9896463  |
  13 |          x92      .0575388      .0508005      .0067383      .0068466      .9841768      1.132825  |
  14 |          x93      .1016523      .1109109     -.0092586     -.0098717         .9379      1.021042  |
  15 |          x94     -.1252265     -.1752569      .0500305       .047919      1.044064      .7291541  |
  16 |          x95     -.1044649      -.104167     -.0002979     -.0003101      .9607217      .8690485  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.53257e-07
  Mean absolute standardized diff.
  .0301340147
  Maximum absolute standardized diff.
  .0735301424
  C.V. of matching weights:
  .963205406
  S.D. of matching weights:
  .9612474781
  Skewness of matching weights:
  .1583249612
  Kurtosis of matching weights:
  .0508875835
  Maximum matching weight:
  10.57744042

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet sd_sq treatvariance difficult nonrtolerance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .01944489  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01784035  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01032757  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00864463  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00309574  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00232235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00091852  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00071553  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00032888  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013226  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00006152  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00004718  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002689  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00002341  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002148  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001985  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  .00001702  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  .00001157  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  9.655e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  9.538e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  8.649e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  8.585e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.605e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  7.400e-06  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  7.393e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  7.332e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  6.805e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  6.140e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  6.071e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  6.062e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  6.062e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  6.062e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  6.062e-06  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = sum(stddiff()^2)------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.445996
        1.x2 |  -1.569794
        1.x3 |  -.4604848
          x4 |  -.3850051
          x5 |   .0632866
          x6 |  -.2429001
          x7 |   .0477265
         x90 |    .133165
         x91 |  -.1334475
         x92 |   .1518036
         x93 |   .0756112
         x94 |  -.1015596
         x95 |  -.0394676
       _cons |   1.417187
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0788      .209      .374      .695      1.17      2.45      4.64      9.71      16.8
         |       408      .995      1.03      .042      .118      .207       .36      .611      1.21       2.3      4.75      6.98
         |       408      .276      .166     .0203     .0548     .0927      .151      .231      .374      .531      .701      .775
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .427      .189     .0967     .0967       .19      .243      .413      .573      .669      .831      .831
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0788      .209      .419      .782      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .927      .042       .12      .228      .399       .81      1.05      2.05      4.72      6.98
         |       500      .304       .18     .0203     .0556      .101      .164      .254       .42      .586      .764      .831
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231       .451336     -.0001128     -.0002266      .4978776      1.004283  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0112022      .0002017      .0019124      .1054711      1.022203  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0241994     -.0001357     -.0008831       .153669       .998835  |
   7 |           x4      .4218861      .4216376      .0002485      .0005029      .4940799      1.004488  |
   8 |           x5      25.44699      25.44256      .0044289      .0006646      6.663466      .6149052  |
   9 |           x6      11.84757      11.84794     -.0003675       -.00018      2.042286      .5983104  |
  10 |           x7      7.015422      7.015606     -.0001846     -.0000552      3.345452      1.161648  |
  11 |          x90      .0839738      .0839428      .0000311      .0000303      1.025853      .8504276  |
  12 |          x91     -.0648837     -.0650271      .0001434      .0001524       .941188      .9920778  |
  13 |          x92      .0575388      .0573697      .0001691      .0001709       .989224      1.118402  |
  14 |          x93      .1016523       .101601      .0000513      .0000545       .941146      1.012402  |
  15 |          x94     -.1252265     -.1251953     -.0000311     -.0000303      1.026771      .7578147  |
  16 |          x95     -.1044649     -.1051763      .0007113      .0007387      .9628901      .8643833  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  4.81195e-08
  Mean absolute standardized diff.
  .0004309211
  Maximum absolute standardized diff.
  .0019123984
  C.V. of matching weights:
  .9307527947
  S.D. of matching weights:
  .9271889681
  Skewness of matching weights:
  .1131989308
  Kurtosis of matching weights:
  .0228176955
  Maximum matching weight:
  6.978606991

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.444e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -373.2561   49.21885    -7.58   0.000    -469.7233   -276.7889
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3424.879   30.82585   111.10   0.000     3364.462    3485.297
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3424.8791

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752    .0041102      1.338962   1.000571
                  |
               x2 |
               1  |  -.1180374    .0011686      .4133173   1.011157
                  |
               x3 |
               1  |  -.1253201   -.0169419      .5085817   .8975379
                  |
               x4 |  -.1207472    .0136004      .9914484   1.003798
               x5 |  -.1944638     .003179      .8589874   .5855492
               x6 |  -.6542694    .0947099      .4958356   .5643304
               x7 |   .0473848    .0177567      1.160037   1.134687
              x90 |   .1499304    .0348222      .9289414    .817157
              x91 |  -.0833726   -.0675073      .8791918     .96061
              x92 |   .0662245   -.0005441      1.090179   1.148892
              x93 |   .0479737    -.020065      .8926169   .9606022
              x94 |  -.1521926    .0315996      .8686432   .7548902
              x95 |  -.0155155    .0398234      .8285405   .8815991
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4574808     -.0062577     -.0125569      .4983432      1.002016  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0104612      .0009427      .0091856       .102624      1.093786  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0241722     -.0001085     -.0007062         .1536      .9999323  |
   7 |           x4      .4218861      .4314162     -.0095301     -.0192417      .4952809      .9986039  |
   8 |           x5      25.44699      25.25275      .1942356      .0287189      6.763337      .5945665  |
   9 |           x6      11.84757      11.67955      .1680205      .0822363      2.043144      .5984287  |
  10 |           x7      7.015422      6.824197      .1912245      .0569439       3.35812      1.151353  |
  11 |          x90      .0839738      .0777469      .0062269      .0060092      1.036221      .8303562  |
  12 |          x91     -.0648837      -.033852     -.0310317      -.032945      .9419239       .990382  |
  13 |          x92      .0575388      .0480591      .0094797      .0096248      .9849204      1.130693  |
  14 |          x93      .1016523      .1032412     -.0015889      -.001701      .9340722      1.031343  |
  15 |          x94     -.1252265     -.1745685      .0493421      .0476679      1.035122      .7439065  |
  16 |          x95     -.1044649     -.1114622      .0069973      .0072928      .9594697      .8717687  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. gmatchcall reweight()

. gmatchcall balanceresults()
  Unmatched data
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4653368      .0020545      .0041146      .4993249      1.009059  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0108696      .0107485      .0001211      .0011718      .1033261      1.019734  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0217391      .0242844     -.0025453     -.0166769      .1526231      .9051513  |
   7 |           x4      .4347826      .4280333      .0067493      .0136219      .4954712      1.012313  |
   8 |           x5      25.46739      25.44732      .0200675      .0029485      6.806091      .5905162  |
   9 |           x6      11.86957      11.69122      .1783475      .0873876       2.04088      .5691173  |
  10 |           x7      6.858696      6.797654      .0610413      .0181384      3.365302      1.144312  |
  11 |          x90      .0972024      .0623017      .0349007      .0337983      1.032616      .8240885  |
  12 |          x91     -.0890157     -.0249321     -.0640836     -.0671278      .9546514      .9687584  |
  13 |          x92      .0453787      .0459298     -.0005512     -.0005569      .9896794      1.158638  |
  14 |          x93      .0865687      .1054548     -.0188862     -.0199583      .9462793      .9687505  |
  15 |          x94     -.1299173     -.1613151      .0313979      .0303219      1.035483      .7612936  |
  16 |          x95     -.0807251     -.1181964      .0374713      .0390906      .9585753      .8890772  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000943494
  Mean absolute standardized diff.
  .0257625916
  Maximum absolute standardized diff.
  .0873875756
  C.V. of matching weights:
  0
  S.D. of matching weights:
  0
  Skewness of matching weights:
  .
  Kurtosis of matching weights:
  .
  Maximum matching weight:
  1

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw averagevariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4574808     -.0062577     -.0125569      .4983432      1.002016  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0104612      .0009427      .0091856       .102624      1.093786  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0241722     -.0001085     -.0007062         .1536      .9999323  |
   7 |           x4      .4218861      .4314162     -.0095301     -.0192417      .4952809      .9986039  |
   8 |           x5      25.44699      25.25275      .1942356      .0287189      6.763337      .5945665  |
   9 |           x6      11.84757      11.67955      .1680205      .0822363      2.043144      .5984287  |
  10 |           x7      7.015422      6.824197      .1912245      .0569439       3.35812      1.151353  |
  11 |          x90      .0839738      .0777469      .0062269      .0060092      1.036221      .8303562  |
  12 |          x91     -.0648837      -.033852     -.0310317      -.032945      .9419239       .990382  |
  13 |          x92      .0575388      .0480591      .0094797      .0096248      .9849204      1.130693  |
  14 |          x93      .1016523      .1032412     -.0015889      -.001701      .9340722      1.031343  |
  15 |          x94     -.1252265     -.1745685      .0493421      .0476679      1.035122      .7439065  |
  16 |          x95     -.1044649     -.1114622      .0069973      .0072928      .9594697      .8717687  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944
  Maximum matching weight:
  9.036805568

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], ate aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  2.423e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |  -332.1348   56.53175    -5.88   0.000     -442.935   -221.3346
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3453.029    20.1341   171.50   0.000     3413.567    3492.491
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .572      .862      1.06      1.36      1.59       1.9      2.23      2.72      3.72      5.29
         |       408      .999      .196      .823      .836      .852      .877      .929      1.03      1.26      1.65      2.49
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.31      .475      .475      .807      1.08      1.51      2.47      3.54      8.32      8.32
         |        92      1.02      .684      .274      .274      .443      .535      .795       1.4      1.78      4.73      4.73
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .76      .475      .645      1.19      1.51      1.87      2.26      2.83      4.93      8.32
         |       500         1      .341      .274      .398      .832      .866      .925      1.06      1.39      2.29      4.73
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6613089      .6933653     -.0320564     -.0691239      .4637537      1.058036  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0128589      .0239773     -.0111184     -.0758638      .1465574      .5447519  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0265737      .0393435     -.0127698     -.0676144      .1888625      .6873677  |
   7 |           x4      .4958234      .4853442      .0104792      .0209545      .5000924      1.005121  |
   8 |           x5      25.79221      26.26742     -.4752185     -.0797142      5.961531      .7434191  |
   9 |           x6      12.37135      12.88246     -.5111083     -.2278712       2.24297      .6063944  |
  10 |           x7      6.760858      6.737452       .023406       .006941      3.372117      1.194134  |
  11 |          x90     -.1082151      -.017539     -.0906761     -.0889061      1.019909      1.121318  |
  12 |          x91       .033412     -.0122333      .0456452      .0466881      .9776621      .9566022  |
  13 |          x92      .0165767     -.0117433        .02832      .0278871      1.015524      1.209921  |
  14 |          x93      .0109477      .0569505     -.0460028     -.0475772      .9669081      .9220023  |
  15 |          x94     -.1467208     -.0286143     -.1181065     -.1193869      .9892758      .8106047  |
  16 |          x95     -.0857581     -.0773517     -.0084064     -.0085769      .9801209      .7990227  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0027535352
  Mean absolute standardized diff.
  .0682388595
  Maximum absolute standardized diff.
  .2278711742
  C.V. of matching weights:
  .3403902484
  S.D. of matching weights:
  .3414490721
  Skewness of matching weights:
  .1624622214
  Kurtosis of matching weights:
  .0662787313
  Maximum matching weight:
  4.725180198

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.908e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |   321.4309   62.35166     5.16   0.000     199.2239    443.6379
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3138.003   59.50596    52.73   0.000     3021.374    3254.633
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.299227   .2371935     5.48   0.000     .8343367    1.764118
                        |
                     x2 |
                     1  |   1.630014    .746001     2.19   0.029     .1678787    3.092149
                        |
                     x3 |
                     1  |   .4513753   .5770312     0.78   0.434    -.6795851    1.582336
                     x4 |   .3551911    .204881     1.73   0.083    -.0463684    .7567506
                     x5 |   -.058452   .0195046    -3.00   0.003    -.0966803   -.0202237
                     x6 |   .2821622    .049775     5.67   0.000      .184605    .3797195
                     x7 |  -.0332008   .0279849    -1.19   0.235    -.0880501    .0216486
                    x90 |  -.1276778   .0907109    -1.41   0.159     -.305468    .0501124
                    x91 |   .0961159   .0916737     1.05   0.294    -.0835612     .275793
                    x92 |  -.1400043   .0976573    -1.43   0.152    -.3314091    .0514004
                    x93 |  -.0734557   .0916967    -0.80   0.423     -.253178    .1062665
                    x94 |   .1435742   .0862727     1.66   0.096    -.0255172    .3126656
                    x95 |   .0212452   .0898768     0.24   0.813    -.1549102    .1974006
                  _cons |   -1.24872   .6712769    -1.86   0.063    -2.564399    .0669587
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ateu ipw treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .398      .881      1.17      1.44      1.68      1.96      2.23      2.48      2.83      3.24
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.62      .218      .218      .607      .827      1.32      2.63      3.86      9.94      9.94
         |        92      1.03      .852     .0953     .0953      .305      .421      .745       1.5      1.98      5.65      5.65
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .78      .218      .418      1.22       1.6      1.94      2.27      2.59      4.66      9.94
         |       500         1      .364     .0953       .25      .813         1         1         1         1      2.54      5.65
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
(switching technique to nr)
Iteration 12:  f(p) =  7.515e-07  
Iteration 13:  f(p) =  6.172e-07  
Iteration 14:  f(p) =  2.892e-07  
Iteration 15:  f(p) =  5.356e-08  
Iteration 16:  f(p) =  8.139e-10  
Iteration 17:  f(p) =  8.812e-13  
Iteration 18:  f(p) =  1.377e-20  
Iteration 19:  f(p) =  1.051e-26  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447047
        1.x2 |  -1.546891
        1.x3 |  -.4710623
          x4 |  -.3822539
          x5 |   .0635824
          x6 |   -.243227
          x7 |   .0477027
         x90 |   .1334992
         x91 |  -.1336117
         x92 |   .1522937
         x93 |   .0757732
         x94 |  -.1016171
         x95 |  -.0383391
       _cons |   .6265763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512231     -9.76e-13     -1.96e-12      .4978686      1.004328  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0114039      2.24e-13      2.11e-12      .1062323      1.004328  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0240637      1.66e-14      1.08e-13      .1533251      1.004328  |
   7 |           x4      .4218861      .4218861     -6.23e-13     -1.26e-12       .494112      1.004328  |
   8 |           x5      25.44699      25.44699     -3.22e-12     -4.83e-13      6.665558      .6144662  |
   9 |           x6      11.84757      11.84757     -5.03e-12     -2.46e-12      2.042375      .5982513  |
  10 |           x7      7.015422      7.015422     -6.31e-13     -1.89e-13      3.345323      1.161761  |
  11 |          x90      .0839738      .0839738      3.95e-13      3.85e-13        1.0258      .8505325  |
  12 |          x91     -.0648837     -.0648837     -2.28e-13     -2.42e-13       .941106      .9922891  |
  13 |          x92      .0575388      .0575388      1.13e-12      1.14e-12      .9892732      1.118263  |
  14 |          x93      .1016523      .1016523     -5.35e-13     -5.68e-13      .9410813      1.012572  |
  15 |          x94     -.1252265     -.1252265     -5.33e-14     -5.20e-14      1.026859      .7576623  |
  16 |          x95     -.1044649     -.1044649     -7.43e-13     -7.72e-13      .9627688      .8646431  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.06888e-25
  Mean absolute standardized diff.
  9.02547e-13
  Maximum absolute standardized diff.
  2.46487e-12
  C.V. of matching weights:
  .9311531747
  S.D. of matching weights:
  .9276065877
  Skewness of matching weights:
  .1133761595
  Kurtosis of matching weights:
  .0229016822
  Maximum matching weight:
  7.007741998

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .75 6)

_cvopt:         1 .75 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00093832  
Iteration 1:   f(p) =  .00004631  
Iteration 2:   f(p) =  .00003859  
Iteration 3:   f(p) =  .00003858  
Iteration 4:   f(p) =  .00003858  
Iteration 5:   f(p) =  .00003857  
Iteration 6:   f(p) =  .00003712  
Iteration 7:   f(p) =  .00001543  
Iteration 8:   f(p) =  .00001516  
Iteration 9:   f(p) =  .00001516  
Iteration 10:  f(p) =  .00001516  
Iteration 11:  f(p) =  .00001516  
(switching technique to nr)
Iteration 12:  f(p) =  .00001496  
Iteration 13:  f(p) =  .00001252  
Iteration 14:  f(p) =  .00001246  
Iteration 15:  f(p) =  .00001246  
Iteration 16:  f(p) =  .00001246  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.254173
        1.x2 |  -1.322938
        1.x3 |   -.373805
          x4 |  -.3150603
          x5 |   .0538657
          x6 |  -.2073493
          x7 |   .0392239
         x90 |   .1112138
         x91 |  -.1096074
         x92 |   .1251076
         x93 |   .0659586
         x94 |  -.0938176
         x95 |  -.0291266
       _cons |   .4368751
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.81      .136      .285      .497       .83      1.32      2.51      4.37       8.5      13.5
         |       408      .996      .864     .0724       .17      .273      .438       .68      1.24      2.21      3.95      5.51
         |       408      .172      .109     .0168     .0384     .0605     .0937      .138      .226      .342      .482      .565
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .275      .138      .063      .063      .116      .147      .252      .373      .453      .641      .641
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.65      .136      .289      .555      .918      1.55      2.36      3.96      8.34      13.5
         |       500      .997       .78     .0724      .171      .297      .476      .864      1.06      1.98      3.95      5.51
         |       500      .191      .122     .0168     .0388     .0653        .1      .152      .255      .382      .553      .641
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4880538     -.0368307     -.0736754      .4999046      .9953382  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0133715     -.0019676     -.0173545      .1133776      .8582497  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637       .026706     -.0026423     -.0165274      .1598748      .9074156  |
   7 |           x4      .4218861      .4355817     -.0136956     -.0276258      .4957525      .9963536  |
   8 |           x5      25.44699      25.52568      -.078699     -.0119986      6.558992      .6374798  |
   9 |           x6      11.84757       12.0082     -.1606278     -.0774785      2.073192      .5789038  |
  10 |           x7      7.015422      6.963125      .0522971      .0156099       3.35025      1.157516  |
  11 |          x90      .0839738      .0663511      .0176227      .0172584      1.021105       .859923  |
  12 |          x91     -.0648837      -.055222     -.0096617     -.0101782      .9492542      .9716605  |
  13 |          x92      .0575388      .0443227       .013216      .0133238      .9919126       1.11088  |
  14 |          x93      .1016523      .0920485      .0096038      .0101307      .9479945      .9946043  |
  15 |          x94     -.1252265     -.1096348     -.0155917     -.0152968      1.019276      .7709592  |
  16 |          x95     -.1044649     -.0986888     -.0057762     -.0059728      .9670821       .855481  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002361785
  Mean absolute standardized diff.
  .0240331441
  Maximum absolute standardized diff.
  .0774784863
  C.V. of matching weights:
  .7824749002
  S.D. of matching weights:
  .7798928714
  Skewness of matching weights:
  .0961006757
  Kurtosis of matching weights:
  .0177245882
  Maximum matching weight:
  5.513183751

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvtarget(1 .50 6)

_cvopt:         1 .5 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82179  
Iteration 2:   f(p) = -411.28725  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .03149775  
Iteration 1:   f(p) =  .00028651  
Iteration 2:   f(p) =  .00020393  
Iteration 3:   f(p) =  .00019258  
Iteration 4:   f(p) =  .00019213  
Iteration 5:   f(p) =  .00019201  
Iteration 6:   f(p) =  .00019201  
Iteration 7:   f(p) =  .00019103  
Iteration 8:   f(p) =  .00015742  
Iteration 9:   f(p) =  .00012551  
Iteration 10:  f(p) =  .00012396  
Iteration 11:  f(p) =  .00012368  
(switching technique to nr)
Iteration 12:  f(p) =  .00012357  
Iteration 13:  f(p) =  .00008847  
Iteration 14:  f(p) =  .00007975  
Iteration 15:  f(p) =  .00007967  
Iteration 16:  f(p) =  .00007967  
Iteration 17:  f(p) =  .00007967  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.9697342
        1.x2 |  -1.009949
        1.x3 |  -.2681222
          x4 |  -.2328712
          x5 |   .0401949
          x6 |  -.1592826
          x7 |   .0284833
         x90 |   .0826321
         x91 |  -.0793651
         x92 |   .0918044
         x93 |   .0506806
         x94 |  -.0790892
         x95 |  -.0177969
       _cons |    .143247
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.38      .271      .445      .706      1.03      1.54      2.49      3.85      6.84      9.73
         |       408      .997      .647      .144      .273      .397      .566      .778      1.24         2      3.05      3.88
         |       408      .186     .0903     .0345     .0633     .0893      .123      .161      .235      .331       .43       .49
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .27      .107     .0905     .0905      .143      .171      .257      .348      .405      .555      .555
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.26      .271      .449      .762      1.16      1.68      2.38      3.55      6.55      9.73
         |       500      .997      .584      .144      .275      .418      .597      .937      1.08      1.82      3.03      3.88
         |       500      .202      .099     .0345     .0637     .0933      .127      .174      .264      .355       .48      .555
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .5455567     -.0943336      -.188873       .499455      1.003097  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0163287     -.0049248     -.0399416      .1233011      .7049278  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637       .030259     -.0061953     -.0368251      .1682369      .8038013  |
   7 |           x4      .4218861      .4518913     -.0300052     -.0603277      .4973707      .9889709  |
   8 |           x5      25.44699      25.68608     -.2390904     -.0373547      6.400539      .6743964  |
   9 |           x6      11.84757      12.24705     -.3994838     -.1887496      2.116475      .5553462  |
  10 |           x7      7.015422      6.896035      .1193864      .0355894      3.354552      1.154006  |
  11 |          x90      .0839738      .0421678       .041806      .0412412      1.013694      .8752328  |
  12 |          x91     -.0648837     -.0430186     -.0218651     -.0227801      .9598338      .9459252  |
  13 |          x92      .0575388      .0282798      .0292589      .0293969      .9953057      1.101598  |
  14 |          x93      .1016523      .0789385      .0227138      .0237327      .9570688      .9718368  |
  15 |          x94     -.1252265     -.0859452     -.0392812     -.0389158      1.009389       .788992  |
  16 |          x95     -.1044649     -.0909645     -.0135004      -.013886       .972231      .8447606  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .001465673
  Mean absolute standardized diff.
  .0582779889
  Maximum absolute standardized diff.
  .1888729871
  C.V. of matching weights:
  .5854551691
  S.D. of matching weights:
  .5839538857
  Skewness of matching weights:
  .0751394741
  Kurtosis of matching weights:
  .0127294635
  Maximum matching weight:
  3.88354215

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .75 6) difficult nonrtolerance

_cvopt:         1 .75 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00118407  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00047827  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00006974  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00004509  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.893e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.962e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  1.695e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  6.547e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  2.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.307e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.558e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  7.610e-08  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  6.398e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  2.236e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  1.796e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  1.364e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.276e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  9.084e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  5.549e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.143e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  3.836e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  3.371e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.528e-13  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  3.621e-14  (not concave)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.250887
        1.x2 |  -1.626125
        1.x3 |  -.4801982
          x4 |  -.2620611
          x5 |    .001825
          x6 |  -.0353994
          x7 |  -.0159779
         x90 |   .0167523
         x91 |  -.1024366
         x92 |   .1101285
         x93 |   -.084209
         x94 |  -.0973872
         x95 |  -.0309724
       _cons |   1.256772
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       1.6      .203      .463      .804      .989      1.32      2.14      4.57      7.32      11.6
         |       408      .995      .752      .107       .28      .438      .529      .665      1.01      2.28      3.45      4.18
         |       408      .406      .144     .0816      .189      .267      .306      .356      .456      .655      .742      .777
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .516      .155      .234      .234      .326      .363      .542      .659      .726      .758      .758
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.46      .203      .477      .857      1.04      1.48      2.23      3.95      7.28      11.6
         |       500      .996      .679      .107      .284       .46      .557      .768         1      2.16      3.42      4.18
         |       500      .426      .152     .0816      .191      .275      .313       .37      .574      .666      .751      .777
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4687289     -.0175058     -.0350772      .4990637      .9986764  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0096578       .001746      .0175585       .099441      1.183809  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0211063      .0029574      .0203109      .1456074      1.141595  |
   7 |           x4      .4218861      .5022246     -.0803385     -.1606454      .5000981      .9798346  |
   8 |           x5      25.44699      24.55462      .8923685      .1468865      6.075225      .7638797  |
   9 |           x6      11.84757      12.40719     -.5596197     -.2622338      2.134049      .5481983  |
  10 |           x7      7.015422        6.4268      .5886214      .1746098      3.371067      1.146153  |
  11 |          x90      .0839738      .0144905      .0694833      .0674373      1.030339      .8423287  |
  12 |          x91     -.0648837     -.0638269     -.0010568     -.0011102      .9518936      .9651005  |
  13 |          x92      .0575388      .0771211     -.0195823     -.0195593      1.001176      1.085495  |
  14 |          x93      .1016523     -.0429273      .1445797      .1494642        .96732      .9507708  |
  15 |          x94     -.1252265     -.1238912     -.0013353     -.0013443      .9932829      .8192923  |
  16 |          x95     -.1044649     -.0760594     -.0284055     -.0293563      .9676111      .8544931  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .000026515
  Mean absolute standardized diff.
  .08350721
  Maximum absolute standardized diff.
  .2622337606
  C.V. of matching weights:
  .681672797
  S.D. of matching weights:
  .6788132595
  Skewness of matching weights:
  .0819061038
  Kurtosis of matching weights:
  .0123408686
  Maximum matching weight:
  4.175475731

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvtarget(1 .50 6) difficult nonrtolerance

_cvopt:         1 .5 6
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .03174366  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01880683  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01499079  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00460016  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00088681  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00069868  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00016284  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00008031  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004972  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003906  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003723  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00002755  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001175  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000104  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  4.104e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  2.518e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  8.956e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  6.250e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.018e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.226e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  3.482e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  3.352e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  3.207e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  2.038e-07  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.920e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.812e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.778e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.767e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.767e-07  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.9279058
        1.x2 |  -2.022835
        1.x3 |  -.5459885
          x4 |  -.2018929
          x5 |   .0110196
          x6 |   -.026346
          x7 |  -.0220848
         x90 |  -.0596402
         x91 |  -.1240135
         x92 |  -.1052485
         x93 |  -.0886826
         x94 |  -.1176456
         x95 |  -.1554268
       _cons |   1.248262
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.24      .142      .315       .82      1.16      1.65      2.34      3.63      6.43       8.6
         |       408      .998      .573     .0757      .169       .46      .611      .847      1.22       1.8      2.86      3.76
         |       408      .543      .127     .0957      .191      .391       .46      .542       .63      .715        .8       .84
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .621      .125      .259      .259      .471      .533      .608      .732      .773      .859      .859
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.13      .142      .334      .872      1.22      1.77      2.31      3.45      6.42       8.6
         |       500      .998      .518     .0757      .186      .498      .672      .946       1.1      1.68      2.84      3.76
         |       500      .558       .13     .0957      .206      .401      .475      .551       .65      .741       .82      .859
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .5725056     -.1212824     -.2436759      .4977203      1.016138  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0057765      .0056274      .0683984      .0822735      1.971509  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0181921      .0058716      .0426906      .1375382      1.320535  |
   7 |           x4      .4218861      .4938066     -.0719205      -.143876      .4998787      .9799656  |
   8 |           x5      25.44699      25.47069     -.0237034     -.0038777      6.112738      .7501178  |
   9 |           x6      11.84757       12.6362     -.7886248     -.3608243       2.18562      .5251165  |
  10 |           x7      7.015422      6.461128      .5542937      .1628873      3.402928      1.118612  |
  11 |          x90      .0839738     -.0655233      .1494971      .1468554      1.017989      .8695271  |
  12 |          x91     -.0648837     -.0950948      .0302111      .0317312      .9520949      .9647812  |
  13 |          x92      .0575388     -.1252753       .182814      .1817862      1.005654      1.080092  |
  14 |          x93      .1016523     -.0340662      .1357185      .1375851      .9864333      .9063256  |
  15 |          x94     -.1252265     -.1411385      .0159121      .0159806      .9957118      .8146098  |
  16 |          x95     -.1044649     -.1955261      .0910612       .093305       .975952      .8383981  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000984155
  Mean absolute standardized diff.
  .125651829
  Maximum absolute standardized diff.
  .3608243097
  C.V. of matching weights:
  .5189538034
  S.D. of matching weights:
  .5179396558
  Skewness of matching weights:
  .0763844765
  Kurtosis of matching weights:
  .0142419673
  Maximum matching weight:
  3.764088498

. 
. // you can also target skiwness, kurtosis, or max weight, but it's finicky
. 
. capture nois {
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance maxtarget(1 10 2) difficult nonrtolerance

_cvopt:         0 0 2 0 0 2 0 0 2 1 10 2
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =   .9280066  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .08139982  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01131328  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00131793  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00061114  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00059138  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =   .0002708  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00023009  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00007024  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003343  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  6.729e-06  
Iteration 11:  f(p) =  2.710e-08  
(switching technique to nr)
Iteration 12:  f(p) =  2.158e-09  (not concave)
Iteration 13:  f(p) =  6.919e-11  (not concave)
Iteration 14:  f(p) =  4.758e-11  (not concave)
Iteration 15:  f(p) =  2.360e-11  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.414e-11  (not concave)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.318242
        1.x2 |  -1.638631
        1.x3 |  -.4671188
          x4 |  -.3829299
          x5 |   .0796813
          x6 |  -.2472382
          x7 |   .0533055
         x90 |    .064786
         x91 |  -.1421824
         x92 |   .0748236
         x93 |   .0108831
         x94 |  -.1743697
         x95 |  -.0598686
       _cons |   1.249574
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       2.1     .0713      .237      .426      .707      1.23      2.45      4.29      10.3      19.6
         |       408         1      1.04      .038      .123      .229      .364      .649      1.26      2.02       4.7        10
         |       408      .338      .174      .025     .0766      .134      .197      .305      .459      .577       .76      .871
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .488      .184      .176      .176      .254      .324      .451      .656      .723      .878      .878
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.91     .0713      .239      .457      .837      1.51      2.33       3.8      10.3      19.6
         |       500         1      .942      .038      .123      .246      .426      .878      1.06      1.83      4.66        10
         |       500      .366      .185      .025     .0768      .142      .221       .33      .488      .656      .788      .878
----------------------------------------------------------------------------------------------------------------------------------
. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .5158916     -.0646685     -.1292753      .5002384       .995776  |
   3 |        0b.x2             0             0             0             .             0             .  |
   4 |         1.x2      .0114039      .0096025      .0018014      .0181558      .0992178      1.190566  |
   5 |        0b.x3             0             0             0             .             0             .  |
   6 |         1.x3      .0240637      .0230889      .0009748      .0064627      .1508292      1.045684  |
   7 |           x4      .4218861      .3874426      .0344435      .0704609      .4888312       1.03212  |
   8 |           x5      25.44699      26.55348     -1.106499     -.1634966      6.767717      .5963185  |
   9 |           x6      11.84757      11.95541      -.107837     -.0520785      2.070662       .580179  |
  10 |           x7      7.015422      7.109388     -.0939666     -.0279465      3.362369      1.147167  |
  11 |          x90      .0839738     -.0185541       .102528      .1007758      1.017387      .8689754  |
  12 |          x91     -.0648837     -.0749367       .010053      .0107216      .9376439      1.001295  |
  13 |          x92      .0575388     -.0089721      .0665109      .0676598      .9830188      1.137143  |
  14 |          x93      .1016523      .0554875      .0461648      .0483227      .9553446      .9764302  |
  15 |          x94     -.1252265     -.2080072      .0827807      .0792217      1.044925      .7282627  |
  16 |          x95     -.1044649     -.1152361      .0107712       .011132      .9675898      .8544254  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  9.52249e-06
  Mean absolute standardized diff.
  .060439231
  Maximum absolute standardized diff.
  .16349664
  C.V. of matching weights:
  .9421025348
  S.D. of matching weights:
  .9417264627
  Skewness of matching weights:
  .1565328046
  Kurtosis of matching weights:
  .04710133
  Maximum matching weight:
  9.9999978
. }

. 
. log close gmatch_example_ado
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 closed on:  22 Feb 2018, 13:01:19
----------------------------------------------------------------------------------------------------------------------------------------------------------------
