----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 opened on:  14 Feb 2018, 01:24:05

. 
. //****************************************************************************/
. *! $Id: gmatch_example.do,v e38398bcb0ac 2018/02/14 08:16:27 kkranker $
. *! Generalization of IPW and CBPS estimators
. *! Example files
. //
. *! By Keith Kranker
. // Last updated $Date: 2018/02/14 08:16:27 $
. //
. // Copyright (C) Mathematica Policy Research, Inc.
. // This code cannot be copied, distributed or used without the express written
. // permission of Mathematica Policy Research, Inc.
. //*****************************************************************************/
. 
. di as txt "Current user: `c(username)'" _n "Environment: `c(os)' `c(machine_type)' `: environment computername'" _n "Stata: `c(stata_version)'" cond(c(stata_v
> ersion)==c(version),""," (set to version `c(version)')") _n "Date: " c(current_date) " " c(current_time)
Current user: KKranker
Environment: Windows PC (64-bit x86-64) KKRANKER
Stata: 15.1
Date: 14 Feb 2018 01:24:05

. desc, short

Contains data from C:\Users\kkranker\Documents\Stata\Multiple-Equation-Models\simple_cattaneo_data.dta
  obs:         4,642                          Cattaneo (2010) study on the effect of maternal smoking on birth weight
 vars:            20                          8 Apr 2015 05:07
 size:       357,434                          
Sorted by: 
     Note: Dataset has changed since last saved.

. summ `treatvar' `varlist' `tousevar' `wgtvar' `depvars'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       treat |      4,642    .1861267    .3892508          0          1
          x1 |      4,642    .6996984    .4584385          0          1
        1.x2 |      4,642    .0340371    .1813439          0          1
        1.x3 |      4,642    .0534252    .2249042          0          1
          x4 |      4,642    .4379578    .4961893          0          1
-------------+---------------------------------------------------------
          x5 |      4,642    26.50452    5.619026         13         45
          x6 |      4,642    12.68957    2.520661          0         17
          x7 |      4,642    6.540069    3.359167          1         12
         x90 |      4,642   -.0031039    1.020177  -4.107368   3.325766
         x91 |      4,642   -.0212069    1.008708   -4.16458   3.503644
-------------+---------------------------------------------------------
         x92 |      4,642    .0076449    1.004589  -3.449011   3.959166
         x93 |      4,642    .0049339    1.004513  -4.274254   3.777972
         x94 |      4,642    .0124264    .9818583  -3.659006   3.658309
         x95 |      4,642    .0044283    1.010194   -3.41615   3.724456
       touse |      4,642    .1077122      .31005          0          1
-------------+---------------------------------------------------------
         wgt |      4,642    1.993316    .4062602   .6638338   3.540576
          y1 |      4,642     3361.68    578.8196        340       5500
   y1_binary |      4,642    .9396812    .2381022          0          1

. 
. 
. // * UNWEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. cbps `treatvar' `varlist' if `tousevar' , ate logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00451406  
Iteration 2:   f(p) =   .0005336  
Iteration 3:   f(p) =  .00001373  
Iteration 4:   f(p) =  2.637e-08  
Iteration 5:   f(p) =  6.777e-13  
Iteration 6:   f(p) =  1.066e-21  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.441064   .5046768    -2.86   0.004    -2.430213   -.4519161
        1.x2 |  -2.548784   3.501511    -0.73   0.467     -9.41162    4.314051
        1.x3 |   -1.02318   2.005094    -0.51   0.610    -4.953091    2.906732
          x4 |  -.2320966   .5678014    -0.41   0.683    -1.344967    .8807737
          x5 |   .0736983    .042799     1.72   0.085    -.0101862    .1575829
          x6 |  -.4863391   .1923869    -2.53   0.011    -.8634106   -.1092676
          x7 |   .0655415   .0720901     0.91   0.363    -.0757525    .2068354
         x90 |   .0303861    .203675     0.15   0.881    -.3688096    .4295819
         x91 |  -.0236437   .2499136    -0.09   0.925    -.5134655     .466178
         x92 |   .2014652   .2092517     0.96   0.336    -.2086606    .6115911
         x93 |  -.0067202   .2511949    -0.03   0.979    -.4990531    .4856126
         x94 |  -.3662317   .2431817    -1.51   0.132     -.842859    .1103956
         x95 |  -.0080118   .2531324    -0.03   0.975    -.5041423    .4881187
       _cons |   3.127763   1.826429     1.71   0.087    -.4519713    6.707497
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps pooledvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  2.590e-08  
Iteration 1:   f(p) =  2.548e-08  (backed up)
Iteration 2:   f(p) =  1.980e-08  
Iteration 3:   f(p) =  1.652e-08  
Iteration 4:   f(p) =  1.627e-08  
Iteration 5:   f(p) =  1.540e-08  
Iteration 6:   f(p) =  1.451e-08  
Iteration 7:   f(p) =  1.377e-08  
Iteration 8:   f(p) =  1.290e-08  
Iteration 9:   f(p) =  1.195e-08  
Iteration 10:  f(p) =  1.168e-08  
Iteration 11:  f(p) =  1.075e-08  
(switching technique to nr)
Iteration 12:  f(p) =  1.026e-08  
Iteration 13:  f(p) =  7.037e-09  
Iteration 14:  f(p) =  2.042e-10  
Iteration 15:  f(p) =  1.083e-12  
Iteration 16:  f(p) =  4.352e-17  
Iteration 17:  f(p) =  3.960e-25  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441064
        1.x2 |  -2.548784
        1.x3 |   -1.02318
          x4 |  -.2320966
          x5 |   .0736983
          x6 |  -.4863391
          x7 |   .0655415
         x90 |   .0303861
         x91 |  -.0236437
         x92 |   .2014652
         x93 |  -.0067202
         x94 |  -.3662317
         x95 |  -.0080118
       _cons |   3.127763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408      .161      .168    .00228    .00588     .0177     .0388      .102      .214        .4      .697      .887
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92      .289      .189     .0343     .0343     .0927      .126      .242      .423      .526      .928      .928
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500      .185      .179    .00228    .00648     .0207     .0485       .12      .268      .461      .712      .928
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6750468      .6750468      1.72e-11      3.66e-11      .4688264      1.008511  |
   3 |        i1.x2      .0219357      .0219357      1.15e-11      7.84e-11      .1466203      1.008511  |
   4 |        i1.x3      .0370067      .0370067      2.40e-10      1.27e-09      .1889672      1.008511  |
   5 |           x4      .4861037      .4861037      5.20e-11      1.04e-10      .5003074      1.008511  |
   6 |           x5      26.25386      26.25386      2.87e-11      4.57e-12      6.268993      .6747771  |
   7 |           x6      12.63471      12.63471      4.25e-10      1.81e-10      2.343236      .5637225  |
   8 |           x7      6.724952      6.724952     -2.27e-10     -6.75e-11      3.360602      1.190087  |
   9 |          x90     -.0592246     -.0592246      6.94e-11      6.65e-11      1.042785      1.206644  |
  10 |          x91      .0116973      .0116973     -1.60e-10     -1.63e-10      .9810721      .9436962  |
  11 |          x92     -.0041245     -.0041245     -4.41e-11     -4.33e-11      1.020036      1.339887  |
  12 |          x93      .0443809      .0443809      3.13e-11      3.24e-11      .9681889      .8469644  |
  13 |          x94     -.0856689     -.0856689     -1.31e-11     -1.29e-11      1.015864      .7767335  |
  14 |          x95     -.0859154     -.0859154     -5.96e-12     -6.11e-12      .9766877      .8347645  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.29325e-20
  Mean absolute standardized diff.
  1.58820e-10
  Maximum absolute standardized diff.
  1.26794e-09
  C.V. of matching weights:
  .5275374066
  S.D. of matching weights:
  .5275374066
  Skewness of matching weights:
  .2158747756
  Kurtosis of matching weights:
  .0860729366

. 
. cbps `treatvar' `varlist' if `tousevar' , ate over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .02441999  (not concave)
Iteration 1:   f(p) =    .020112  
Iteration 2:   f(p) =  .01484746  
Iteration 3:   f(p) =   .0142955  
Iteration 4:   f(p) =  .01428412  
Iteration 5:   f(p) =  .01428407  
Iteration 6:   f(p) =  .01428407  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.074574   .2572873    -4.18   0.000    -1.578848      -.5703
        1.x2 |  -1.732571    .847337    -2.04   0.041    -3.393321   -.0718214
        1.x3 |   -.535995   .6259896    -0.86   0.392    -1.762912    .6909221
          x4 |  -.2389831   .2458124    -0.97   0.331    -.7207666    .2428004
          x5 |   .0484453   .0243181     1.99   0.046     .0007828    .0961078
          x6 |  -.2519975   .0459113    -5.49   0.000    -.3419819    -.162013
          x7 |   .0081703   .0322545     0.25   0.800    -.0550474    .0713879
         x90 |    .120204   .1075227     1.12   0.264    -.0905366    .3309445
         x91 |  -.1467757   .1099013    -1.34   0.182    -.3621782    .0686269
         x92 |   .1315867   .1151671     1.14   0.253    -.0941367    .3573101
         x93 |    .086207   .1113523     0.77   0.439    -.1320395    .3044534
         x94 |  -.1702521    .103099    -1.65   0.099    -.3723225    .0318183
         x95 |   .0217906    .112224     0.19   0.846    -.1981643    .2417456
       _cons |   1.206345   .6074599     1.99   0.047      .015746    2.396945
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>7.142, 14) = 0.929

. gmatch `treatvar' `varlist' if `tousevar' , ate cbps ipw pooledvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  9.768e-08  
Iteration 1:   f(p) =  9.599e-08  (backed up)
Iteration 2:   f(p) =  7.672e-08  
Iteration 3:   f(p) =  6.399e-08  
Iteration 4:   f(p) =  6.304e-08  
Iteration 5:   f(p) =  6.026e-08  
Iteration 6:   f(p) =  5.854e-08  
Iteration 7:   f(p) =  5.801e-08  
Iteration 8:   f(p) =  5.780e-08  
Iteration 9:   f(p) =  5.775e-08  
Iteration 10:  f(p) =  5.764e-08  
Iteration 11:  f(p) =  5.743e-08  
(switching technique to nr)
Iteration 12:  f(p) =  5.722e-08  
Iteration 13:  f(p) =  5.714e-08  
Iteration 14:  f(p) =  5.714e-08  
Iteration 15:  f(p) =  5.714e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.074574
        1.x2 |  -1.732571
        1.x3 |  -.5359949
          x4 |   -.238983
          x5 |   .0484453
          x6 |  -.2519974
          x7 |   .0081703
         x90 |    .120204
         x91 |  -.1467757
         x92 |   .1315867
         x93 |    .086207
         x94 |  -.1702521
         x95 |   .0217906
       _cons |   1.206345
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408      .173      .114     .0142     .0324     .0574     .0892       .14      .232      .346      .487      .672
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92      .274       .13     .0508     .0508      .131      .157      .271      .373       .42      .673      .673
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500      .191      .123     .0142     .0339     .0609     .0967      .153      .263      .381       .55      .673
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6406563      .7027893      -.062133     -.1343718      .4623962      1.111543  |
   3 |        i1.x2      .0157701      .0233767     -.0076067     -.0518322      .1467555      .6856459  |
   4 |        i1.x3       .024807      .0398362     -.0150293     -.0794675      .1891246      .6378543  |
   5 |           x4      .4886894      .4862356      .0024538      .0049044      .5003233      1.008759  |
   6 |           x5      25.82556      26.34781     -.5222463      -.087499      5.968599        .75999  |
   7 |           x6      12.33004       12.9064     -.5763641     -.2576164      2.237296      .5881093  |
   8 |           x7       6.88452      6.669732      .2147883      .0639215      3.360189      1.180429  |
   9 |          x90     -.0713183     -.0265029     -.0448154     -.0441805      1.014371      1.157748  |
  10 |          x91      .0200089     -.0226109      .0426199       .043028      .9905145      .9174008  |
  11 |          x92      .0040221     -.0083767      .0123988       .012151      1.020391      1.200576  |
  12 |          x93      .0229491       .055179       -.03223     -.0331899      .9710769      .8891008  |
  13 |          x94      -.121595     -.0231316     -.0984633     -.0994521       .990058      .8143466  |
  14 |          x95     -.0950136      -.071595     -.0234187     -.0239408      .9781897      .8041468  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0027971508
  Mean absolute standardized diff.
  .0719657756
  Maximum absolute standardized diff.
  .2576163783
  C.V. of matching weights:
  .2958975504
  S.D. of matching weights:
  .2958975504
  Skewness of matching weights:
  .1574497662
  Kurtosis of matching weights:
  .0654318582

. 
. cbps `treatvar' `varlist' if `tousevar' , att logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00006892  
Iteration 2:   f(p) =  1.777e-07  
Iteration 3:   f(p) =  2.570e-12  
Iteration 4:   f(p) =  6.940e-22  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.339291   .3615444    -3.70   0.000    -2.047905   -.6306769
        1.x2 |  -1.525175    1.19071    -1.28   0.200    -3.858923    .8085728
        1.x3 |  -.5996277   .8424377    -0.71   0.477    -2.250775     1.05152
          x4 |  -.3183658   .3103113    -1.03   0.305    -.9265647    .2898331
          x5 |   .0587883     .02835     2.07   0.038     .0032234    .1143533
          x6 |  -.2435676   .0675718    -3.60   0.000    -.3760059   -.1111292
          x7 |   .0341034   .0400884     0.85   0.395    -.0444685    .1126752
         x90 |    .158599   .1286436     1.23   0.218    -.0935378    .4107357
         x91 |  -.1617619    .131618    -1.23   0.219    -.4197284    .0962045
         x92 |   .1391156   .1358437     1.02   0.306    -.1271333    .4053644
         x93 |   .0571151    .134574     0.42   0.671    -.2066451    .3208752
         x94 |  -.1175052   .1193236    -0.98   0.325    -.3513752    .1163649
         x95 |    .011505   .1383574     0.08   0.934    -.2596705    .2826805
       _cons |    .782858    .962964     0.81   0.416    -1.104517    2.670233
------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps pooledvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
(switching technique to nr)
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.181e-12  
Iteration 14:  f(p) =  4.655e-16  
Iteration 15:  f(p) =  2.607e-24  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4673913     -1.38e-10     -2.77e-10      .4994352      1.008511  |
   3 |        i1.x2      .0108696      .0108696     -7.66e-11     -7.38e-10      .1037929      1.008511  |
   4 |        i1.x3      .0217391      .0217391     -8.17e-11     -5.60e-10      .1459766      1.008511  |
   5 |           x4      .4347826      .4347826     -4.03e-10     -8.12e-10      .4962249      1.008511  |
   6 |           x5      25.46739      25.46739     -1.76e-09     -2.65e-10      6.664728      .6195799  |
   7 |           x6      11.86957      11.86957     -1.98e-09     -9.69e-10      2.043536      .5669465  |
   8 |           x7      6.858696      6.858696     -1.77e-10     -5.27e-11      3.363971      1.145237  |
   9 |          x90      .0972024      .0972024      4.54e-11      4.44e-11      1.021603       .845302  |
  10 |          x91     -.0890157     -.0890157     -3.25e-11     -3.40e-11      .9556678      .9654928  |
  11 |          x92      .0453787      .0453787      4.05e-11      4.06e-11      .9971707      1.136731  |
  12 |          x93      .0865687      .0865687     -6.32e-11     -6.65e-11        .95074      .9577067  |
  13 |          x94     -.1299173     -.1299173      5.29e-10      5.16e-10       1.02511      .7795321  |
  14 |          x95     -.0807251     -.0807251      8.07e-11      8.42e-11      .9586344      .8888006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  5.64497e-20
  Mean absolute standardized diff.
  3.42968e-10
  Maximum absolute standardized diff.
  9.69352e-10
  C.V. of matching weights:
  .892680365
  S.D. of matching weights:
  .892680365
  Skewness of matching weights:
  .1100078305
  Kurtosis of matching weights:
  .0225364399

. 
. cbps `treatvar' `varlist' if `tousevar' , att over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .04521356  
Iteration 1:   f(p) =  .03210384  
Iteration 2:   f(p) =   .0303286  
Iteration 3:   f(p) =   .0302734  
Iteration 4:   f(p) =  .03027339  
Iteration 5:   f(p) =  .03027339  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.171988   .2187737    -5.36   0.000    -1.600776   -.7431991
        1.x2 |  -1.909814   .6607307    -2.89   0.004    -3.204822   -.6148052
        1.x3 |  -.4402667   .7269474    -0.61   0.545    -1.865057     .984524
          x4 |  -.3130788   .2251092    -1.39   0.164    -.7542848    .1281272
          x5 |   .0503881   .0191417     2.63   0.008     .0128711    .0879051
          x6 |  -.2393185   .0575186    -4.16   0.000     -.352053   -.1265841
          x7 |   .0261168   .0311563     0.84   0.402    -.0349484    .0871821
         x90 |   .1425533   .1007579     1.41   0.157    -.0549285    .3400351
         x91 |  -.1282785   .1127153    -1.14   0.255    -.3491964    .0926393
         x92 |      .1073   .1112316     0.96   0.335    -.1107099    .3253099
         x93 |   .0527165   .1101053     0.48   0.632    -.1630859    .2685189
         x94 |  -.1248021   .0971592    -1.28   0.199    -.3152305    .0656263
         x95 |   .0220743   .1115296     0.20   0.843    -.1965196    .2406683
       _cons |   .9132207   .6048419     1.51   0.131    -.2722476    2.098689
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>15.137, 14) = 0.369

. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw pooledvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  1.809e-07  
Iteration 1:   f(p) =  1.775e-07  (backed up)
Iteration 2:   f(p) =  1.749e-07  
Iteration 3:   f(p) =  1.665e-07  
Iteration 4:   f(p) =  1.593e-07  
Iteration 5:   f(p) =  1.436e-07  
Iteration 6:   f(p) =  1.400e-07  
Iteration 7:   f(p) =  1.356e-07  
Iteration 8:   f(p) =  1.328e-07  
Iteration 9:   f(p) =  1.272e-07  
Iteration 10:  f(p) =  1.231e-07  
Iteration 11:  f(p) =  1.224e-07  
(switching technique to nr)
Iteration 12:  f(p) =  1.220e-07  
Iteration 13:  f(p) =  1.211e-07  
Iteration 14:  f(p) =  1.211e-07  
Iteration 15:  f(p) =  1.211e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171988
        1.x2 |  -1.909811
        1.x3 |  -.4402667
          x4 |  -.3130788
          x5 |   .0503881
          x6 |  -.2393185
          x7 |   .0261168
         x90 |   .1425533
         x91 |  -.1282785
         x92 |   .1072999
         x93 |   .0527165
         x94 |  -.1248021
         x95 |   .0220743
       _cons |   .9132204
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408      .164      .111     .0101     .0291     .0535     .0814       .13      .221       .34      .472      .599
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .151       .26      .364      .429      .666      .666
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500      .183      .122     .0101     .0298     .0577     .0913      .147      .253      .376      .555      .666
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4923283     -.0249369      -.049839      .5003503      1.004458  |
   3 |        i1.x2      .0108696      .0074884      .0033811      .0376593      .0897825      1.458884  |
   4 |        i1.x3      .0217391       .023711     -.0019719     -.0130452       .151158      .9265074  |
   5 |           x4      .4347826      .4386729     -.0038903     -.0078334      .4966326      1.006495  |
   6 |           x5      25.46739      25.45801      .0093781      .0014148      6.628535      .6273162  |
   7 |           x6      11.86957      11.89491     -.0253428     -.0123239        2.0564       .559006  |
   8 |           x7      6.858696      6.790863      .0678324      .0201339       3.36906      1.140985  |
   9 |          x90      .0972024      .0826851      .0145173      .0142151      1.021263      .8460037  |
  10 |          x91     -.0890157     -.0671192     -.0218965     -.0227622      .9619657      .9503048  |
  11 |          x92      .0453787      .0235132      .0218655      .0219385      .9966695      1.138269  |
  12 |          x93      .0865687      .0849356       .001633      .0017143      .9526181      .9531308  |
  13 |          x94     -.1299173     -.1339674      .0040501      .0039553      1.023979      .7815571  |
  14 |          x95     -.0807251     -.0745052     -.0062199     -.0064787      .9600495      .8856706  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  7.49047e-07
  Mean absolute standardized diff.
  .016408746
  Maximum absolute standardized diff.
  .0498389801
  C.V. of matching weights:
  .826886455
  S.D. of matching weights:
  .826886455
  Skewness of matching weights:
  .1040781457
  Kurtosis of matching weights:
  .0213437013

. 
. // After calling gmatch, the data is stored in a class instance named gmatch_ado_most_recent
. // You can print any of the public functions or variables to the screen with gmatchcall. For example:
. gmatchcall diff()
                  1              2              3              4              5              6              7              8              9             10
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
  1 |   -.024936947    .0033811488     -.00197189   -.0038903335    .0093781253   -.0253427887    .0678324389    .0145173066   -.0218964669    .0218654677
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
                 11             12             13
     ----------------------------------------------+
  1     .0016330441    .0040501466   -.0062199127  |
     ----------------------------------------------+

. gmatchcall balancetable()
                 1            2            3            4            5            6            7
     +--------------------------------------------------------------------------------------------+
   1 |    Variable     mean (T)     mean (C)       diff()    stddiff()       sd (T)   varratio()  |
   2 |          x1     .4673913     .4923283    -.0249369    -.0497079     .5016695     1.004458  |
   3 |       i1.x2     .0108696     .0074884     .0033811     .0324308     .1042572     1.458884  |
   4 |       i1.x3     .0217391      .023711    -.0019719    -.0134481     .1466296     .9265074  |
   5 |          x4     .4347826     .4386729    -.0038903    -.0078049     .4984448     1.006495  |
   6 |          x5     25.46739     25.45801     .0093781     .0017227     5.443922     .6273162  |
   7 |          x6     11.86957     11.89491    -.0253428    -.0157893     1.605057      .559006  |
   8 |          x7     6.858696     6.790863     .0678324     .0190717     3.556704     1.140985  |
   9 |         x90     .0972024     .0826851     .0145173     .0152207     .9537854     .8460037  |
  10 |         x91    -.0890157    -.0671192    -.0218965    -.0232211     .9429542     .9503048  |
  11 |         x92     .0453787     .0235132     .0218655      .020801     1.051175     1.138269  |
  12 |         x93     .0865687     .0849356      .001633     .0017466     .9349714     .9531308  |
  13 |         x94    -.1299173    -.1339674     .0040501     .0043794     .9248091     .7815571  |
  14 |         x95    -.0807251    -.0745052    -.0062199    -.0068051      .914005     .8856706  |
     +--------------------------------------------------------------------------------------------+
                   1              2              3              4              5              6
     +-------------------------------------------------------------------------------------------+
   1 |   .4673913043    .4923282514    -.024936947   -.0497079239    .5016694537    1.004458061  |
   2 |   .0108695652    .0074884165    .0033811488    .0324308396     .104257207    1.458884284  |
   3 |   .0217391304    .0237110204     -.00197189   -.0134481032    .1466295976    .9265074175  |
   4 |   .4347826087    .4386729422   -.0038903335   -.0078049437    .4984447863    1.006494803  |
   5 |    25.4673913    25.45801318    .0093781253    .0017226781    5.443922081    .6273161667  |
   6 |   11.86956522    11.89490801   -.0253427887   -.0157893436    1.605056511    .5590060153  |
   7 |   6.858695652    6.790863213    .0678324389    .0190717133    3.556703999    1.140985236  |
   8 |   .0972024365    .0826851299    .0145173066    .0152207271    .9537853564    .8460036791  |
   9 |  -.0890156845   -.0671192175   -.0218964669   -.0232211342    .9429542393    .9503048128  |
  10 |   .0453786792    .0235132115    .0218654677    .0208009697    1.051175404    1.138268871  |
  11 |   .0865686693    .0849356252    .0016330441    .0017466245    .9349714429    .9531308328  |
  12 |  -.1299172593    -.133967406    .0040501466    .0043794409    .9248090545    .7815571022  |
  13 |  -.0807250915   -.0745051788   -.0062199127    -.006805119    .9140049864    .8856705764  |
     +-------------------------------------------------------------------------------------------+

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00032638  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  8.089e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  5.298e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.466e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.466e-13  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  1.466e-13  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 6:   f(p) =  1.466e-13  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  2.506e-15  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  5.073e-17  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  7.201e-18  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  6.086e-19  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.095e-19  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  2.126e-20  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  2.126e-20  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  2.126e-20  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  3.635e-22  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  2.172e-23  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  9.035e-24  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.164e-24  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  9.941e-25  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  3.682e-25  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  1.470e-25  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  4.609e-26  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  1.885e-26  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  3.515e-27  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  2.855e-27  (backed up)
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  2.128e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  2.126e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  f(p) =  2.124e-27  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  f(p) =  2.124e-27  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  f(p) =  2.124e-27  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  f(p) =  4.726e-29  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  f(p) =  5.379e-31  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  f(p) =  1.548e-31  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  f(p) =  3.080e-32  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  f(p) =  5.743e-33  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  f(p) =  2.086e-33  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  f(p) =  4.922e-34  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  f(p) =  7.046e-35  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  f(p) =  2.047e-35  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  f(p) =  7.313e-36  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 59:  f(p) =  4.408e-36  (backed up)

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206443
        1.x2 |  -1.628676
        1.x3 |  -.5803099
          x4 |  -.2832337
          x5 |   .0694163
          x6 |  -.2787869
          x7 |   .0283209
         x90 |   .1446874
         x91 |  -.1322013
         x92 |   .1288213
         x93 |     .06336
         x94 |  -.1645468
         x95 |   .0190735
       _cons |   1.412503
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408      .238      .148     .0189     .0388     .0789      .123      .201       .32      .473      .621      .809
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .371      .164     .0729     .0729      .181      .221      .355        .5      .566      .803      .803
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500      .262       .16     .0189     .0422     .0864      .139      .222      .357      .505      .694      .809
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5065707     -.0391794     -.0782804      .5005003      1.004395  |
   3 |        i1.x2      .0108696      .0094032      .0014663      .0149667      .0979728      1.164051  |
   4 |        i1.x3      .0217391      .0217076      .0000315      .0002159      .1458921      1.009942  |
   5 |           x4      .4347826      .4181832      .0165994      .0335848       .494252      1.018628  |
   6 |           x5      25.46739      26.05541       -.58802     -.0858633      6.848324       .583267  |
   7 |           x6      11.86957      11.79935      .0702179      .0339771      2.066626      .5528994  |
   8 |           x7      6.858696      6.775281      .0834144        .02476      3.368912      1.141156  |
   9 |          x90      .0972024      .0569964       .040206      .0394192       1.01996      .8487821  |
  10 |          x91     -.0890157      -.062197     -.0268186     -.0280778      .9551534      .9668971  |
  11 |          x92      .0453787      .0391246      .0062541      .0063049      .9919318      1.151879  |
  12 |          x93      .0865687      .1044403     -.0178716      -.018834      .9489024      .9622808  |
  13 |          x94     -.1299173     -.1873487      .0574315       .054986      1.044474      .7465145  |
  14 |          x95     -.0807251     -.0886593      .0079342       .008292      .9568576       .892775  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.75827e-07
  Mean absolute standardized diff.
  .0328894004
  Maximum absolute standardized diff.
  .0858633379
  C.V. of matching weights:
  .9404775328
  S.D. of matching weights:
  .9404775328
  Skewness of matching weights:
  .1710882156
  Kurtosis of matching weights:
  .0624918361

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet sd_sq treatvariance difficult
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .02141594  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .02005607  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01097598  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00782372  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00292673  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00193285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00085471  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00063406  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00028285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013476  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00008047  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00006324  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =   .0000443  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00001382  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00001377  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001245  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  .00001151  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  .00001044  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  9.678e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  7.828e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  6.452e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  5.631e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  5.432e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  5.071e-06  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  4.310e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  3.407e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.712e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  6.134e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  3.341e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  2.852e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  4.053e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  1.870e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  1.942e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  3.595e-17  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = stddiff():^2
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |   1.381947
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .249      .153     .0228     .0486      .085      .134      .207      .339      .492      .653      .743
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .389      .175     .0763     .0763      .181      .226      .395      .531      .607        .8        .8
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .275      .166     .0228     .0491     .0912      .149       .23      .385      .537      .721        .8
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4673913      1.10e-10      2.19e-10      .4994352      1.008511  |
   3 |        i1.x2      .0108696      .0108696     -8.24e-11     -7.94e-10      .1037929      1.008511  |
   4 |        i1.x3      .0217391      .0217391      1.88e-11      1.29e-10      .1459766      1.008511  |
   5 |           x4      .4347826      .4347826      1.39e-09      2.81e-09      .4962249      1.008511  |
   6 |           x5      25.46739      25.46739      6.86e-10      1.03e-10      6.664728      .6195799  |
   7 |           x6      11.86957      11.86957      9.76e-10      4.77e-10      2.043536      .5669465  |
   8 |           x7      6.858696      6.858696     -8.89e-10     -2.64e-10      3.363971      1.145237  |
   9 |          x90      .0972024      .0972024     -4.22e-09     -4.13e-09      1.021603       .845302  |
  10 |          x91     -.0890157     -.0890157      4.82e-10      5.04e-10      .9556678      .9654928  |
  11 |          x92      .0453787      .0453787      8.26e-10      8.28e-10      .9971707      1.136731  |
  12 |          x93      .0865687      .0865687      7.17e-10      7.54e-10        .95074      .9577067  |
  13 |          x94     -.1299173     -.1299173      2.14e-09      2.09e-09       1.02511      .7795321  |
  14 |          x95     -.0807251     -.0807251     -6.81e-10     -7.10e-10      .9586344      .8888006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  2.38788e-20
  Mean absolute standardized diff.
  1.06269e-09
  Maximum absolute standardized diff.
  4.13489e-09
  C.V. of matching weights:
  .8926803688
  S.D. of matching weights:
  .8926803688
  Skewness of matching weights:
  .1100078314
  Kurtosis of matching weights:
  .0225364402

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.978e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -365.5251   68.93598    -5.30   0.000    -500.6371   -230.4131
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3417.895   43.41569    78.72   0.000     3332.801    3502.988
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3417.8947

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752   -.0090577      1.338962   .9989677
                  |
               x2 |
               1  |  -.1180374    .0096998      .4133173   1.098626
                  |
               x3 |
               1  |  -.1253201    .0022927      .5085817   1.015318
                  |
               x4 |  -.1207472   -.0222549      .9914484   .9947225
               x5 |  -.1944638    .0308855      .8589874   .5917507
               x6 |  -.6542694    .0952268      .4958356   .5601212
               x7 |   .0473848    .0429284      1.160037   1.132231
              x90 |   .1499304    .0130255      .9289414   .8182649
              x91 |  -.0833726   -.0288848      .8791918   .9584288
              x92 |   .0662245    .0110605      1.090179   1.139468
              x93 |   .0479737   -.0087695      .8926169   .9659809
              x94 |  -.1521926    .0562648      .8686432   .7583723
              x95 |  -.0155155     .017858      .8285405   .8879817
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , atet ipw treatvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4719209     -.0045296     -.0090652      .4996633      1.007399  |
   3 |        i1.x2      .0108696      .0098847      .0009849      .0098566      .0999227      1.107894  |
   4 |        i1.x3      .0217391      .0214054      .0003337      .0023004      .1450795      1.023886  |
   5 |           x4      .4347826       .445852     -.0110694     -.0222576      .4973308      1.003118  |
   6 |           x5      25.46739      25.27307      .1943233      .0286772      6.776222       .596745  |
   7 |           x6      11.86957      11.68981      .1797533      .0877664      2.048089      .5648484  |
   8 |           x7      6.858696      6.711046      .1476493      .0438323      3.368502      1.141787  |
   9 |          x90      .0972024      .0841522      .0130502       .012645      1.032043      .8251709  |
  10 |          x91     -.0890157     -.0615794     -.0274362     -.0287197      .9553102      .9665176  |
  11 |          x92      .0453787      .0341522      .0112265      .0113068       .992897      1.149085  |
  12 |          x93      .0865687      .0948113     -.0082427     -.0087305        .94412      .9741335  |
  13 |          x94     -.1299173     -.1857505      .0558332      .0540116      1.033726      .7647728  |
  14 |          x95     -.0807251     -.0974964      .0167713      .0175493      .9556712      .8954759  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet ipw averagevariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4719209     -.0045296     -.0090652      .4996633      1.007399  |
   3 |        i1.x2      .0108696      .0098847      .0009849      .0098566      .0999227      1.107894  |
   4 |        i1.x3      .0217391      .0214054      .0003337      .0023004      .1450795      1.023886  |
   5 |           x4      .4347826       .445852     -.0110694     -.0222576      .4973308      1.003118  |
   6 |           x5      25.46739      25.27307      .1943233      .0286772      6.776222       .596745  |
   7 |           x6      11.86957      11.68981      .1797533      .0877664      2.048089      .5648484  |
   8 |           x7      6.858696      6.711046      .1476493      .0438323      3.368502      1.141787  |
   9 |          x90      .0972024      .0841522      .0130502       .012645      1.032043      .8251709  |
  10 |          x91     -.0890157     -.0615794     -.0274362     -.0287197      .9553102      .9665176  |
  11 |          x92      .0453787      .0341522      .0112265      .0113068       .992897      1.149085  |
  12 |          x93      .0865687      .0948113     -.0082427     -.0087305        .94412      .9741335  |
  13 |          x94     -.1299173     -.1857505      .0558332      .0540116      1.033726      .7647728  |
  14 |          x95     -.0807251     -.0974964      .0167713      .0175493      .9556712      .8954759  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002347319
  Mean absolute standardized diff.
  .0259014405
  Maximum absolute standardized diff.
  .0877663582
  C.V. of matching weights:
  .9405531153
  S.D. of matching weights:
  .9405531153
  Skewness of matching weights:
  .1334759569
  Kurtosis of matching weights:
  .0358990805

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , ate aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  1.612e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |   -328.878   82.21905    -4.00   0.000    -490.0244   -167.7316
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3452.527   28.58753   120.77   0.000     3396.497    3508.558
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ate ipw treatvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6643106      .6980937     -.0337831     -.0730952      .4621798      1.067096  |
   3 |        i1.x2      .0126474      .0237734      -.011126     -.0762399       .145934      .5426396  |
   4 |        i1.x3      .0252967      .0398782     -.0145815     -.0769757      .1894293      .6494649  |
   5 |           x4      .5035684      .4859058      .0176626      .0352982       .500383      1.009262  |
   6 |           x5      25.88638       26.3268     -.4404207     -.0736253       5.98192      .7436049  |
   7 |           x6      12.40345      12.88502     -.4815643      -.214612      2.243884      .5994444  |
   8 |           x7      6.783391      6.698872      .0845182      .0251498       3.36059      1.188955  |
   9 |          x90     -.1279394     -.0237456     -.1041937     -.1022979      1.018533      1.179133  |
  10 |          x91      .0259183     -.0177924      .0437107      .0442269      .9883275      .9105384  |
  11 |          x92      .0197006     -.0121531      .0318537      .0312437      1.019527      1.201641  |
  12 |          x93      .0303493      .0505445     -.0201952     -.0208151      .9702151      .8788976  |
  13 |          x94      -.142924     -.0216133     -.1213108     -.1226343      .9892079      .7980325  |
  14 |          x95     -.0930146     -.0717394     -.0212752     -.0217631      .9775833      .7971968  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0024703949
  Mean absolute standardized diff.
  .0706136183
  Maximum absolute standardized diff.
  .2146119676
  C.V. of matching weights:
  .3337259551
  S.D. of matching weights:
  .3337259551
  Skewness of matching weights:
  .1843123883
  Kurtosis of matching weights:
  .0838509706

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  3.813e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |     319.07   91.15096     3.50   0.000     140.4174    497.7225
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3141.406   87.28586    35.99   0.000     2970.328    3312.483
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.207512   .3268258     3.69   0.000     .5669452    1.848079
                        |
                     x2 |
                     1  |   1.628792   1.054719     1.54   0.123    -.4384199    3.696005
                        |
                     x3 |
                     1  |   .5805318   .8259794     0.70   0.482    -1.038358    2.199422
                     x4 |   .2831153   .2838113     1.00   0.318    -.2731445    .8393752
                     x5 |  -.0545179   .0270259    -2.02   0.044    -.1074878   -.0015481
                     x6 |   .2844593   .0688093     4.13   0.000     .1495955     .419323
                     x7 |   -.023871   .0390129    -0.61   0.541    -.1003349    .0525929
                    x90 |  -.1439494   .1292697    -1.11   0.265    -.3973133    .1094145
                    x91 |   .1331182   .1248073     1.07   0.286    -.1114997    .3777361
                    x92 |  -.1277527    .133834    -0.95   0.340    -.3900625    .1345572
                    x93 |  -.0623585   .1243317    -0.50   0.616    -.3060441    .1813271
                    x94 |   .1663354   .1194682     1.39   0.164    -.0678179    .4004887
                    x95 |   -.017776   .1254901    -0.14   0.887     -.263732    .2281801
                  _cons |  -1.379538   .9297905    -1.48   0.138    -3.201894    .4428177
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' , ateu ipw treatvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .7133644           .75     -.0366356     -.0837821      .4372727      1.099818  |
   3 |        i1.x2      .0130902      .0269608     -.0138706     -.0897954      .1544686      .4966403  |
   4 |        i1.x3      .0261829      .0441176     -.0179347     -.0905493      .1980657       .609761  |
   5 |           x4      .5207033       .495098      .0256053      .0511594      .5005007      1.006879  |
   6 |           x5      25.99075      26.56863      -.577878     -.1002906      5.762036      .7963305  |
   7 |           x6      12.53645      13.15931     -.6228673     -.2813566        2.2138      .6382822  |
   8 |           x7      6.764632      6.696078      .0685532      .0204092      3.358927      1.200431  |
   9 |          x90     -.1840235      -.048508     -.1355155     -.1337092      1.013509      1.263776  |
  10 |          x91       .054549     -.0077434      .0622924      .0625861      .9953062      .8955527  |
  11 |          x92       .013304     -.0227801      .0360842      .0351881      1.025465       1.21557  |
  12 |          x93      .0163448      .0403853     -.0240406     -.0246383      .9757395       .857822  |
  13 |          x94     -.1461641      .0160559     -.1622201     -.1661874       .976127      .8119355  |
  14 |          x95      -.096076     -.0658282     -.0302478     -.0307892      .9824155      .7755988  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0040935914
  Mean absolute standardized diff.
  .0900339258
  Maximum absolute standardized diff.
  .2813566299
  C.V. of matching weights:
  .3545137453
  S.D. of matching weights:
  .3545137453
  Skewness of matching weights:
  .2680619555
  Kurtosis of matching weights:
  .1550433574

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
(switching technique to nr)
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.181e-12  
Iteration 14:  f(p) =  4.655e-16  
Iteration 15:  f(p) =  2.607e-24  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525175
        1.x3 |  -.5996277
          x4 |  -.3183658
          x5 |   .0587883
          x6 |  -.2435676
          x7 |   .0341034
         x90 |    .158599
         x91 |  -.1617619
         x92 |   .1391156
         x93 |   .0571151
         x94 |  -.1175052
         x95 |    .011505
       _cons |    .782858
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4673913     -1.38e-10     -2.77e-10      .4994352      1.008511  |
   3 |        i1.x2      .0108696      .0108696     -7.66e-11     -7.38e-10      .1037929      1.008511  |
   4 |        i1.x3      .0217391      .0217391     -8.17e-11     -5.60e-10      .1459766      1.008511  |
   5 |           x4      .4347826      .4347826     -4.03e-10     -8.12e-10      .4962249      1.008511  |
   6 |           x5      25.46739      25.46739     -1.76e-09     -2.65e-10      6.664728      .6195799  |
   7 |           x6      11.86957      11.86957     -1.98e-09     -9.69e-10      2.043536      .5669465  |
   8 |           x7      6.858696      6.858696     -1.77e-10     -5.27e-11      3.363971      1.145237  |
   9 |          x90      .0972024      .0972024      4.54e-11      4.44e-11      1.021603       .845302  |
  10 |          x91     -.0890157     -.0890157     -3.25e-11     -3.40e-11      .9556678      .9654928  |
  11 |          x92      .0453787      .0453787      4.05e-11      4.06e-11      .9971707      1.136731  |
  12 |          x93      .0865687      .0865687     -6.32e-11     -6.65e-11        .95074      .9577067  |
  13 |          x94     -.1299173     -.1299173      5.29e-10      5.16e-10       1.02511      .7795321  |
  14 |          x95     -.0807251     -.0807251      8.07e-11      8.42e-11      .9586344      .8888006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  5.64497e-20
  Mean absolute standardized diff.
  3.42968e-10
  Maximum absolute standardized diff.
  9.69352e-10
  C.V. of matching weights:
  .892680365
  S.D. of matching weights:
  .892680365
  Skewness of matching weights:
  .1100078305
  Kurtosis of matching weights:
  .0225364399

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvopt(1 .75 6)
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00061284  
Iteration 1:   f(p) =  2.180e-07  
Iteration 2:   f(p) =  1.269e-07  
Iteration 3:   f(p) =  1.206e-07  
Iteration 4:   f(p) =  1.176e-07  
Iteration 5:   f(p) =  1.170e-07  
Iteration 6:   f(p) =  1.170e-07  
Iteration 7:   f(p) =  1.161e-07  
Iteration 8:   f(p) =  8.900e-08  
Iteration 9:   f(p) =  8.301e-08  
Iteration 10:  f(p) =  8.238e-08  
Iteration 11:  f(p) =  8.232e-08  
(switching technique to nr)
Iteration 12:  f(p) =  8.209e-08  
Iteration 13:  f(p) =  7.516e-08  
Iteration 14:  f(p) =  6.789e-08  
Iteration 15:  f(p) =  4.227e-08  
Iteration 16:  f(p) =  2.563e-08  (not concave)
Iteration 17:  f(p) =  1.868e-08  (not concave)
Iteration 18:  f(p) =  1.309e-08  (not concave)
Iteration 19:  f(p) =  1.230e-08  
Iteration 20:  f(p) =  1.163e-08  
Iteration 21:  f(p) =  1.144e-08  
Iteration 22:  f(p) =  1.143e-08  
Iteration 23:  f(p) =  1.143e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(CV-.75)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.069921
        1.x2 |  -1.301676
        1.x3 |  -.4865723
          x4 |  -.2463173
          x5 |   .0447741
          x6 |  -.1995636
          x7 |   .0257331
         x90 |   .1236241
         x91 |  -.1270511
         x92 |   .1015911
         x93 |   .0470551
         x94 |  -.0948948
         x95 |   .0008498
       _cons |   .4556068
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .778     .0982      .186      .326      .484      .726      1.27      2.16      3.56         5
         |       408         1      .778     .0982      .186      .326      .484      .726      1.27      2.16      3.56         5
         |       408      .163     .0963     .0205     .0382     .0651     .0937      .134      .213      .316      .432      .516
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .252      .117     .0584     .0584      .123      .148      .246      .342      .394      .585      .585
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .703     .0982      .194      .341      .532      .903      1.07      1.93      3.51         5
         |       500         1      .703     .0982      .194      .341      .532      .903      1.07      1.93      3.51         5
         |       500      .179      .106     .0205     .0398     .0673        .1      .148       .24      .344      .498      .585
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5182506     -.0508593      -.101633      .5004216      1.005561  |
   3 |        i1.x2      .0108696       .012455     -.0015855     -.0144495      .1097243      .8815459  |
   4 |        i1.x3      .0217391      .0242826     -.0025435     -.0166652       .152624      .9052272  |
   5 |           x4      .4347826      .4521395     -.0173569     -.0348613      .4978848       1.00052  |
   6 |           x5      25.46739      25.54157     -.0741742     -.0113793      6.518363      .6518318  |
   7 |           x6      11.86957      12.06656     -.1969952     -.0946411      2.081497      .5447873  |
   8 |           x7      6.858696      6.811629       .047067      .0139939      3.363384      1.145782  |
   9 |          x90      .0972024      .0715905      .0256119      .0252582      1.014003      .8605673  |
  10 |          x91     -.0890157     -.0737238     -.0152918     -.0158205      .9665824      .9393008  |
  11 |          x92      .0453787      .0269169      .0184618        .01845      1.000638      1.126957  |
  12 |          x93      .0865687      .0765419      .0100267      .0104435      .9600932      .9352735  |
  13 |          x94     -.1299173     -.0967909     -.0331264     -.0326327      1.015129       .797834  |
  14 |          x95     -.0807251     -.0889146      .0081896      .0084926      .9643199      .8763149  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0003564671
  Mean absolute standardized diff.
  .030670832
  Maximum absolute standardized diff.
  .1016329885
  C.V. of matching weights:
  .70269505
  S.D. of matching weights:
  .70269505
  Skewness of matching weights:
  .086726395
  Kurtosis of matching weights:
  .015619736

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps treatvariance cvopt(1 .50 6)
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .02519572  
Iteration 1:   f(p) =  .00037232  
Iteration 2:   f(p) =  .00018115  
Iteration 3:   f(p) =  .00007047  
Iteration 4:   f(p) =  .00006335  
Iteration 5:   f(p) =  .00005995  
Iteration 6:   f(p) =  .00003158  
Iteration 7:   f(p) =  .00001706  
Iteration 8:   f(p) =  .00001448  
Iteration 9:   f(p) =  .00001017  
Iteration 10:  f(p) =  9.753e-06  
Iteration 11:  f(p) =  9.539e-06  
(switching technique to nr)
Iteration 12:  f(p) =  9.503e-06  (not concave)
Iteration 13:  f(p) =  6.245e-06  (not concave)
Iteration 14:  f(p) =  5.513e-06  (not concave)
Iteration 15:  f(p) =  3.248e-07  (not concave)
Iteration 16:  f(p) =  3.015e-07  (not concave)
Iteration 17:  f(p) =  2.755e-07  (not concave)
Iteration 18:  f(p) =  1.198e-07  (not concave)
Iteration 19:  f(p) =  9.067e-08  (not concave)
Iteration 20:  f(p) =  7.308e-08  (not concave)
Iteration 21:  f(p) =  5.794e-08  (not concave)
Iteration 22:  f(p) =  5.529e-08  
Iteration 23:  f(p) =  5.128e-08  
(switching technique to bfgs)
Iteration 24:  f(p) =  5.114e-08  
Iteration 25:  f(p) =  5.114e-08  
Iteration 26:  f(p) =  5.114e-08  
Iteration 27:  f(p) =  5.114e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(CV-.5)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |   -.722414
        1.x2 |  -.9764863
        1.x3 |  -.3663536
          x4 |  -.1681587
          x5 |   .0290492
          x6 |  -.1459133
          x7 |   .0167638
         x90 |   .0854737
         x91 |  -.0882828
         x92 |   .0659836
         x93 |   .0343203
         x94 |  -.0658755
         x95 |  -.0067122
       _cons |  -.0849349
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .532      .195      .322      .466      .622      .841      1.25      1.82      2.59      3.27
         |       408         1      .532      .195      .322      .466      .622      .841      1.25      1.82      2.59      3.27
         |       408      .153     .0657     .0355     .0574     .0809      .105      .137      .191      .256      .329      .382
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .213     .0737     .0763     .0763      .132      .149      .213      .269      .301      .429      .429
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .481      .195      .328      .492      .675      .991      1.11      1.68      2.57      3.27
         |       500         1      .481      .195      .328      .492      .675      .991      1.11      1.68      2.57      3.27
         |       500      .164     .0711     .0355     .0584     .0847      .112      .148      .205      .274      .369      .429
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5906749     -.1232836     -.2486299      .4958518      1.038371  |
   3 |        i1.x2      .0108696      .0149903     -.0041207     -.0347551      .1185649      .7343374  |
   4 |        i1.x3      .0217391      .0280492       -.00631     -.0389705      .1619185      .7867073  |
   5 |           x4      .4347826      .4668619     -.0320792     -.0642906      .4989727      .9957268  |
   6 |           x5      25.46739      25.77278     -.3053873     -.0483059      6.321941      .6996664  |
   7 |           x6      11.86957      12.34747      -.477904     -.2245551      2.128226      .5220231  |
   8 |           x7      6.858696      6.764909      .0937864      .0279087      3.360476      1.148402  |
   9 |          x90      .0972024      .0379816      .0592208      .0590605      1.002713      .8843596  |
  10 |          x91     -.0890157     -.0569166     -.0320991     -.0327937      .9788185      .9113449  |
  11 |          x92      .0453787       .011174      .0342047      .0340436      1.004733      1.115674  |
  12 |          x93      .0865687      .0661146       .020454      .0210978      .9694876      .9136067  |
  13 |          x94     -.1299173     -.0574346     -.0724827     -.0721738      1.004279      .8189413  |
  14 |          x95     -.0807251     -.0931506      .0124255      .0127988      .9708344      .8623481  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0021986377
  Mean absolute standardized diff.
  .0707218446
  Maximum absolute standardized diff.
  .2486298678
  C.V. of matching weights:
  .4805839245
  S.D. of matching weights:
  .4805839245
  Skewness of matching weights:
  .062927853
  Kurtosis of matching weights:
  .0108020115

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvopt(1 .75 6) difficult
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00093921  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00042753  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00003686  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00002767  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00001518  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.684e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  3.117e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  1.306e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.977e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  7.501e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.838e-08  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  4.674e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.275e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  4.460e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  3.813e-11  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.676e-11  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  3.286e-13  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  9.610e-14  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  2.661e-14  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.888e-15  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.321e-15  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  5.316e-16  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  2.525e-16  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.242e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  9.015e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  7.958e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  7.886e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  6.704e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  5.120e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  5.010e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  4.996e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  4.378e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  4.059e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  4.037e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  4.035e-17  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(CV-.75)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.201677
        1.x2 |  -1.648351
        1.x3 |  -.6891127
          x4 |  -.2535704
          x5 |   .0134376
          x6 |  -.0743065
          x7 |  -.0183206
         x90 |   .0730709
         x91 |  -.1318571
         x92 |   .0667988
         x93 |  -.0158104
         x94 |   -.118947
         x95 |  -.0259086
       _cons |   1.404818
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .752      .109      .214      .414       .52      .692      1.11      2.23      3.53      4.26
         |       408         1      .752      .109      .214      .414       .52      .692      1.11      2.23      3.53      4.26
         |       408      .398      .146     .0803      .146      .248      .294      .356      .471      .641      .738      .773
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .516      .152      .229      .229      .334      .366      .517      .658      .707      .758      .758
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .679      .109       .22      .431      .563      .819         1      2.12      3.35      4.26
         |       500         1      .679      .109       .22      .431      .563      .819         1      2.12      3.35      4.26
         |       500       .42      .154     .0803       .15      .253      .307      .376      .557       .66      .755      .773
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4844105     -.0170192     -.0340282      .5001498      1.005199  |
   3 |        i1.x2      .0108696      .0086749      .0021947      .0231155      .0949438      1.260858  |
   4 |        i1.x3      .0217391      .0172585      .0044806      .0335914       .133385      1.264544  |
   5 |           x4      .4347826      .4902598     -.0554772     -.1109318      .5001023      .9917294  |
   6 |           x5      25.46739      24.82696      .6404269      .1034716        6.1894      .7360093  |
   7 |           x6      11.86957      12.34967     -.4801055     -.2269458      2.115507      .5291607  |
   8 |           x7      6.858696      6.355497      .5031987      .1485756      3.386819       1.13066  |
   9 |          x90      .0972024      .0662128      .0309897       .030314      1.022289      .8440927  |
  10 |          x91     -.0890157     -.0857377      -.003278     -.0033938      .9658748      .9409264  |
  11 |          x92      .0453787      .0273471      .0180315      .0179058      1.007023      1.109174  |
  12 |          x93      .0865687      .0236051      .0629636       .065184      .9659359      .9223614  |
  13 |          x94     -.1299173     -.1329455      .0030282      .0030341      .9980655      .8302999  |
  14 |          x95     -.0807251     -.0961106      .0153856      .0159118      .9669293      .8707006  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000256223
  Mean absolute standardized diff.
  .0628002522
  Maximum absolute standardized diff.
  .2269458468
  C.V. of matching weights:
  .6790148438
  S.D. of matching weights:
  .6790148438
  Skewness of matching weights:
  .0829073688
  Kurtosis of matching weights:
  .0131976578

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet mean_sd_sq treatvariance cvopt(1 .50 6) difficult
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =   .0255221  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00707055  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00121893  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00077435  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00038439  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00027065  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00020657  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00014905  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004814  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00002729  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00002254  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00001783  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001699  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.708e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  2.990e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  1.435e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.177e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  7.334e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.259e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.611e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.353e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  4.347e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  4.094e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  1.637e-07  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.536e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.465e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.080e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.045e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.045e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.040e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  9.998e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  9.894e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  9.891e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  9.891e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  9.890e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  9.885e-08  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  9.881e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  7.801e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  7.575e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  6.674e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  f(p) =  6.457e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  f(p) =  6.041e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  f(p) =  5.874e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  f(p) =  5.765e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  f(p) =  5.719e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  f(p) =  5.237e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  f(p) =  5.012e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  f(p) =  2.461e-08  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  f(p) =  2.280e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  f(p) =  2.254e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  f(p) =  2.189e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  f(p) =  2.176e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  f(p) =  2.175e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  f(p) =  2.175e-08  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(CV-.5)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.7887844
        1.x2 |  -2.395102
        1.x3 |  -.6210363
          x4 |  -.2725947
          x5 |    -.00048
          x6 |  -.0335335
          x7 |  -.0119069
         x90 |  -.0990997
         x91 |  -.1447482
         x92 |   -.114663
         x93 |  -.1030322
         x94 |  -.0782803
         x95 |  -.1519558
       _cons |   3.357107
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .553     .0505     .0991      .459      .636      .883      1.23      1.74      2.89      3.32
         |       408         1      .553     .0505     .0991      .459      .636      .883      1.23      1.74      2.89      3.32
         |       408       .87     .0797      .307      .464      .801      .848      .885      .915      .938      .962      .967
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .903     .0538       .58       .58      .851       .88      .908      .944      .954       .97       .97
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .499     .0505      .128      .513      .678      .995      1.14      1.64      2.88      3.32
         |       500         1      .499     .0505      .128      .513      .678      .995      1.14      1.64      2.88      3.32
         |       500      .876     .0766      .307      .521      .815      .852      .889      .919      .945      .963       .97
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5940708     -.1266795     -.2556789      .4954632      1.041073  |
   3 |        i1.x2      .0108696      .0035822      .0072874      .1040139      .0700617      3.037792  |
   4 |        i1.x3      .0217391      .0173612       .004378      .0327477      .1336878      1.257201  |
   5 |           x4      .4347826      .4813204     -.0465378     -.0931208      .4997573      .9927386  |
   6 |           x5      25.46739      25.49233     -.0249395     -.0041076      6.071588      .7683625  |
   7 |           x6      11.86957      12.62643     -.7568611     -.3485479       2.17147      .5051906  |
   8 |           x7      6.858696      6.552401      .3062946      .0904109      3.387807      1.126873  |
   9 |          x90      .0972024      -.113035      .2102375        .20862      1.007753      .8801527  |
  10 |          x91     -.0890157      -.110682      .0216663       .022406      .9669876      .9383917  |
  11 |          x92      .0453787     -.1366855      .1820642      .1808933      1.006473       1.11749  |
  12 |          x93      .0865687     -.0591155      .1456841      .1447781      1.006258      .8388811  |
  13 |          x94     -.1299173     -.0825678     -.0473494     -.0474935       .996967      .8328052  |
  14 |          x95     -.0807251     -.1857156      .1049905       .108146       .970822      .8641629  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001211138
  Mean absolute standardized diff.
  .126228047
  Maximum absolute standardized diff.
  .3485478844
  C.V. of matching weights:
  .4992729829
  S.D. of matching weights:
  .4992729829
  Skewness of matching weights:
  .0688225943
  Kurtosis of matching weights:
  .013107526

. 
. gmatch `treatvar' `varlist' if `tousevar' , atet cbps ipw treatvariance cvopt(1 .75 6)
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21673  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00061301  
Iteration 1:   f(p) =  .00010314  
Iteration 2:   f(p) =  .00006546  
Iteration 3:   f(p) =  .00002385  
Iteration 4:   f(p) =  .00001692  
Iteration 5:   f(p) =  .00001277  
Iteration 6:   f(p) =  .00001168  
Iteration 7:   f(p) =  .00001092  
Iteration 8:   f(p) =  8.593e-06  
Iteration 9:   f(p) =  5.345e-06  
Iteration 10:  f(p) =  4.603e-06  
Iteration 11:  f(p) =  4.428e-06  
(switching technique to nr)
Iteration 12:  f(p) =  4.385e-06  (not concave)
Iteration 13:  f(p) =  3.593e-06  (not concave)
Iteration 14:  f(p) =  1.412e-06  (not concave)
Iteration 15:  f(p) =  1.330e-06  (not concave)
Iteration 16:  f(p) =  8.185e-07  (not concave)
Iteration 17:  f(p) =  6.356e-07  (not concave)
Iteration 18:  f(p) =  3.442e-07  
Iteration 19:  f(p) =  3.113e-07  (not concave)
Iteration 20:  f(p) =  2.274e-07  (not concave)
Iteration 21:  f(p) =  2.138e-07  (not concave)
Iteration 22:  f(p) =  1.993e-07  (not concave)
Iteration 23:  f(p) =  1.741e-07  (not concave)
(switching technique to bfgs)
Iteration 24:  f(p) =  1.719e-07  
Iteration 25:  f(p) =  1.716e-07  
Iteration 26:  f(p) =  1.716e-07  
Iteration 27:  f(p) =  1.716e-07  
Iteration 28:  f(p) =  1.716e-07  
Iteration 29:  f(p) =  1.716e-07  
Iteration 30:  f(p) =  1.716e-07  

Propensity score model coefficients                Number of obs  =        500
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(CV-.75)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.059191
        1.x2 |  -1.392658
        1.x3 |  -.3877013
          x4 |   -.259761
          x5 |   .0455692
          x6 |  -.2089932
          x7 |   .0230332
         x90 |    .127256
         x91 |  -.1212318
         x92 |   .0972184
         x93 |   .0481437
         x94 |  -.1060476
         x95 |   .0105288
       _cons |   .6347736
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408      .171      .101       .02       .04     .0674     .0961      .141      .226      .332      .447      .554
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .265       .12     .0589     .0589       .13      .162       .26      .354       .41      .613      .613
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500      .189      .111       .02     .0421     .0698      .105      .158      .255      .363      .521      .613
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .5187628     -.0513715     -.1026581       .500414      1.005638  |
   3 |        i1.x2      .0108696      .0118443     -.0009748     -.0090693      .1074803      .9264252  |
   4 |        i1.x3      .0217391      .0264241     -.0046849     -.0296547      .1579827       .833697  |
   5 |           x4      .4347826      .4476614     -.0128788     -.0258872      .4974957      1.002336  |
   6 |           x5      25.46739      25.56132     -.0939329     -.0143613      6.540702      .6467528  |
   7 |           x6      11.86957      12.03336     -.1637986     -.0787938      2.078827      .5461046  |
   8 |           x7      6.858696      6.780636      .0780596      .0231965       3.36514      1.144354  |
   9 |          x90      .0972024      .0722594       .024943      .0245696      1.015196      .8581527  |
  10 |          x91     -.0890157     -.0683611     -.0206546     -.0213649      .9667549      .9389306  |
  11 |          x92      .0453787      .0233094      .0220693      .0220814      .9994496      1.130348  |
  12 |          x93      .0865687      .0787137       .007855      .0082006      .9578498      .9405747  |
  13 |          x94     -.1299173      -.108698     -.0212192     -.0208471      1.017851      .7927287  |
  14 |          x95     -.0807251     -.0823446      .0016195      .0016799      .9640659      .8768564  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0002940123
  Mean absolute standardized diff.
  .0294126496
  Maximum absolute standardized diff.
  .1026580891
  C.V. of matching weights:
  .7165198319
  S.D. of matching weights:
  .7165198319
  Skewness of matching weights:
  .09065572
  Kurtosis of matching weights:
  .017132426

. 
. 
. // * WEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps pooledvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00008909  
Iteration 1:   f(p) =  .00006006  
Iteration 2:   f(p) =  .00005798  
Iteration 3:   f(p) =  .00005798  
Iteration 4:   f(p) =  .00005797  
Iteration 5:   f(p) =  .00005722  
Iteration 6:   f(p) =  .00004799  
Iteration 7:   f(p) =  .00002163  
Iteration 8:   f(p) =  .00001682  
Iteration 9:   f(p) =  .00001603  
Iteration 10:  f(p) =  .00001599  
Iteration 11:  f(p) =  .00001599  
(switching technique to nr)
Iteration 12:  f(p) =  .00001598  (not concave)
Iteration 13:  f(p) =  4.571e-06  (not concave)
Iteration 14:  f(p) =  1.592e-06  (not concave)
Iteration 15:  f(p) =  8.516e-07  (not concave)
Iteration 16:  f(p) =  3.286e-07  (not concave)
Iteration 17:  f(p) =  1.745e-07  (not concave)
Iteration 18:  f(p) =  8.936e-08  (not concave)
Iteration 19:  f(p) =  2.836e-08  (not concave)
Iteration 20:  f(p) =  5.115e-09  
Iteration 21:  f(p) =  1.153e-10  
Iteration 22:  f(p) =  1.212e-14  
Iteration 23:  f(p) =  2.740e-25  
(switching technique to bfgs)
Iteration 24:  f(p) =  2.405e-27  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.502416
        1.x2 |  -2.525399
        1.x3 |  -.8191009
          x4 |  -.3236397
          x5 |   .0771198
          x6 |  -.4884764
          x7 |   .0722686
         x90 |   .0234165
         x91 |   .0257849
         x92 |   .2152141
         x93 |  -.0285372
         x94 |  -.3393877
         x95 |  -.0407881
       _cons |   3.075437
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .957      .762      .953      1.26      1.49       1.8      2.11       2.8      5.77        13
         |       408      .999      .435       .78      .784      .792      .809      .864      .985      1.32      2.65      6.64
         |       408       .16      .168     .0019    .00635     .0172      .037     .0987      .209      .409      .707      .883
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.63      .415      .415      .642      .808      1.35       2.6      3.88      9.17      9.17
         |        92      1.02      .828      .188      .188      .318      .405      .739      1.47      1.96      5.21      5.21
         |        92      .288      .192     .0336     .0336     .0892      .119      .237      .431       .55      .931      .931
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.11      .415      .548      1.06      1.41      1.78      2.17      2.99      6.49        13
         |       500         1      .528      .188      .273      .782      .799      .859      1.05      1.49       2.9      6.64
         |       500      .183       .18     .0019    .00715       .02     .0472      .117      .263      .446      .717      .931
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6695182      .6695182      1.44e-15      3.07e-15      .4706262      1.004328  |
   3 |        i1.x2      .0220668      .0220668     -1.88e-14     -1.28e-13      .1469756      1.004328  |
   4 |        i1.x3      .0366911      .0366911     -2.61e-14     -1.39e-13       .188098      1.004328  |
   5 |           x4       .485133       .485133      1.70e-13      3.39e-13      .5000334      1.004328  |
   6 |           x5      26.17889      26.17889      6.18e-13      9.91e-14      6.237853      .6789026  |
   7 |           x6      12.63449      12.63449     -1.58e-12     -6.76e-13      2.338005      .5740656  |
   8 |           x7      6.755243      6.755243     -6.36e-13     -1.89e-13      3.370937      1.187219  |
   9 |          x90     -.0520316     -.0520316      3.49e-14      3.34e-14      1.046128      1.163666  |
  10 |          x91      .0164856      .0164856      7.94e-14      8.18e-14      .9705717      .9930954  |
  11 |          x92     -.0021645     -.0021645     -2.62e-15     -2.58e-15      1.017927      1.359802  |
  12 |          x93      .0456916      .0456916     -2.14e-13     -2.22e-13      .9636159       .883731  |
  13 |          x94     -.0910006     -.0910006     -2.10e-13     -2.07e-13      1.014116      .7859289  |
  14 |          x95     -.0894588     -.0894588      6.18e-13      6.32e-13       .978942      .8236876  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  8.32408e-28
  Mean absolute standardized diff.
  2.11649e-13
  Maximum absolute standardized diff.
  6.76199e-13
  C.V. of matching weights:
  .5270998694
  S.D. of matching weights:
  .5284997369
  Skewness of matching weights:
  .2026515012
  Kurtosis of matching weights:
  .0762370775

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate cbps ipw pooledvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .02296546  
Iteration 1:   f(p) =  .01893921  
Iteration 2:   f(p) =  .01888779  
Iteration 3:   f(p) =  .01864991  
Iteration 4:   f(p) =  .01807801  
Iteration 5:   f(p) =  .01796175  
Iteration 6:   f(p) =  .01796123  
Iteration 7:   f(p) =  .01795278  
Iteration 8:   f(p) =  .01785278  
Iteration 9:   f(p) =   .0178181  
Iteration 10:  f(p) =  .01781755  
Iteration 11:  f(p) =  .01781528  
(switching technique to nr)
Iteration 12:  f(p) =  .01780001  
Iteration 13:  f(p) =  .01777185  
Iteration 14:  f(p) =  .01777184  
Iteration 15:  f(p) =  .01777184  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.226645
        1.x2 |  -1.653762
        1.x3 |  -.7776876
          x4 |  -.3532491
          x5 |   .0574629
          x6 |  -.2583005
          x7 |   .0080439
         x90 |   .0890276
         x91 |  -.1706881
         x92 |   .1765097
         x93 |   .1136718
         x94 |  -.1271347
         x95 |   .0214704
       _cons |   1.180155
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .569      .882      1.05      1.37      1.58       1.9      2.22      2.65      3.75      5.18
         |       408      .999      .194      .816      .827      .851      .879      .934      1.05      1.23      1.66      2.64
         |       408       .17      .119     .0115     .0244     .0519     .0816      .136      .228      .345      .513      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.26      .471      .471       .86      1.14      1.52      2.69      3.33      7.65      7.65
         |        92      1.02      .639      .297      .297      .465      .547      .791      1.35      1.75      4.34      4.34
         |        92      .278      .144      .048      .048      .119      .154      .264      .381      .448      .702      .702
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      .744      .471       .68      1.21      1.51      1.87      2.25      2.77      4.93      7.65
         |       500         1      .324      .297      .426      .821      .864      .931      1.07      1.35      2.08      4.34
         |       500       .19      .131     .0115     .0257     .0544     .0922      .151      .268      .394      .595      .702
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6415953      .6970127     -.0554173     -.1194311      .4640107      1.093567  |
   3 |        i1.x2      .0142909      .0234703     -.0091794     -.0628462      .1460619      .6172753  |
   4 |        i1.x3      .0334441      .0380925     -.0046484     -.0245369      .1894462      .8860314  |
   5 |           x4      .4881571      .4821182      .0060389      .0120785       .499973       1.00505  |
   6 |           x5      25.72258      26.31855     -.5959644     -.1000426      5.957105      .7659019  |
   7 |           x6      12.33189       12.8994     -.5675068     -.2533225      2.240254      .6135511  |
   8 |           x7      6.911084      6.688832       .222252      .0657612      3.379685      1.211887  |
   9 |          x90     -.0440388     -.0251309      -.018908     -.0185767       1.01783      1.120774  |
  10 |          x91      .0661735     -.0257224      .0918959      .0936219      .9815644      .9753854  |
  11 |          x92     -.0382008     -.0020298     -.0361709     -.0355957      1.016161       1.20721  |
  12 |          x93      .0014101      .0645199     -.0631098     -.0653399      .9658703      .9125525  |
  13 |          x94     -.1442668     -.0285682     -.1156986     -.1166712      .9916637      .8216037  |
  14 |          x95     -.1053626       -.07164     -.0337226     -.0344811      .9780038       .803947  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0025726925
  Mean absolute standardized diff.
  .0771004086
  Maximum absolute standardized diff.
  .2533225075
  C.V. of matching weights:
  .3236892358
  S.D. of matching weights:
  .3244154091
  Skewness of matching weights:
  .1499732973
  Kurtosis of matching weights:
  .0569705853

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps pooledvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.662e-06  
Iteration 8:   f(p) =  1.352e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.347e-06  
(switching technique to nr)
Iteration 12:  f(p) =  1.337e-06  (not concave)
Iteration 13:  f(p) =  8.478e-08  
Iteration 14:  f(p) =  1.602e-08  
Iteration 15:  f(p) =  7.712e-10  
Iteration 16:  f(p) =  5.651e-13  
Iteration 17:  f(p) =  5.938e-20  
Iteration 18:  f(p) =  8.653e-26  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447047
        1.x2 |  -1.546891
        1.x3 |  -.4710623
          x4 |  -.3822539
          x5 |   .0635824
          x6 |   -.243227
          x7 |   .0477027
         x90 |   .1334992
         x91 |  -.1336117
         x92 |   .1522937
         x93 |   .0757732
         x94 |  -.1016171
         x95 |  -.0383391
       _cons |   .6265763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512231      2.63e-12      5.28e-12      .4978686      1.004328  |
   3 |        i1.x2      .0114039      .0114039      2.63e-13      2.47e-12      .1062323      1.004328  |
   4 |        i1.x3      .0240637      .0240637      3.94e-13      2.57e-12      .1533251      1.004328  |
   5 |           x4      .4218861      .4218861      7.43e-13      1.50e-12       .494112      1.004328  |
   6 |           x5      25.44699      25.44699      1.28e-11      1.92e-12      6.665558      .6144662  |
   7 |           x6      11.84757      11.84757      1.34e-11      6.54e-12      2.042375      .5982513  |
   8 |           x7      7.015422      7.015422     -1.00e-11     -3.00e-12      3.345323      1.161761  |
   9 |          x90      .0839738      .0839738     -1.05e-14     -1.02e-14        1.0258      .8505325  |
  10 |          x91     -.0648837     -.0648837      3.35e-12      3.56e-12       .941106      .9922891  |
  11 |          x92      .0575388      .0575388     -1.11e-12     -1.12e-12      .9892732      1.118263  |
  12 |          x93      .1016523      .1016523     -1.98e-12     -2.11e-12      .9410813      1.012572  |
  13 |          x94     -.1252265     -.1252265      1.63e-12      1.59e-12      1.026859      .7576623  |
  14 |          x95     -.1044649     -.1044649      6.17e-13      6.40e-13      .9627688      .8646431  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  2.32907e-24
  Mean absolute standardized diff.
  2.48484e-12
  Maximum absolute standardized diff.
  6.53792e-12
  C.V. of matching weights:
  .9311531747
  S.D. of matching weights:
  .9276065877
  Skewness of matching weights:
  .1133761595
  Kurtosis of matching weights:
  .0229016822

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps ipw pooledvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00053487  
Iteration 1:   f(p) =  .00021848  
Iteration 2:   f(p) =  .00021162  
Iteration 3:   f(p) =  .00021159  
Iteration 4:   f(p) =  .00021001  
Iteration 5:   f(p) =  .00019724  
Iteration 6:   f(p) =   .0001771  
Iteration 7:   f(p) =  .00017502  
Iteration 8:   f(p) =  .00017501  
Iteration 9:   f(p) =  .00017499  
Iteration 10:  f(p) =  .00017465  
Iteration 11:  f(p) =  .00017249  
(switching technique to nr)
Iteration 12:  f(p) =  .00017245  
Iteration 13:  f(p) =  .00017215  
Iteration 14:  f(p) =  .00017215  
Iteration 15:  f(p) =  .00017215  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.393749
        1.x2 |  -1.561041
        1.x3 |  -.4600041
          x4 |  -.3846168
          x5 |   .0606092
          x6 |  -.2482012
          x7 |   .0443349
         x90 |   .1306488
         x91 |  -.1205474
         x92 |   .1453092
         x93 |    .070476
         x94 |  -.1075638
         x95 |  -.0307916
       _cons |   .7598453
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.12     .0834      .213      .379      .703       1.2      2.44       4.6      9.79      16.6
         |       408      .995      1.01     .0445      .124      .212      .364      .618      1.22      2.32      4.57      7.11
         |       408      .161      .119    .00985     .0269     .0454     .0753      .121      .214      .341      .506      .614
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .153     .0459     .0459     .0999      .133      .243      .375      .464      .695      .695
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.92     .0834      .215      .425      .799      1.47      2.33       4.1       9.5      16.6
         |       500      .996      .916     .0445      .124      .228      .404       .82      1.04      2.07      4.54      7.11
         |       500      .181      .133    .00985     .0269     .0484     .0819      .137      .247       .39      .596      .695
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4553292      -.004106      -.008242       .498186      1.002774  |
   3 |        i1.x2      .0114039      .0111962      .0002076      .0019689      .1054487      1.022737  |
   4 |        i1.x3      .0240637      .0242798     -.0002161     -.0014043      .1538723      .9956099  |
   5 |           x4      .4218861      .4235251      -.001639     -.0033156       .494322      1.003286  |
   6 |           x5      25.44699      25.39436      .0526224      .0078927      6.667188      .6141311  |
   7 |           x6      11.84757      11.82507      .0224988      .0110125      2.043017      .5978372  |
   8 |           x7      7.015422      6.978162        .03726       .011128      3.348319      1.159171  |
   9 |          x90      .0839738      .0816058       .002368      .0023047      1.027479      .8472278  |
  10 |          x91     -.0648837     -.0554765     -.0094072     -.0099831      .9423132      .9892043  |
  11 |          x92      .0575388      .0526517      .0048871      .0049455      .9881782      1.121369  |
  12 |          x93      .1016523        .09771      .0039424      .0041911      .9406607      1.013686  |
  13 |          x94     -.1252265      -.131327      .0061006      .0059387       1.02725      .7569926  |
  14 |          x95     -.1044649     -.1015494     -.0029155     -.0030291      .9625009      .8652191  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  3.24223e-06
  Mean absolute standardized diff.
  .0057966356
  Maximum absolute standardized diff.
  .0111279635
  C.V. of matching weights:
  .9194965222
  S.D. of matching weights:
  .9158852844
  Skewness of matching weights:
  .1127627417
  Kurtosis of matching weights:
  .0230489168

. 
. // Other objective functions
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance difficult
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00026309  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00001126  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  4.733e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.762e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.968e-21  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  4.929e-33  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  4.437e-33  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  4.120e-33  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.603e-33  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.521e-33  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.788e-34  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  8.574e-34  (backed up)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298301
        1.x2 |   -1.62991
        1.x3 |  -.4511738
          x4 |  -.3553036
          x5 |     .07158
          x6 |  -.2773324
          x7 |   .0371349
         x90 |   .1283826
         x91 |  -.0952385
         x92 |   .1409152
         x93 |   .0743039
         x94 |  -.1419192
         x95 |  -.0201501
       _cons |   1.248956
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.18     .0766      .195      .376      .696      1.22      2.44      4.57      9.98      20.7
         |       408      .998      1.06     .0408      .117      .208       .36       .63      1.18      2.31      4.35      10.6
         |       408       .22      .145     .0139     .0389     .0671      .111      .179      .289      .444      .601      .786
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .351      .168      .068      .068      .152      .203      .322      .485      .552       .79       .79
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.98     .0766      .203      .418      .776       1.5      2.35      4.17      9.35      20.7
         |       500      .998      .961     .0408      .117      .226      .402      .852      1.07      1.96      4.35      10.6
         |       500      .244      .158     .0139      .039     .0719      .119      .203      .332      .494      .685       .79
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231       .487981     -.0367579     -.0735301      .4999024      .9953452  |
   3 |        i1.x2      .0114039      .0101189      .0012849      .0126869      .1012806      1.130392  |
   4 |        i1.x3      .0240637      .0243904     -.0003267     -.0021194      .1541516       .991207  |
   5 |           x4      .4218861      .4077073      .0141788      .0288106      .4921399      1.014377  |
   6 |           x5      25.44699      25.93854     -.4915548     -.0719755      6.829476      .5820455  |
   7 |           x6      11.84757      11.77832      .0692519      .0336233      2.059639      .5870658  |
   8 |           x7      7.015422      6.877177      .1382443      .0411586      3.358822      1.150412  |
   9 |          x90      .0839738      .0558962      .0280776      .0273707      1.025826      .8505932  |
  10 |          x91     -.0648837     -.0314162     -.0334675     -.0355197       .942223      .9896463  |
  11 |          x92      .0575388      .0508005      .0067383      .0068466      .9841768      1.132825  |
  12 |          x93      .1016523      .1109109     -.0092586     -.0098717         .9379      1.021042  |
  13 |          x94     -.1252265     -.1752569      .0500305       .047919      1.044064      .7291541  |
  14 |          x95     -.1044649      -.104167     -.0002979     -.0003101      .9607217      .8690485  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.53257e-07
  Mean absolute standardized diff.
  .0301340146
  Maximum absolute standardized diff.
  .0735301422
  C.V. of matching weights:
  .963205406
  S.D. of matching weights:
  .961247478
  Skewness of matching weights:
  .1583249611
  Kurtosis of matching weights:
  .0508875834

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet sd_sq treatvariance difficult
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .01944489  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01784035  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01032757  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00864463  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00309574  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00232235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00091852  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00071553  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00032888  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013226  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00006152  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00004718  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002689  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00002262  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002081  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001998  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  .00001282  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  .00001172  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  .00001048  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  8.671e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  7.927e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  7.374e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  6.900e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  6.153e-06  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  5.753e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  5.501e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  5.209e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  5.180e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  5.179e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 34:  f(p) =  5.179e-06  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  4.398e-06  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  4.273e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  4.184e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  3.832e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  3.682e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  f(p) =  3.499e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  f(p) =  3.318e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  f(p) =  3.153e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  f(p) =  3.041e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  f(p) =  2.857e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  f(p) =  2.695e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  f(p) =  2.269e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  f(p) =  2.002e-06  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  f(p) =  1.416e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  f(p) =  2.825e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  f(p) =  2.063e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  f(p) =  6.982e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  f(p) =  2.797e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  f(p) =  5.554e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  f(p) =  7.404e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 55:  f(p) =  7.404e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  f(p) =  7.320e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  f(p) =  6.368e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  f(p) =  5.709e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  f(p) =  5.695e-12  (backed up)
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 60:  f(p) =  4.944e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 61:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 62:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 63:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 64:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 65:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 66:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 67:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 68:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 69:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 70:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 71:  f(p) =  4.944e-12  (backed up)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 72:  f(p) =  4.944e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 73:  f(p) =  4.599e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 74:  f(p) =  4.505e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 75:  f(p) =  4.505e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 76:  f(p) =  4.505e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 77:  f(p) =  4.297e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 78:  f(p) =  4.126e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 79:  f(p) =  4.126e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 80:  f(p) =  4.126e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 81:  f(p) =  3.995e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 82:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 83:  f(p) =  3.899e-12  (backed up)
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 84:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 85:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 86:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 87:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 88:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 89:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 90:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 91:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 92:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 93:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 94:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 95:  f(p) =  3.899e-12  (backed up)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 96:  f(p) =  3.899e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 97:  f(p) =  3.799e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 98:  f(p) =  3.795e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 99:  f(p) =  3.795e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 100: f(p) =  3.719e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 101: f(p) =  3.716e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 102: f(p) =  3.716e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 103: f(p) =  3.716e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 104: f(p) =  3.716e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 105: f(p) =  3.657e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 106: f(p) =  3.652e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 107: f(p) =  3.652e-12  (backed up)
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 108: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 109: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 110: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 111: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 112: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 113: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 114: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 115: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 116: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 117: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 118: f(p) =  3.605e-12  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 119: f(p) =  3.605e-12  (backed up)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 120: f(p) =  3.605e-12  (backed up)
convergence not achieved

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = stddiff():^2
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447044
        1.x2 |  -1.546894
        1.x3 |  -.4710681
          x4 |  -.3822578
          x5 |    .063582
          x6 |   -.243227
          x7 |   .0477027
         x90 |   .1334986
         x91 |  -.1336114
         x92 |   .1522938
         x93 |   .0757728
         x94 |  -.1016168
         x95 |  -.0383397
       _cons |   1.396245
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .273      .165     .0204     .0539     .0911      .149      .228      .371      .527      .697      .773
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .423      .188     .0951     .0951      .188       .24      .409      .569      .665      .829      .829
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .301      .179     .0204     .0547     .0992      .161      .251      .415      .582      .762      .829
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512235     -3.77e-07     -7.57e-07      .4978686      1.004328  |
   3 |        i1.x2      .0114039      .0114038      6.35e-08      5.98e-07      .1062321      1.004333  |
   4 |        i1.x3      .0240637      .0240636      1.33e-07      8.64e-07      .1533247      1.004333  |
   5 |           x4      .4218861      .4218856      4.73e-07      9.57e-07       .494112      1.004328  |
   6 |           x5      25.44699      25.44698      3.04e-06      4.56e-07      6.665556      .6144666  |
   7 |           x6      11.84757      11.84757     -4.02e-08     -1.97e-08      2.042375      .5982513  |
   8 |           x7      7.015422      7.015421      5.44e-07      1.63e-07      3.345323      1.161761  |
   9 |          x90      .0839738      .0839734      3.95e-07      3.85e-07        1.0258      .8505323  |
  10 |          x91     -.0648837     -.0648837      2.53e-08      2.69e-08      .9411061      .9922888  |
  11 |          x92      .0575388       .057539     -2.88e-07     -2.91e-07       .989273      1.118263  |
  12 |          x93      .1016523      .1016521      2.41e-07      2.57e-07      .9410814      1.012572  |
  13 |          x94     -.1252265     -.1252263     -2.06e-07     -2.00e-07      1.026859      .7576623  |
  14 |          x95     -.1044649     -.1044655      5.14e-07      5.34e-07      .9627687      .8646432  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  5.22277e-14
  Mean absolute standardized diff.
  4.23741e-07
  Maximum absolute standardized diff.
  9.57275e-07
  C.V. of matching weights:
  .9311524509
  S.D. of matching weights:
  .9276058539
  Skewness of matching weights:
  .1133761002
  Kurtosis of matching weights:
  .0229016566

. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.444e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -373.2561   49.21885    -7.58   0.000    -469.7233   -276.7889
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3424.879   30.82585   111.10   0.000     3364.462    3485.297
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. di _b[POmean:0.treat]
3424.8791

. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752    .0041102      1.338962   1.000571
                  |
               x2 |
               1  |  -.1180374    .0011686      .4133173   1.011157
                  |
               x3 |
               1  |  -.1253201   -.0169419      .5085817   .8975379
                  |
               x4 |  -.1207472    .0136004      .9914484   1.003798
               x5 |  -.1944638     .003179      .8589874   .5855492
               x6 |  -.6542694    .0947099      .4958356   .5643304
               x7 |   .0473848    .0177567      1.160037   1.134687
              x90 |   .1499304    .0348222      .9289414    .817157
              x91 |  -.0833726   -.0675073      .8791918     .96061
              x92 |   .0662245   -.0005441      1.090179   1.148892
              x93 |   .0479737    -.020065      .8926169   .9606022
              x94 |  -.1521926    .0315996      .8686432   .7548902
              x95 |  -.0155155    .0398234      .8285405   .8815991
  -----------------------------------------------------------------

. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw treatvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4574808     -.0062577     -.0125569      .4983432      1.002016  |
   3 |        i1.x2      .0114039      .0104612      .0009427      .0091856       .102624      1.093786  |
   4 |        i1.x3      .0240637      .0241722     -.0001085     -.0007062         .1536      .9999323  |
   5 |           x4      .4218861      .4314162     -.0095301     -.0192417      .4952809      .9986039  |
   6 |           x5      25.44699      25.25275      .1942356      .0287189      6.763337      .5945665  |
   7 |           x6      11.84757      11.67955      .1680205      .0822363      2.043144      .5984287  |
   8 |           x7      7.015422      6.824197      .1912245      .0569439       3.35812      1.151353  |
   9 |          x90      .0839738      .0777469      .0062269      .0060092      1.036221      .8303562  |
  10 |          x91     -.0648837      -.033852     -.0310317      -.032945      .9419239       .990382  |
  11 |          x92      .0575388      .0480591      .0094797      .0096248      .9849204      1.130693  |
  12 |          x93      .1016523      .1032412     -.0015889      -.001701      .9340722      1.031343  |
  13 |          x94     -.1252265     -.1745685      .0493421      .0476679      1.035122      .7439065  |
  14 |          x95     -.1044649     -.1114622      .0069973      .0072928      .9594697      .8717687  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944

. gmatchcall reweight()

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4673913      .4653368      .0020545      .0041146      .4993249      1.009059  |
   3 |        i1.x2      .0108696      .0107485      .0001211      .0011718      .1033261      1.019734  |
   4 |        i1.x3      .0217391      .0242844     -.0025453     -.0166769      .1526231      .9051513  |
   5 |           x4      .4347826      .4280333      .0067493      .0136219      .4954712      1.012313  |
   6 |           x5      25.46739      25.44732      .0200675      .0029485      6.806091      .5905162  |
   7 |           x6      11.86957      11.69122      .1783475      .0873876       2.04088      .5691173  |
   8 |           x7      6.858696      6.797654      .0610413      .0181384      3.365302      1.144312  |
   9 |          x90      .0972024      .0623017      .0349007      .0337983      1.032616      .8240885  |
  10 |          x91     -.0890157     -.0249321     -.0640836     -.0671278      .9546514      .9687584  |
  11 |          x92      .0453787      .0459298     -.0005512     -.0005569      .9896794      1.158638  |
  12 |          x93      .0865687      .1054548     -.0188862     -.0199583      .9462793      .9687505  |
  13 |          x94     -.1299173     -.1613151      .0313979      .0303219      1.035483      .7612936  |
  14 |          x95     -.0807251     -.1181964      .0374713      .0390906      .9585753      .8890772  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000943494
  Mean absolute standardized diff.
  .0257625916
  Maximum absolute standardized diff.
  .0873875756
  C.V. of matching weights:
  0
  S.D. of matching weights:
  0
  Skewness of matching weights:
  .
  Kurtosis of matching weights:
  .

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet ipw averagevariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4574808     -.0062577     -.0125569      .4983432      1.002016  |
   3 |        i1.x2      .0114039      .0104612      .0009427      .0091856       .102624      1.093786  |
   4 |        i1.x3      .0240637      .0241722     -.0001085     -.0007062         .1536      .9999323  |
   5 |           x4      .4218861      .4314162     -.0095301     -.0192417      .4952809      .9986039  |
   6 |           x5      25.44699      25.25275      .1942356      .0287189      6.763337      .5945665  |
   7 |           x6      11.84757      11.67955      .1680205      .0822363      2.043144      .5984287  |
   8 |           x7      7.015422      6.824197      .1912245      .0569439       3.35812      1.151353  |
   9 |          x90      .0839738      .0777469      .0062269      .0060092      1.036221      .8303562  |
  10 |          x91     -.0648837      -.033852     -.0310317      -.032945      .9419239       .990382  |
  11 |          x92      .0575388      .0480591      .0094797      .0096248      .9849204      1.130693  |
  12 |          x93      .1016523      .1032412     -.0015889      -.001701      .9340722      1.031343  |
  13 |          x94     -.1252265     -.1745685      .0493421      .0476679      1.035122      .7439065  |
  14 |          x95     -.1044649     -.1114622      .0069973      .0072928      .9594697      .8717687  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001928438
  Mean absolute standardized diff.
  .0242177171
  Maximum absolute standardized diff.
  .0822362622
  C.V. of matching weights:
  .9581503909
  S.D. of matching weights:
  .9542003068
  Skewness of matching weights:
  .1299791235
  Kurtosis of matching weights:
  .0329058944

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], ate aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  2.423e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |  -332.1348   56.53175    -5.88   0.000     -442.935   -221.3346
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3453.029    20.1341   171.50   0.000     3413.567    3492.491
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate ipw treatvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .572      .862      1.06      1.36      1.59       1.9      2.23      2.72      3.72      5.29
         |       408      .999      .196      .823      .836      .852      .877      .929      1.03      1.26      1.65      2.49
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.31      .475      .475      .807      1.08      1.51      2.47      3.54      8.32      8.32
         |        92      1.02      .684      .274      .274      .443      .535      .795       1.4      1.78      4.73      4.73
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .76      .475      .645      1.19      1.51      1.87      2.26      2.83      4.93      8.32
         |       500         1      .341      .274      .398      .832      .866      .925      1.06      1.39      2.29      4.73
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .6613089      .6933653     -.0320564     -.0691239      .4637537      1.058036  |
   3 |        i1.x2      .0128589      .0239773     -.0111184     -.0758638      .1465574      .5447519  |
   4 |        i1.x3      .0265737      .0393435     -.0127698     -.0676144      .1888625      .6873677  |
   5 |           x4      .4958234      .4853442      .0104792      .0209545      .5000924      1.005121  |
   6 |           x5      25.79221      26.26742     -.4752185     -.0797142      5.961531      .7434191  |
   7 |           x6      12.37135      12.88246     -.5111083     -.2278712       2.24297      .6063944  |
   8 |           x7      6.760858      6.737452       .023406       .006941      3.372117      1.194134  |
   9 |          x90     -.1082151      -.017539     -.0906761     -.0889061      1.019909      1.121318  |
  10 |          x91       .033412     -.0122333      .0456452      .0466881      .9776621      .9566022  |
  11 |          x92      .0165767     -.0117433        .02832      .0278871      1.015524      1.209921  |
  12 |          x93      .0109477      .0569505     -.0460028     -.0475772      .9669081      .9220023  |
  13 |          x94     -.1467208     -.0286143     -.1181065     -.1193869      .9892758      .8106047  |
  14 |          x95     -.0857581     -.0773517     -.0084064     -.0085769      .9801209      .7990227  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0027535352
  Mean absolute standardized diff.
  .0682388595
  Maximum absolute standardized diff.
  .2278711742
  C.V. of matching weights:
  .3403902484
  S.D. of matching weights:
  .3414490721
  Skewness of matching weights:
  .1624622214
  Kurtosis of matching weights:
  .0662787313

. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.908e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |   321.4309   62.35166     5.16   0.000     199.2239    443.6379
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3138.003   59.50596    52.73   0.000     3021.374    3254.633
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.299227   .2371935     5.48   0.000     .8343367    1.764118
                        |
                     x2 |
                     1  |   1.630014    .746001     2.19   0.029     .1678787    3.092149
                        |
                     x3 |
                     1  |   .4513753   .5770312     0.78   0.434    -.6795851    1.582336
                     x4 |   .3551911    .204881     1.73   0.083    -.0463684    .7567506
                     x5 |   -.058452   .0195046    -3.00   0.003    -.0966803   -.0202237
                     x6 |   .2821622    .049775     5.67   0.000      .184605    .3797195
                     x7 |  -.0332008   .0279849    -1.19   0.235    -.0880501    .0216486
                    x90 |  -.1276778   .0907109    -1.41   0.159     -.305468    .0501124
                    x91 |   .0961159   .0916737     1.05   0.294    -.0835612     .275793
                    x92 |  -.1400043   .0976573    -1.43   0.152    -.3314091    .0514004
                    x93 |  -.0734557   .0916967    -0.80   0.423     -.253178    .1062665
                    x94 |   .1435742   .0862727     1.66   0.096    -.0255172    .3126656
                    x95 |   .0212452   .0898768     0.24   0.813    -.1549102    .1974006
                  _cons |   -1.24872   .6712769    -1.86   0.063    -2.564399    .0669587
-----------------------------------------------------------------------------------------

. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ateu ipw treatvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .398      .881      1.17      1.44      1.68      1.96      2.23      2.48      2.83      3.24
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.62      .218      .218      .607      .827      1.32      2.63      3.86      9.94      9.94
         |        92      1.03      .852     .0953     .0953      .305      .421      .745       1.5      1.98      5.65      5.65
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .78      .218      .418      1.22       1.6      1.94      2.27      2.59      4.66      9.94
         |       500         1      .364     .0953       .25      .813         1         1         1         1      2.54      5.65
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------

. 
. // tradeoff between CBPS-like balance and variance in weights
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.662e-06  
Iteration 8:   f(p) =  1.352e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.347e-06  
(switching technique to nr)
Iteration 12:  f(p) =  1.337e-06  (not concave)
Iteration 13:  f(p) =  8.478e-08  
Iteration 14:  f(p) =  1.602e-08  
Iteration 15:  f(p) =  7.712e-10  
Iteration 16:  f(p) =  5.651e-13  
Iteration 17:  f(p) =  5.938e-20  
Iteration 18:  f(p) =  8.653e-26  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447047
        1.x2 |  -1.546891
        1.x3 |  -.4710623
          x4 |  -.3822539
          x5 |   .0635824
          x6 |   -.243227
          x7 |   .0477027
         x90 |   .1334992
         x91 |  -.1336117
         x92 |   .1522937
         x93 |   .0757732
         x94 |  -.1016171
         x95 |  -.0383391
       _cons |   .6265763
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512231      2.63e-12      5.28e-12      .4978686      1.004328  |
   3 |        i1.x2      .0114039      .0114039      2.63e-13      2.47e-12      .1062323      1.004328  |
   4 |        i1.x3      .0240637      .0240637      3.94e-13      2.57e-12      .1533251      1.004328  |
   5 |           x4      .4218861      .4218861      7.43e-13      1.50e-12       .494112      1.004328  |
   6 |           x5      25.44699      25.44699      1.28e-11      1.92e-12      6.665558      .6144662  |
   7 |           x6      11.84757      11.84757      1.34e-11      6.54e-12      2.042375      .5982513  |
   8 |           x7      7.015422      7.015422     -1.00e-11     -3.00e-12      3.345323      1.161761  |
   9 |          x90      .0839738      .0839738     -1.05e-14     -1.02e-14        1.0258      .8505325  |
  10 |          x91     -.0648837     -.0648837      3.35e-12      3.56e-12       .941106      .9922891  |
  11 |          x92      .0575388      .0575388     -1.11e-12     -1.12e-12      .9892732      1.118263  |
  12 |          x93      .1016523      .1016523     -1.98e-12     -2.11e-12      .9410813      1.012572  |
  13 |          x94     -.1252265     -.1252265      1.63e-12      1.59e-12      1.026859      .7576623  |
  14 |          x95     -.1044649     -.1044649      6.17e-13      6.40e-13      .9627688      .8646431  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  2.32907e-24
  Mean absolute standardized diff.
  2.48484e-12
  Maximum absolute standardized diff.
  6.53792e-12
  C.V. of matching weights:
  .9311531747
  S.D. of matching weights:
  .9276065877
  Skewness of matching weights:
  .1133761595
  Kurtosis of matching weights:
  .0229016822

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvopt(1 .75 6)
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
Warning: cvopt does not appear to substantially affect the reults with fctn=cbps. Consider switching to fctn=sd_sq or mean_sd_sq
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .17799586  
Iteration 1:   f(p) =  .17799428  (backed up)
Iteration 2:   f(p) =  .17798375  
Iteration 3:   f(p) =  .17798365  
Iteration 4:   f(p) =  .17798365  
Iteration 5:   f(p) =  .17798364  
Iteration 6:   f(p) =  .17798171  
Iteration 7:   f(p) =     .17798  
Iteration 8:   f(p) =  .17797995  
Iteration 9:   f(p) =  .17797995  
Iteration 10:  f(p) =  .17797995  
Iteration 11:  f(p) =  .17797995  
(switching technique to nr)
Iteration 12:  f(p) =  .17797989  
Iteration 13:  f(p) =  .17797853  
Iteration 14:  f(p) =  .17797852  
Iteration 15:  f(p) =  .17797852  
Iteration 16:  f(p) =  .17797852  (backed up)

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(CV-.75)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |   -1.44703
        1.x2 |  -1.546957
        1.x3 |  -.4711251
          x4 |  -.3822612
          x5 |    .063581
          x6 |  -.2432253
          x7 |    .047703
         x90 |    .133496
         x91 |  -.1336043
         x92 |   .1522877
         x93 |   .0757711
         x94 |  -.1016181
         x95 |  -.0383358
       _cons |   .6265859
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512254     -2.28e-06     -4.58e-06      .4978687      1.004327  |
   3 |        i1.x2      .0114039      .0114028      1.10e-06      .0000103      .1062282      1.004424  |
   4 |        i1.x3      .0240637      .0240619      1.83e-06      .0000119      .1533204      1.004402  |
   5 |           x4      .4218861      .4218858      3.47e-07      7.02e-07       .494112      1.004328  |
   6 |           x5      25.44699      25.44699     -7.28e-08     -1.09e-08      6.665551      .6144678  |
   7 |           x6      11.84757      11.84758     -7.96e-06     -3.90e-06      2.042376      .5982507  |
   8 |           x7      7.015422       7.01543     -8.81e-06     -2.63e-06      3.345324       1.16176  |
   9 |          x90      .0839738      .0839704      3.43e-06      3.35e-06        1.0258      .8505319  |
  10 |          x91     -.0648837     -.0648782     -5.53e-06     -5.88e-06      .9411067      .9922873  |
  11 |          x92      .0575388      .0575326      6.12e-06      6.18e-06      .9892727      1.118264  |
  12 |          x93      .1016523      .1016513      1.04e-06      1.10e-06      .9410824      1.012569  |
  13 |          x94     -.1252265     -.1252272      7.45e-07      7.25e-07      1.026858      .7576633  |
  14 |          x95     -.1044649     -.1044615     -3.48e-06     -3.62e-06      .9627686      .8646435  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  1.10886e-12
  Mean absolute standardized diff.
  4.22486e-06
  Maximum absolute standardized diff.
  .0000119088
  C.V. of matching weights:
  .93114682
  S.D. of matching weights:
  .927600213
  Skewness of matching weights:
  .1133752165
  Kurtosis of matching weights:
  .0229012841

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet cbps treatvariance cvopt(1 .50 6)
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
Warning: cvopt does not appear to substantially affect the reults with fctn=cbps. Consider switching to fctn=sd_sq or mean_sd_sq
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.04895  
Iteration 2:   f(p) = -411.28759  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
(setting technique to bfgs)
Iteration 0:   f(p) =  .01564235  
Iteration 1:   f(p) =  .01563174  
Iteration 2:   f(p) =  .01563166  
Iteration 3:   f(p) =  .01563166  
Iteration 4:   f(p) =  .01563166  
Iteration 5:   f(p) =  .01563163  
Iteration 6:   f(p) =  .01563123  
Iteration 7:   f(p) =  .01562716  
Iteration 8:   f(p) =  .01562646  
Iteration 9:   f(p) =  .01562645  
Iteration 10:  f(p) =  .01562645  
Iteration 11:  f(p) =  .01562645  
(switching technique to nr)
Iteration 12:  f(p) =  .01562645  
Iteration 13:  f(p) =  .01562501  
Iteration 14:  f(p) =    .015625  
Iteration 15:  f(p) =    .015625  
Iteration 16:  f(p) =    .015625  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = CBPS + 1*abs(CV-.5)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447046
        1.x2 |  -1.546894
        1.x3 |  -.4710656
          x4 |  -.3822545
          x5 |   .0635823
          x6 |  -.2432271
          x7 |   .0477027
         x90 |   .1334992
         x91 |  -.1336111
         x92 |   .1522936
         x93 |   .0757731
         x94 |  -.1016171
         x95 |  -.0383388
       _cons |    .626579
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4512233     -1.29e-07     -2.59e-07      .4978686      1.004328  |
   3 |        i1.x2      .0114039      .0114038      5.58e-08      5.26e-07      .1062321      1.004333  |
   4 |        i1.x3      .0240637      .0240636      8.93e-08      5.82e-07      .1533248      1.004332  |
   5 |           x4      .4218861      .4218861      2.19e-08      4.44e-08       .494112      1.004328  |
   6 |           x5      25.44699      25.44698      1.14e-06      1.71e-07      6.665558      .6144663  |
   7 |           x6      11.84757      11.84757      1.01e-07      4.93e-08      2.042375      .5982513  |
   8 |           x7      7.015422      7.015422     -2.88e-07     -8.60e-08      3.345323      1.161761  |
   9 |          x90      .0839738      .0839738      5.56e-08      5.42e-08        1.0258      .8505324  |
  10 |          x91     -.0648837     -.0648833     -3.76e-07     -4.00e-07      .9411061      .9922889  |
  11 |          x92      .0575388      .0575386      1.37e-07      1.39e-07      .9892731      1.118263  |
  12 |          x93      .1016523      .1016523      5.48e-08      5.82e-08      .9410813      1.012572  |
  13 |          x94     -.1252265     -.1252265      1.98e-08      1.93e-08      1.026859      .7576623  |
  14 |          x95     -.1044649     -.1044647     -2.85e-07     -2.96e-07      .9627688      .8646431  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  2.14341e-15
  Mean absolute standardized diff.
  2.06450e-07
  Maximum absolute standardized diff.
  5.82112e-07
  C.V. of matching weights:
  .9311529055
  S.D. of matching weights:
  .9276063119
  Skewness of matching weights:
  .113376139
  Kurtosis of matching weights:
  .0229016766

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvopt(1 .75 6)
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .00118407  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00047827  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00006974  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00004509  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.893e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.962e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  1.695e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  6.547e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  2.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.307e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.558e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  7.610e-08  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  6.398e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  2.236e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  1.796e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  1.364e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  1.276e-09  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  9.084e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  5.549e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.143e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  3.836e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  3.371e-10  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  7.528e-13  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  3.621e-14  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  3.015e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  2.545e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.952e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.884e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.877e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.871e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  1.406e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  1.294e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  1.283e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  1.281e-16  
numerical derivatives are approximate
flat or discontinuous region encountered
BFGS stepping has contracted, resetting BFGS Hessian
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  8.378e-17  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  6.059e-17  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(CV-.75)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.249359
        1.x2 |  -1.626167
        1.x3 |   -.480335
          x4 |  -.2620107
          x5 |   .0027239
          x6 |  -.0355859
          x7 |   -.017299
         x90 |   .0149658
         x91 |  -.1033867
         x92 |   .1073471
         x93 |  -.0849274
         x94 |  -.0978388
         x95 |  -.0325096
       _cons |   1.256772
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       1.6      .203      .464       .81      .993      1.32      2.15      4.51      7.27      11.5
         |       408      .995      .748      .106      .281      .439      .534      .665      1.01      2.27      3.43      4.13
         |       408      .409      .144     .0821      .191       .27       .31      .359       .46      .657      .743      .777
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .518      .155      .235      .235      .329      .369      .544      .661      .727      .761      .761
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.45      .203       .48      .855      1.05       1.5      2.23      3.93      7.26      11.5
         |       500      .996      .676      .106      .285      .461      .557      .771         1      2.16      3.41      4.13
         |       500      .429      .152     .0821      .193      .278      .318      .373      .576      .669      .754      .777
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .4707037     -.0194806     -.0390257      .4991726      .9981969  |
   3 |        i1.x2      .0114039      .0096564      .0017475      .0175742      .0994351      1.183986  |
   4 |        i1.x3      .0240637      .0211209      .0029428      .0202051      .1456466      1.140823  |
   5 |           x4      .4218861      .5009078     -.0790217     -.1580213        .50007      .9798184  |
   6 |           x5      25.44699      24.58965      .8573351      .1410292      6.079132      .7625045  |
   7 |           x6      11.84757       12.4132     -.5656277     -.2649122      2.135152      .5476945  |
   8 |           x7      7.015422      6.414085      .6013365      .1783132       3.37236      1.145332  |
   9 |          x90      .0839738      .0118324      .0721414      .0700287      1.030169      .8427132  |
  10 |          x91     -.0648837     -.0647897      -.000094     -.0000988       .951822      .9652767  |
  11 |          x92      .0575388      .0752692     -.0177304       -.01771      1.001155      1.085538  |
  12 |          x93      .1016523     -.0430683      .1447206      .1495886      .9674578      .9504488  |
  13 |          x94     -.1252265     -.1245777     -.0006488      -.000653      .9935919      .8186894  |
  14 |          x95     -.1044649     -.0773651     -.0270998     -.0280067       .967619      .8544649  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0000276121
  Mean absolute standardized diff.
  .0834743602
  Maximum absolute standardized diff.
  .2649121871
  C.V. of matching weights:
  .6784989247
  S.D. of matching weights:
  .6757422836
  Skewness of matching weights:
  .0821280427
  Kurtosis of matching weights:
  .0124375121

. 
. gmatch `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet mean_sd_sq treatvariance cvopt(1 .50 6)
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28929  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
(setting technique to bfgs)
Iteration 0:   f(p) =  .03174366  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01880683  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01499079  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00460016  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00088681  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00069868  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00016284  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00008031  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004972  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003906  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003723  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00002755  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001175  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000104  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  4.104e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  2.518e-06  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  8.956e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  6.250e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.018e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  5.226e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  3.482e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  3.352e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  3.207e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  2.038e-07  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.920e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.812e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.778e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.767e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.767e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.746e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  1.639e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  1.616e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  1.615e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  1.615e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.615e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  1.615e-07  
(switching technique to nr)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  1.608e-07  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  9.150e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  8.189e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  8.037e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  f(p) =  7.887e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  f(p) =  5.407e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 42:  f(p) =  5.354e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 43:  f(p) =  5.169e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 44:  f(p) =  5.011e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 45:  f(p) =  4.109e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 46:  f(p) =  3.836e-08  (not concave)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 47:  f(p) =  3.530e-08  (not concave)
(switching technique to bfgs)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 48:  f(p) =  3.373e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 49:  f(p) =  3.328e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 50:  f(p) =  3.314e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 51:  f(p) =  3.305e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 52:  f(p) =  3.305e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 53:  f(p) =  3.305e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 54:  f(p) =  3.292e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 55:  f(p) =  3.267e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 56:  f(p) =  3.266e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 57:  f(p) =  3.266e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 58:  f(p) =  3.266e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 59:  f(p) =  3.266e-08  

Propensity score model coefficients                Number of obs  =        983
Generalization of IPW/CPBS-type reweigting
Loss = mean(stddiff())^2 + 1*abs(CV-.5)^ 6)
------------------------------------------------------------------------------
             |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.8655475
        1.x2 |  -2.012498
        1.x3 |  -.5331544
          x4 |  -.2009153
          x5 |    .007492
          x6 |  -.0269136
          x7 |  -.0241029
         x90 |  -.1063025
         x91 |  -.1486143
         x92 |  -.1173402
         x93 |  -.0916431
         x94 |   -.083443
         x95 |  -.1485138
       _cons |   1.248262
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       1.2      .139      .294      .805      1.19      1.69      2.35      3.53       6.2       9.1
         |       408      .998      .556     .0739      .158      .463      .631      .861      1.23      1.75      2.94      3.47
         |       408      .529      .125     .0878       .17      .376      .451      .529      .615      .695      .793      .819
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .602      .124      .218      .218       .45      .517      .599       .71      .743      .832      .832
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       1.1      .139      .322      .882      1.25      1.78      2.32      3.26      6.11       9.1
         |       500      .999      .502     .0739       .18       .51      .683       .98       1.1      1.62      2.91      3.47
         |       500      .542      .128     .0878      .189      .393      .464      .536      .632      .716      .806      .832
----------------------------------------------------------------------------------------------------------------------------------

. gmatchcall balanceresults()
  Balance table:
                  1             2             3             4             5             6             7
     +---------------------------------------------------------------------------------------------------+
   1 |     Variable      mean (T)      mean (C)        diff()     stddiff()   sd (Pooled)    varratio()  |
   2 |           x1      .4512231      .5840585     -.1328353     -.2674487      .4966759      1.023703  |
   3 |        i1.x2      .0114039      .0056038      .0058001      .0712341      .0814227      2.031914  |
   4 |        i1.x3      .0240637      .0189987       .005065      .0362248      .1398222      1.265513  |
   5 |           x4      .4218861      .4945447     -.0726586     -.1453459      .4999017      .9799319  |
   6 |           x5      25.44699      25.48452     -.0375313     -.0061819      6.071139      .7621934  |
   7 |           x6      11.84757      12.64643     -.7988609      -.364996      2.188684       .523746  |
   8 |           x7      7.015422      6.453984      .5614375      .1651818      3.398906      1.122084  |
   9 |          x90      .0839738     -.1127792       .196753      .1935523      1.016537       .874998  |
  10 |          x91     -.0648837     -.1158463      .0509626      .0534391      .9536579       .961266  |
  11 |          x92      .0575388     -.1337106      .1912494      .1903354      1.004802      1.083012  |
  12 |          x93      .1016523     -.0386913      .1403437      .1416075       .991075      .8963407  |
  13 |          x94     -.1252265       -.10533     -.0198964     -.0199874      .9954474      .8151421  |
  14 |          x95     -.1044649     -.1864815      .0820166      .0844141      .9715984       .847116  |
     +---------------------------------------------------------------------------------------------------+
  Mean standardized diff., squared
  .0001031463
  Mean absolute standardized diff.
  .1338422282
  Maximum absolute standardized diff.
  .3649959793
  C.V. of matching weights:
  .5024664337
  S.D. of matching weights:
  .5018039097
  Skewness of matching weights:
  .0741718418
  Kurtosis of matching weights:
  .0140304783

. 
. log close gmatch_example_ado
      name:  gmatch_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\gmatch_example_ado.log
  log type:  text
 closed on:  14 Feb 2018, 01:26:58
----------------------------------------------------------------------------------------------------------------------------------------------------------------
