----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  psweight_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\psweight_example_ado.log
  log type:  text
 opened on:   6 Jun 2019, 18:28:50
. 
. di as txt "Current user: `c(username)'" _n "Environment: `c(os)' `c(machine_type)' `: environment computername'" _n "Stata: `c(stata_version)'" cond(c(stata_v
> ersion)==c(version),""," (set to version `c(version)')") _n "Date: " c(current_date) " " c(current_time)
Current user: KKranker
Environment: Windows PC (64-bit x86-64) KKRANKER
Stata: 15.1
Date:  6 Jun 2019 18:28:50
. desc, short

Contains data from C:\Users\kkranker\Documents\Stata\Multiple-Equation-Models\simple_cattaneo_data.dta
  obs:         4,642                          Cattaneo (2010) study on the effect of maternal smoking on birth weight
 vars:            20                          8 Apr 2015 05:07
 size:       357,434                          
Sorted by: 
     Note: Dataset has changed since last saved.
. local varlist : copy local varlist_orig
. summ `treatvar' `varlist' `tousevar' `wgtvar' `depvars'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       treat |      4,642    .1861267    .3892508          0          1
          x1 |      4,642    .6996984    .4584385          0          1
        1.x2 |      4,642    .0340371    .1813439          0          1
-------------+---------------------------------------------------------
        1.x3 |      4,642    .0534252    .2249042          0          1
          x4 |      4,642    .4379578    .4961893          0          1
          x5 |      4,642    26.50452    5.619026         13         45
          x6 |      4,642    12.68957    2.520661          0         17
          x7 |      4,642    6.540069    3.359167          1         12
-------------+---------------------------------------------------------
         x90 |      4,642   -.0031039    1.020177  -4.107368   3.325766
         x91 |      4,642   -.0212069    1.008708   -4.16458   3.503644
         x92 |      4,642    .0076449    1.004589  -3.449011   3.959166
         x93 |      4,642    .0049339    1.004513  -4.274254   3.777972
         x94 |      4,642    .0124264    .9818583  -3.659006   3.658309
-------------+---------------------------------------------------------
         x95 |      4,642    .0044283    1.010194   -3.41615   3.724456
       touse |      4,642    .1077122      .31005          0          1
         wgt |      4,642    1.993316    .4062602   .6638338   3.540576
          y1 |      4,642     3361.68    578.8196        340       5500
   y1_binary |      4,642    .9396812    .2381022          0          1
. if (trim("`depvars'") != "") local depvaropt depvars(`depvars')
. ereturn clear
.  return clear
. 
. // balance before matching
. psweight balanceonly `treatvar' `varlist' if `tousevar'
  408 control obs
  92 treatment obs
  (Data are unweighted.)
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913        .75  -.2826087  -.6149214   .4595851   1.338962
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0269608  -.0160912  -.1050325   .1532023   .4133173
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0441176  -.0223785  -.1140856   .1961554   .5085817
             |
          x4 |  .4347826    .495098  -.0603154  -.1205719   .5002444   .9914484
          x5 |  25.46739   26.56863  -1.101236  -.1896219   5.807538   .8589874
          x6 |  11.86957   13.15931  -1.289749  -.5792408   2.226619   .4958356
          x7 |  6.858696   6.696078   .1626172   .0485796   3.347437   1.160037
         x90 |  .0972024   -.048508   .1457105   .1481119   .9837861   .9289414
         x91 | -.0890157  -.0077434  -.0812723  -.0817633   .9939954   .8791918
         x92 |  .0453787  -.0227801   .0681588   .0671946   1.014349   1.090179
         x93 |  .0865687   .0403853   .0461833   .0471721   .9790382   .8926169
         x94 | -.1299173   .0160559  -.1459732  -.1488088   .9809449   .8686432
         x95 | -.0807251  -.0658282  -.0148969  -.0150884   .9873048   .8285405
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.12754
  Mean absolute standardized diff.    = 0.17540
  Maximum absolute standardized diff. = 0.61492
. ereturn list

macros:
                e(cmd) : "psweight"
            e(cmdline) : "psweight balanceonly treat x1 i.x2 i.x3 x4 x5 x6 x7 x9* if touse"
             e(subcmd) : "balanceonly"
          e(tmvarlist) : "x1 0b.x2 1.x2 0b.x3 1.x3 x4 x5 x6 x7 x90 x91 x92 x93 x94 x95"
               e(tvar) : "treat"
.  return list

scalars:
            r(mean_sd) =  -.1275443258377829
           r(mean_asd) =  .1753994534212237
            r(max_asd) =  .6149214017045797
          r(k_omitted) =  2

macros:
            r(varlist) : "treat x1 0b.x2 1.x2 0b.x3 1.x3 x4 x5 x6 x7 x90 x91 x92 x93 x94 x95"

matrices:
            r(stddiff) :  1 x 15
               r(diff) :  1 x 15
                r(bal) :  15 x 6
           r(varratio) :  1 x 15
. 
. psweight balanceonly `treatvar' `varlist' if `tousevar' [iw=`wgtvar']
  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .7470371   -.295814  -.6408853   .4615709   1.316024
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0270527  -.0156488   -.101817   .1536956   .4301765
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0427955  -.0187318  -.0962824   .1945504   .5757804
             |
          x4 |  .4218861   .4976147  -.0757286  -.1514604   .4999897   .9798375
          x5 |  25.44699    26.4983  -1.051311   -.181681   5.786576    .858714
          x6 |  11.84757   13.15616  -1.308591  -.5865399   2.231034   .5205072
          x7 |  7.015422   6.717714   .2977072   .0885763   3.361025   1.149851
         x90 |  .0839738  -.0392197   .1231936   .1243171   .9909619   .9265459
         x91 | -.0648837  -.0073142  -.0575695  -.0586888   .9809269   .8980782
         x92 |  .0575388  -.0253504   .0828891   .0822314   1.007999   1.068619
         x93 |  .1016523   .0464178   .0552345   .0565711   .9763727   .9263536
         x94 | -.1252265   .0045953  -.1298217  -.1327548   .9779064   .8528771
         x95 | -.1044649  -.0695904  -.0348746  -.0353142   .9875497   .8141756
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.12567
  Mean absolute standardized diff.    = 0.17978
  Maximum absolute standardized diff. = 0.64089
. psweight balanceonly `treatvar' `varlist' if `tousevar', mweight(`wgtvar') ate
  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .7470371   -.295814  -.6408853   .4615709   1.316024
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0270527  -.0156488   -.101817   .1536956   .4301765
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0427955  -.0187318  -.0962824   .1945504   .5757804
             |
          x4 |  .4218861   .4976147  -.0757286  -.1514604   .4999897   .9798375
          x5 |  25.44699    26.4983  -1.051311   -.181681   5.786576    .858714
          x6 |  11.84757   13.15616  -1.308591  -.5865399   2.231034   .5205072
          x7 |  7.015422   6.717714   .2977072   .0885763   3.361025   1.149851
         x90 |  .0839738  -.0392197   .1231936   .1243171   .9909619   .9265459
         x91 | -.0648837  -.0073142  -.0575695  -.0586888   .9809269   .8980782
         x92 |  .0575388  -.0253504   .0828891   .0822314   1.007999   1.068619
         x93 |  .1016523   .0464178   .0552345   .0565711   .9763727   .9263536
         x94 | -.1252265   .0045953  -.1298217  -.1327548   .9779064   .8528771
         x95 | -.1044649  -.0695904  -.0348746  -.0353142   .9875497   .8141756
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.12567
  Mean absolute standardized diff.    = 0.17978
  Maximum absolute standardized diff. = 0.64089
  C.V. of matching weights:           = 0.20180
  S.D. of matching weights:           = 0.39656
  Skewness of matching weights:       = 0.00210
  Kurtosis of matching weights:       = 0.00549
  Maximum matching weight:            = 3.23664
. 
. // * UNWEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. cbps `treatvar' `varlist' if `tousevar' , ate logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00647386  
Iteration 1:   f(p) =  .00451406  
Iteration 2:   f(p) =   .0005336  
Iteration 3:   f(p) =  .00001373  
Iteration 4:   f(p) =  2.637e-08  
Iteration 5:   f(p) =  6.777e-13  
Iteration 6:   f(p) =  1.066e-21  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.441064   .5046768    -2.86   0.004    -2.430213   -.4519161
        1.x2 |  -2.548784   3.501511    -0.73   0.467     -9.41162    4.314051
        1.x3 |   -1.02318   2.005094    -0.51   0.610    -4.953091    2.906732
          x4 |  -.2320966   .5678014    -0.41   0.683    -1.344967    .8807737
          x5 |   .0736983    .042799     1.72   0.085    -.0101862    .1575829
          x6 |  -.4863391   .1923869    -2.53   0.011    -.8634106   -.1092676
          x7 |   .0655415   .0720901     0.91   0.363    -.0757525    .2068354
         x90 |   .0303861    .203675     0.15   0.881    -.3688096    .4295819
         x91 |  -.0236437   .2499136    -0.09   0.925    -.5134655     .466178
         x92 |   .2014652   .2092517     0.96   0.336    -.2086606    .6115911
         x93 |  -.0067202   .2511949    -0.03   0.979    -.4990531    .4856126
         x94 |  -.3662317   .2431817    -1.51   0.132     -.842859    .1103956
         x95 |  -.0080118   .2531324    -0.03   0.975    -.5041423    .4881187
       _cons |   3.127763   1.826429     1.71   0.087    -.4519713    6.707497
------------------------------------------------------------------------------
. ereturn clear
.  return clear
. 
. psweight cbps `treatvar' `varlist' if `tousevar' , ate pooledvariance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  2.590e-08  
Iteration 1:   f(p) =  2.548e-08  (backed up)
Iteration 2:   f(p) =  1.980e-08  
Iteration 3:   f(p) =  1.652e-08  
Iteration 4:   f(p) =  1.627e-08  
Iteration 5:   f(p) =  1.540e-08  
Iteration 6:   f(p) =  1.451e-08  
Iteration 7:   f(p) =  1.377e-08  
Iteration 8:   f(p) =  1.290e-08  
Iteration 9:   f(p) =  1.195e-08  
Iteration 10:  f(p) =  1.168e-08  
Iteration 11:  f(p) =  1.075e-08  
Iteration 12:  f(p) =  1.026e-08  
Iteration 13:  f(p) =  1.005e-08  
Iteration 14:  f(p) =  9.508e-09  
Iteration 15:  f(p) =  9.073e-09  
Iteration 16:  f(p) =  6.349e-09  
Iteration 17:  f(p) =  2.695e-09  
Iteration 18:  f(p) =  2.271e-09  
Iteration 19:  f(p) =  1.849e-09  
Iteration 20:  f(p) =  1.334e-09  
Iteration 21:  f(p) =  1.242e-09  
Iteration 22:  f(p) =  1.145e-09  
Iteration 23:  f(p) =  9.775e-10  
Iteration 24:  f(p) =  9.423e-10  
Iteration 25:  f(p) =  9.361e-10  
Iteration 26:  f(p) =  9.197e-10  
Iteration 27:  f(p) =  9.148e-10  
Iteration 28:  f(p) =  9.029e-10  
Iteration 29:  f(p) =  6.204e-10  
Iteration 30:  f(p) =  3.414e-10  
Iteration 31:  f(p) =  2.995e-10  
Iteration 32:  f(p) =  2.968e-10  
Iteration 33:  f(p) =  2.571e-10  
Iteration 34:  f(p) =  4.385e-11  
Iteration 35:  f(p) =  4.794e-13  
Iteration 36:  f(p) =  6.223e-14  
Iteration 37:  f(p) =  3.066e-15  
Iteration 38:  f(p) =  8.784e-17  
Iteration 39:  f(p) =  2.421e-19  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441064
        1.x2 |  -2.548782
        1.x3 |  -1.023178
          x4 |  -.2320967
          x5 |   .0736983
          x6 |   -.486339
          x7 |   .0655415
         x90 |   .0303862
         x91 |  -.0236435
         x92 |   .2014654
         x93 |  -.0067199
         x94 |  -.3662317
         x95 |  -.0080121
       _cons |   3.127762
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408         1      .439       .78      .783      .792       .81      .867      .991       1.3      2.57      6.91
         |       408      .161      .168    .00228    .00588     .0177     .0388      .102      .214        .4      .697      .887
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92         1      .815      .189      .189      .334      .416      .725      1.39      1.89      5.12      5.12
         |        92      .289      .189     .0343     .0343     .0927      .126      .242      .423      .526      .928      .928
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500         1      .528      .189      .285      .763        .8       .86      1.04      1.46      3.09      6.91
         |       500      .185      .179    .00228    .00648     .0207     .0485       .12      .268      .461      .712      .928
----------------------------------------------------------------------------------------------------------------------------------
. ereturn list

scalars:
                  e(N) =  500

macros:
                e(cmd) : "psweight"
            e(cmdline) : "psweight cbps treat x1 i.x2 i.x3 x4 x5 x6 x7 x9* if touse , ate pooledvariance depvars(y1 y1_binary)"
             e(subcmd) : "cbps"
           e(variance) : "pooledvariance"
          e(tmvarlist) : "x1 0b.x2 1.x2 0b.x3 1.x3 x4 x5 x6 x7 x90 x91 x92 x93 x94 x95"
               e(tvar) : "treat"
               e(stat) : "ate"
         e(properties) : "b"
             e(depvar) : "treat"

matrices:
                  e(b) :  1 x 16

functions:
             e(sample)   
.  return list
. 
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6750468   .6750468   5.14e-08   1.10e-07   .4688264   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0219356   .0219357  -6.56e-08  -4.48e-07   .1466203   1.008508
             |
          x3 |
          0  |  (empty)
          1  |  .0370066   .0370067  -6.07e-08  -3.21e-07   .1889672    1.00851
             |
          x4 |  .4861037   .4861037  -2.26e-08  -4.52e-08   .5003074   1.008511
          x5 |  26.25386   26.25386   8.04e-07   1.28e-07   6.268993   .6747772
          x6 |  12.63471   12.63471  -3.12e-07  -1.33e-07   2.343236   .5637225
          x7 |  6.724952   6.724952  -4.63e-07  -1.38e-07   3.360602   1.190087
         x90 | -.0592248  -.0592245  -2.43e-07  -2.33e-07   1.042785   1.206643
         x91 |  .0116972   .0116974  -1.62e-07  -1.65e-07   .9810721   .9436963
         x92 | -.0041247  -.0041245  -2.73e-07  -2.67e-07   1.020036   1.339887
         x93 |  .0443807    .044381  -2.77e-07  -2.86e-07   .9681889   .8469646
         x94 | -.0856688  -.0856689   8.21e-08   8.08e-08   1.015864   .7767335
         x95 | -.0859152  -.0859155   2.90e-07   2.97e-07   .9766878   .8347647
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00000
  C.V. of matching weights:           = 0.52754
  S.D. of matching weights:           = 0.52754
  Skewness of matching weights:       = 0.21587
  Kurtosis of matching weights:       = 0.08607
  Maximum matching weight:            = 6.90640
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3444.163     3444.163   .0000629   4.13e-07   3444.163
   y1_binary |    .9544751     .9544751   2.97e-09   6.57e-08   .9544751
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. ereturn list

scalars:
                  e(N) =  500

macros:
                e(cmd) : "psweight"
            e(cmdline) : "psweight call balanceresults()"
             e(subcmd) : "call"
           e(variance) : "pooledvariance"
          e(tmvarlist) : "x1 0b.x2 1.x2 0b.x3 1.x3 x4 x5 x6 x7 x90 x91 x92 x93 x94 x95"
               e(tvar) : "treat"
               e(stat) : "ate"
         e(properties) : "b"
             e(depvar) : "treat"

matrices:
                  e(b) :  1 x 16

functions:
             e(sample)   
. return list

scalars:
            r(wgt_max) =  6.906396287524501
       r(wgt_kurtosis) =  .0860728676948079
       r(wgt_skewness) =  .2158746778490341
             r(wgt_sd) =  .5275372125889477
             r(wgt_cv) =  .5275372125889477
            r(max_asd) =  4.47721406461e-07
           r(mean_asd) =  2.03999405829e-07
            r(mean_sd) =  -1.09273321479e-07

matrices:
           r(progdiff) :  2 x 5
            r(stddiff) :  1 x 15
               r(diff) :  1 x 15
                r(bal) :  15 x 6
           r(varratio) :  1 x 15
. psweight // test replay
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.441064
        1.x2 |  -2.548782
        1.x3 |  -1.023178
          x4 |  -.2320967
          x5 |   .0736983
          x6 |   -.486339
          x7 |   .0655415
         x90 |   .0303862
         x91 |  -.0236435
         x92 |   .2014654
         x93 |  -.0067199
         x94 |  -.3662317
         x95 |  -.0080121
       _cons |   3.127762
------------------------------------------------------------------------------
. 
. cbps `treatvar' `varlist' if `tousevar' , ate over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .02441999  (not concave)
Iteration 1:   f(p) =    .020112  
Iteration 2:   f(p) =  .01484746  
Iteration 3:   f(p) =   .0142955  
Iteration 4:   f(p) =  .01428412  
Iteration 5:   f(p) =  .01428407  
Iteration 6:   f(p) =  .01428407  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.074574   .2572873    -4.18   0.000    -1.578848      -.5703
        1.x2 |  -1.732571    .847337    -2.04   0.041    -3.393321   -.0718214
        1.x3 |   -.535995   .6259896    -0.86   0.392    -1.762912    .6909221
          x4 |  -.2389831   .2458124    -0.97   0.331    -.7207666    .2428004
          x5 |   .0484453   .0243181     1.99   0.046     .0007828    .0961078
          x6 |  -.2519975   .0459113    -5.49   0.000    -.3419819    -.162013
          x7 |   .0081703   .0322545     0.25   0.800    -.0550474    .0713879
         x90 |    .120204   .1075227     1.12   0.264    -.0905366    .3309445
         x91 |  -.1467757   .1099013    -1.34   0.182    -.3621782    .0686269
         x92 |   .1315867   .1151671     1.14   0.253    -.0941367    .3573101
         x93 |    .086207   .1113523     0.77   0.439    -.1320395    .3044534
         x94 |  -.1702521    .103099    -1.65   0.099    -.3723225    .0318183
         x95 |   .0217906    .112224     0.19   0.846    -.1981643    .2417456
       _cons |   1.206345   .6074599     1.99   0.047      .015746    2.396945
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>7.142, 14) = 0.929
. psweight cbpsoid `treatvar' `varlist' if `tousevar' , ate pooledvariance  `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  9.768e-08  
Iteration 1:   f(p) =  9.599e-08  (backed up)
Iteration 2:   f(p) =  7.672e-08  
Iteration 3:   f(p) =  6.399e-08  
Iteration 4:   f(p) =  6.304e-08  
Iteration 5:   f(p) =  6.026e-08  
Iteration 6:   f(p) =  5.854e-08  
Iteration 7:   f(p) =  5.801e-08  
Iteration 8:   f(p) =  5.780e-08  
Iteration 9:   f(p) =  5.775e-08  
Iteration 10:  f(p) =  5.764e-08  
Iteration 11:  f(p) =  5.743e-08  
Iteration 12:  f(p) =  5.722e-08  
Iteration 13:  f(p) =  5.718e-08  
Iteration 14:  f(p) =  5.716e-08  
Iteration 15:  f(p) =  5.715e-08  
Iteration 16:  f(p) =  5.715e-08  
Iteration 17:  f(p) =  5.715e-08  
Iteration 18:  f(p) =  5.715e-08  
Iteration 19:  f(p) =  5.714e-08  
Iteration 20:  f(p) =  5.714e-08  
Iteration 21:  f(p) =  5.714e-08  
Iteration 22:  f(p) =  5.714e-08  
Iteration 23:  f(p) =  5.714e-08  
Iteration 24:  f(p) =  5.714e-08  
Iteration 25:  f(p) =  5.714e-08  
Iteration 26:  f(p) =  5.714e-08  
Iteration 27:  f(p) =  5.714e-08  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (over identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.074574
        1.x2 |  -1.732572
        1.x3 |  -.5359934
          x4 |  -.2389832
          x5 |   .0484453
          x6 |  -.2519976
          x7 |   .0081703
         x90 |    .120204
         x91 |  -.1467759
         x92 |   .1315865
         x93 |   .0862071
         x94 |   -.170252
         x95 |   .0217913
       _cons |   1.206346
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408         1       .18      .819      .835      .857      .887      .939      1.05      1.24      1.57      2.46
         |       408      .173      .114     .0142     .0324     .0574     .0892       .14      .232      .346      .487      .672
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92         1      .579      .317      .317      .509      .572      .789      1.36      1.63       4.2       4.2
         |        92      .274       .13     .0508     .0508      .131      .157      .271      .373       .42      .673      .673
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500         1      .296      .317      .452      .822      .872      .936      1.08      1.33      2.05       4.2
         |       500      .191      .123     .0142     .0339     .0609     .0967      .153      .263      .381       .55      .673
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6406563   .7027892  -.0621329  -.1343717   .4623962   1.111543
             |
          x2 |
          0  |  (empty)
          1  |  .0157701   .0233767  -.0076066  -.0518321   .1467555   .6856468
             |
          x3 |
          0  |  (empty)
          1  |  .0248069   .0398362  -.0150293  -.0794677   .1891246   .6378532
             |
          x4 |  .4886895   .4862356   .0024538   .0049045   .5003233   1.008759
          x5 |  25.82556   26.34781  -.5222466   -.087499   5.968599     .75999
          x6 |  12.33004    12.9064  -.5763636  -.2576162   2.237296   .5881094
          x7 |  6.884519   6.669732   .2147874   .0639212   3.360189   1.180429
         x90 | -.0713185  -.0265029  -.0448156  -.0441807   1.014371   1.157748
         x91 |  .0200092   -.022611   .0426201   .0430283   .9905145   .9174008
         x92 |  .0040224  -.0083768   .0123991   .0121514   1.020391   1.200576
         x93 |   .022949   .0551791  -.0322301    -.03319   .9710768   .8891007
         x94 | -.1215951  -.0231316  -.0984635  -.0994522    .990058   .8143466
         x95 |  -.095014  -.0715949  -.0234192  -.0239414   .9781896   .8041465
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.05289
  Mean absolute standardized diff.    = 0.07197
  Maximum absolute standardized diff. = 0.25762
  C.V. of matching weights:           = 0.29590
  S.D. of matching weights:           = 0.29590
  Skewness of matching weights:       = 0.15745
  Kurtosis of matching weights:       = 0.06543
  Maximum matching weight:            = 4.20459
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3443.444     3453.946  -10.50206  -.0757773   3453.946
   y1_binary |    .9509072     .9588221  -.0079149  -.1916554   .9588221
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. cbps `treatvar' `varlist' if `tousevar' , att logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .00197031  
Iteration 1:   f(p) =  .00006892  
Iteration 2:   f(p) =  1.777e-07  
Iteration 3:   f(p) =  2.570e-12  
Iteration 4:   f(p) =  6.940e-22  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.339291   .3615444    -3.70   0.000    -2.047905   -.6306769
        1.x2 |  -1.525175    1.19071    -1.28   0.200    -3.858923    .8085728
        1.x3 |  -.5996277   .8424377    -0.71   0.477    -2.250775     1.05152
          x4 |  -.3183658   .3103113    -1.03   0.305    -.9265647    .2898331
          x5 |   .0587883     .02835     2.07   0.038     .0032234    .1143533
          x6 |  -.2435676   .0675718    -3.60   0.000    -.3760059   -.1111292
          x7 |   .0341034   .0400884     0.85   0.395    -.0444685    .1126752
         x90 |    .158599   .1286436     1.23   0.218    -.0935378    .4107357
         x91 |  -.1617619    .131618    -1.23   0.219    -.4197284    .0962045
         x92 |   .1391156   .1358437     1.02   0.306    -.1271333    .4053644
         x93 |   .0571151    .134574     0.42   0.671    -.2066451    .3208752
         x94 |  -.1175052   .1193236    -0.98   0.325    -.3513752    .1163649
         x95 |    .011505   .1383574     0.08   0.934    -.2596705    .2826805
       _cons |    .782858    .962964     0.81   0.416    -1.104517    2.670233
------------------------------------------------------------------------------
. psweight cbps `treatvar' `varlist' if `tousevar' , atet pooledvariance  `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.603e-10  
Iteration 14:  f(p) =  7.497e-10  
Iteration 15:  f(p) =  4.770e-10  
Iteration 16:  f(p) =  2.775e-10  
Iteration 17:  f(p) =  7.322e-11  
Iteration 18:  f(p) =  4.498e-11  
Iteration 19:  f(p) =  4.378e-11  
Iteration 20:  f(p) =  3.530e-11  
Iteration 21:  f(p) =  2.766e-11  
Iteration 22:  f(p) =  4.069e-12  
Iteration 23:  f(p) =  1.178e-12  
Iteration 24:  f(p) =  1.153e-12  
Iteration 25:  f(p) =  1.026e-12  
Iteration 26:  f(p) =  7.702e-13  
Iteration 27:  f(p) =  4.187e-13  
Iteration 28:  f(p) =  2.188e-14  
Iteration 29:  f(p) =  2.709e-17  
Iteration 30:  f(p) =  8.507e-20  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525177
        1.x3 |  -.5996257
          x4 |  -.3183659
          x5 |   .0587884
          x6 |  -.2435675
          x7 |   .0341033
         x90 |   .1585989
         x91 |   -.161762
         x92 |   .1391155
         x93 |    .057115
         x94 |  -.1175052
         x95 |   .0115049
       _cons |    .782857
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913  -1.05e-08  -2.10e-08   .4994352   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696   1.35e-08   1.30e-07   .1037928   1.008512
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217392  -3.35e-08  -2.30e-07   .1459767    1.00851
             |
          x4 |  .4347826   .4347826   4.50e-08   9.06e-08   .4962249   1.008511
          x5 |  25.46739   25.46739  -1.03e-06  -1.54e-07   6.664728   .6195799
          x6 |  11.86957   11.86957  -2.86e-07  -1.40e-07   2.043536   .5669465
          x7 |  6.858696   6.858695   3.44e-07   1.02e-07   3.363971   1.145237
         x90 |  .0972024   .0972024   5.59e-08   5.47e-08   1.021603    .845302
         x91 | -.0890157  -.0890157   1.15e-08   1.21e-08   .9556678   .9654928
         x92 |  .0453787   .0453787   2.30e-08   2.30e-08   .9971708   1.136731
         x93 |  .0865687   .0865686   2.88e-08   3.02e-08     .95074   .9577067
         x94 | -.1299173  -.1299172  -2.89e-08  -2.82e-08    1.02511   .7795321
         x95 | -.0807251  -.0807251   7.57e-09   7.89e-09   .9586344   .8888005
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00000
  C.V. of matching weights:           = 0.98844
  S.D. of matching weights:           = 0.98844
  Skewness of matching weights:       = 0.11001
  Kurtosis of matching weights:       = 0.02254
  Maximum matching weight:            = 7.03226
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.753     3424.753  -.0000267  -1.61e-07   3424.753
   y1_binary |    .9470393     .9470393  -8.59e-09  -1.61e-07   .9470393
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. cbps `treatvar' `varlist' if `tousevar' , att over logit optimization_technique("nr") evaluator_type("gf1")
Iteration 0:   f(p) =  .04521356  
Iteration 1:   f(p) =  .03210384  
Iteration 2:   f(p) =   .0303286  
Iteration 3:   f(p) =   .0302734  
Iteration 4:   f(p) =  .03027339  
Iteration 5:   f(p) =  .03027339  
------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
treat        |
          x1 |  -1.171988   .2187737    -5.36   0.000    -1.600776   -.7431991
        1.x2 |  -1.909814   .6607307    -2.89   0.004    -3.204822   -.6148052
        1.x3 |  -.4402667   .7269474    -0.61   0.545    -1.865057     .984524
          x4 |  -.3130788   .2251092    -1.39   0.164    -.7542848    .1281272
          x5 |   .0503881   .0191417     2.63   0.008     .0128711    .0879051
          x6 |  -.2393185   .0575186    -4.16   0.000     -.352053   -.1265841
          x7 |   .0261168   .0311563     0.84   0.402    -.0349484    .0871821
         x90 |   .1425533   .1007579     1.41   0.157    -.0549285    .3400351
         x91 |  -.1282785   .1127153    -1.14   0.255    -.3491964    .0926393
         x92 |      .1073   .1112316     0.96   0.335    -.1107099    .3253099
         x93 |   .0527165   .1101053     0.48   0.632    -.1630859    .2685189
         x94 |  -.1248021   .0971592    -1.28   0.199    -.3152305    .0656263
         x95 |   .0220743   .1115296     0.20   0.843    -.1965196    .2406683
       _cons |   .9132207   .6048419     1.51   0.131    -.2722476    2.098689
------------------------------------------------------------------------------
J test for overidentifying restrictions: P(chisq>15.137, 14) = 0.369
. psweight cbpsoid `treatvar' `varlist' if `tousevar' , atet pooledvariance  `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  1.809e-07  
Iteration 1:   f(p) =  1.775e-07  (backed up)
Iteration 2:   f(p) =  1.749e-07  
Iteration 3:   f(p) =  1.665e-07  
Iteration 4:   f(p) =  1.593e-07  
Iteration 5:   f(p) =  1.436e-07  
Iteration 6:   f(p) =  1.400e-07  
Iteration 7:   f(p) =  1.356e-07  
Iteration 8:   f(p) =  1.328e-07  
Iteration 9:   f(p) =  1.272e-07  
Iteration 10:  f(p) =  1.231e-07  
Iteration 11:  f(p) =  1.224e-07  
Iteration 12:  f(p) =  1.220e-07  
Iteration 13:  f(p) =  1.219e-07  
Iteration 14:  f(p) =  1.218e-07  
Iteration 15:  f(p) =  1.217e-07  
Iteration 16:  f(p) =  1.213e-07  
Iteration 17:  f(p) =  1.212e-07  
Iteration 18:  f(p) =  1.212e-07  
Iteration 19:  f(p) =  1.212e-07  
Iteration 20:  f(p) =  1.211e-07  
Iteration 21:  f(p) =  1.211e-07  
Iteration 22:  f(p) =  1.211e-07  
Iteration 23:  f(p) =  1.211e-07  
Iteration 24:  f(p) =  1.211e-07  
Iteration 25:  f(p) =  1.211e-07  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (over identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.171988
        1.x2 |  -1.909811
        1.x3 |  -.4402666
          x4 |  -.3130787
          x5 |   .0503881
          x6 |  -.2393185
          x7 |   .0261168
         x90 |   .1425533
         x91 |  -.1282785
         x92 |      .1073
         x93 |   .0527165
         x94 |  -.1248021
         x95 |   .0220743
       _cons |   .9132204
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408         1      .916     .0457      .134      .253      .397      .671      1.27      2.31      4.01      6.68
         |       408      .164      .111     .0101     .0291     .0535     .0814       .13      .221       .34      .472      .599
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .266      .134      .047      .047      .116      .151       .26      .364      .429      .666      .666
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500         1      .827     .0457      .138      .276      .454      .871      1.06      2.01      3.95      6.68
         |       500      .183      .122     .0101     .0298     .0577     .0913      .147      .253      .376      .555      .666
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0498389   .5003503   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0376593   .0897825   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0130452    .151158   .9265074
             |
          x4 |  .4347826    .438673  -.0038904  -.0078335   .4966326   1.006495
          x5 |  25.46739   25.45801   .0093786   .0014149   6.628535   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0123239     2.0564    .559006
          x7 |  6.858696   6.790863   .0678325    .020134    3.36906   1.140985
         x90 |  .0972024   .0826851   .0145173    .014215   1.021263   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0227622   .9619657   .9503048
         x92 |  .0453787   .0235132   .0218655   .0219385   .9966695   1.138269
         x93 |  .0865687   .0849356    .001633   .0017143   .9526181   .9531308
         x94 | -.1299173  -.1339674   .0040502   .0039553   1.023979   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0064787   .9600495   .8856706
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00087
  Mean absolute standardized diff.    = 0.01641
  Maximum absolute standardized diff. = 0.04984
  C.V. of matching weights:           = 0.91559
  S.D. of matching weights:           = 0.91559
  Skewness of matching weights:       = 0.10408
  Kurtosis of matching weights:       = 0.02134
  Maximum matching weight:            = 6.68335
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.722     3428.063  -3.341103  -.0202642   3428.063
   y1_binary |    .9470466     .9484255  -.0013789  -.0265328   .9484255
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. // After calling psweight, the data is stored in a class instance named psweight_ado_most_recent
. // You can print any of the public functions or variables to the screen with psweight call. For example:
. psweight call diff()
                  1              2              3              4              5              6              7              8              9             10
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
  1 |  -.0249369271              0    .0033811478              0   -.0019718912    -.003890361    .0093785702   -.0253427766    .0678325257    .0145172978
    +-------------------------------------------------------------------------------------------------------------------------------------------------------
                 11             12             13             14             15
     ----------------------------------------------------------------------------+
  1    -.0218964965    .0218654598    .0016330378    .0040501656   -.0062199103  |
     ----------------------------------------------------------------------------+
. psweight call balancetable()
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4923282  -.0249369  -.0498389   .5003503   1.004458
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0074884   .0033811   .0376593   .0897825   1.458884
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .023711  -.0019719  -.0130452    .151158   .9265074
             |
          x4 |  .4347826    .438673  -.0038904  -.0078335   .4966326   1.006495
          x5 |  25.46739   25.45801   .0093786   .0014149   6.628535   .6273162
          x6 |  11.86957   11.89491  -.0253428  -.0123239     2.0564    .559006
          x7 |  6.858696   6.790863   .0678325    .020134    3.36906   1.140985
         x90 |  .0972024   .0826851   .0145173    .014215   1.021263   .8460037
         x91 | -.0890157  -.0671192  -.0218965  -.0227622   .9619657   .9503048
         x92 |  .0453787   .0235132   .0218655   .0219385   .9966695   1.138269
         x93 |  .0865687   .0849356    .001633   .0017143   .9526181   .9531308
         x94 | -.1299173  -.1339674   .0040502   .0039553   1.023979   .7815571
         x95 | -.0807251  -.0745052  -.0062199  -.0064787   .9600495   .8856706
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00087
  Mean absolute standardized diff.    = 0.01641
  Maximum absolute standardized diff. = 0.04984
                   1              2              3              4              5              6
     +-------------------------------------------------------------------------------------------+
   1 |   .4673913043    .4923282315   -.0249369271   -.0498389405    .5003502665    1.004458062  |
   2 |             0              0              0              .              0              .  |
   3 |   .0108695652    .0074884174    .0033811478    .0376593376    .0897824559    1.458884101  |
   4 |             0              0              0              .              0              .  |
   5 |   .0217391304    .0237110216   -.0019718912   -.0130452286    .1511580398    .9265073707  |
   6 |   .4347826087    .4386729697    -.003890361   -.0078334785    .4966326327    1.006494789  |
   7 |    25.4673913    25.45801273    .0093785702    .0014148782    6.628535338    .6273161791  |
   8 |   11.86956522    11.89490799   -.0253427766   -.0123238539     2.05640029    .5590060132  |
   9 |   6.858695652    6.790863126    .0678325257    .0201339625    3.369059905    1.140985233  |
  10 |   .0972024365    .0826851387    .0145172978    .0142150496    1.021262549    .8460036645  |
  11 |  -.0890156845    -.067119188   -.0218964965   -.0227622423    .9619657072    .9503048099  |
  12 |   .0453786792    .0235132194    .0218654598    .0219385264    .9966694865    1.138268863  |
  13 |   .0865686693    .0849356315    .0016330378    .0017142628    .9526180882    .9531308459  |
  14 |  -.1299172593   -.1339674249    .0040501656    .0039553198      1.0239793    .7815571151  |
  15 |  -.0807250915   -.0745051812   -.0062199103   -.0064787391    .9600495164    .8856705714  |
     +-------------------------------------------------------------------------------------------+
. 
. // Other objective functions
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' , atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00032638  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  8.089e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  5.298e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.465e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  2.512e-21  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206443
        1.x2 |  -1.628676
        1.x3 |  -.5803099
          x4 |  -.2832337
          x5 |   .0694163
          x6 |  -.2787869
          x7 |   .0283209
         x90 |   .1446874
         x91 |  -.1322013
         x92 |   .1288213
         x93 |     .06336
         x94 |  -.1645468
         x95 |   .0190735
       _cons |    1.37953
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408         1      1.04     .0503      .106      .224      .365      .657      1.23      2.34      4.29      11.1
         |       408      .232      .146     .0183     .0376     .0766      .119      .196      .313      .465      .614      .804
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .364      .163     .0707     .0707      .176      .215      .347      .492      .558      .798      .798
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500         1       .94     .0503      .115       .25      .426      .845      1.07      1.96      4.24      11.1
         |       500      .257      .158     .0183     .0409     .0838      .136      .216       .35      .497      .687      .804
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5065707  -.0391794   -.078098   .5016695   1.004395
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094032   .0014663   .0140645   .1042572   1.164051
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217076   .0000315   .0002149   .1466296   1.009942
             |
          x4 |  .4347826   .4181832   .0165994   .0333023   .4984448   1.018628
          x5 |  25.46739   26.05541  -.5880199   -.108014   5.443922    .583267
          x6 |  11.86957   11.79935   .0702179   .0437479   1.605057   .5528994
          x7 |  6.858696   6.775281   .0834143   .0234527   3.556704   1.141156
         x90 |  .0972024   .0569965    .040206   .0421541   .9537854   .8487821
         x91 | -.0890157   -.062197  -.0268186  -.0284411   .9429542   .9668971
         x92 |  .0453787   .0391246   .0062541   .0059496   1.051175   1.151879
         x93 |  .0865687   .1044402  -.0178716  -.0191146   .9349714   .9622808
         x94 | -.1299173  -.1873487   .0574315   .0621009   .9248091   .7465145
         x95 | -.0807251  -.0886593   .0079342   .0086807    .914005    .892775
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.03595
  Maximum absolute standardized diff. = 0.10801
  C.V. of matching weights:           = 1.04136
  S.D. of matching weights:           = 1.04136
  Skewness of matching weights:       = 0.17109
  Kurtosis of matching weights:       = 0.06249
  Maximum matching weight:            = 11.09500
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.964     3426.474  -1.509908  -.0096045   3426.474
   y1_binary |    .9468831     .9481476  -.0012646  -.0236201   .9481476
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight sd_sq `treatvar' `varlist' if `tousevar' , atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .02141594  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .02005607  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01097598  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00782372  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00292673  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00193285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00085471  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00063406  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00028285  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013476  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00008047  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00006325  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =   .0000443  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00003941  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00003494  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00001414  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  9.450e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  8.233e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.845e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.918e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  1.597e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.597e-07  (backed up)

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = sum(stddiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339094
        1.x2 |  -1.522718
        1.x3 |  -.6024628
          x4 |  -.3184011
          x5 |   .0587701
          x6 |  -.2435594
          x7 |   .0341083
         x90 |   .1586104
         x91 |  -.1617897
         x92 |   .1392853
         x93 |   .0571801
         x94 |  -.1174441
         x95 |   .0116348
       _cons |   1.412923
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988      .057      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .254      .155     .0236     .0502     .0875      .137      .212      .346        .5       .66      .749
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .395      .175     .0785     .0785      .186      .232      .402      .539      .614      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893      .057      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500       .28      .168     .0236     .0505     .0938      .153      .236      .392      .545      .727      .805
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673974  -6.08e-06  -.0000121   .5016695   1.008509
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .010884  -.0000145  -.0001389   .1042572   1.007184
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216918   .0000474   .0003231   .1466296   1.010665
             |
          x4 |  .4347826   .4347917  -9.14e-06  -.0000183   .4984448   1.008506
          x5 |  25.46739   25.46699   .0004057   .0000745   5.443922   .6196141
          x6 |  11.86957   11.86965  -.0000811  -.0000505   1.605057   .5669426
          x7 |  6.858696   6.858709  -.0000131  -3.67e-06   3.556704   1.145253
         x90 |  .0972024   .0972214   -.000019  -.0000199   .9537854   .8453063
         x91 | -.0890157  -.0890341   .0000185   .0000196   .9429542   .9654774
         x92 |  .0453787   .0455054  -.0001267  -.0001205   1.051175   1.136737
         x93 |  .0865687   .0866238  -.0000552   -.000059   .9349714   .9577098
         x94 | -.1299173  -.1298667  -.0000506  -.0000547   .9248091   .7795587
         x95 | -.0807251  -.0806563  -.0000688  -.0000753    .914005   .8888531
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00001
  Mean absolute standardized diff.    = 0.00007
  Maximum absolute standardized diff. = 0.00032
  C.V. of matching weights:           = 0.98839
  S.D. of matching weights:           = 0.98839
  Skewness of matching weights:       = 0.11001
  Kurtosis of matching weights:       = 0.02254
  Maximum matching weight:            = 7.03126
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.753     3424.752   .0006725   4.41e-06   3424.752
   y1_binary |    .9470393     .9470403  -1.04e-06  -.0000198   .9470403
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight stdprogdiff `treatvar' `varlist' if `tousevar' , atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00185472  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00101577  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =   .0002704  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  7.072e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.219e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.602e-12  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  2.535e-16  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = sum(stdprogdiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.206434
        1.x2 |  -1.628883
        1.x3 |  -.5801519
          x4 |  -.2842213
          x5 |   .0680367
          x6 |  -.2812704
          x7 |   .0362354
         x90 |   .1401283
         x91 |   -.133367
         x92 |   .1293804
         x93 |   .0654367
         x94 |   -.170839
         x95 |   .0205357
       _cons |   1.379493
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408         1      1.05     .0496      .105       .22      .365      .652      1.23      2.36      4.33      10.9
         |       408       .23      .147     .0179     .0369     .0748      .118      .193       .31      .464      .614        .8
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .362      .164      .072      .072      .169       .21      .349      .492      .552      .805      .805
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .945     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500         1      .945     .0496      .115      .246      .423      .845      1.08         2      4.32      10.9
         |       500      .255      .158     .0179     .0405      .082      .134      .213      .347      .496      .689      .805
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5034076  -.0360163  -.0717928   .5016695   1.004268
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0094204   .0014491   .0138997   .1042572   1.161948
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0216619   .0000772   .0005268   .1466296   1.012028
             |
          x4 |  .4347826   .4201252   .0146574   .0294062   .4984448   1.017315
          x5 |  25.46739   25.99281  -.5254175  -.0965145   5.443922   .5838652
          x6 |  11.86957   11.78734   .0822302   .0512319   1.605057   .5554978
          x7 |  6.858696   6.858079   .0006171   .0001735   3.556704   1.143915
         x90 |  .0972024   .0536862   .0435163   .0456248   .9537854    .847646
         x91 | -.0890157  -.0631464  -.0258693  -.0274343   .9429542    .968103
         x92 |  .0453787   .0348442   .0105345   .0100216   1.051175   1.154518
         x93 |  .0865687   .1037557   -.017187  -.0183824   .9349714   .9597356
         x94 | -.1299173  -.1918307   .0619134   .0669473   .9248091   .7493635
         x95 | -.0807251  -.0849593   .0042342   .0046326    .914005   .8909529
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00064
  Mean absolute standardized diff.    = 0.03358
  Maximum absolute standardized diff. = 0.09651
  C.V. of matching weights:           = 1.04582
  S.D. of matching weights:           = 1.04582
  Skewness of matching weights:       = 0.16632
  Kurtosis of matching weights:       = 0.05875
  Maximum matching weight:            = 10.93729
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.984     3424.984   2.41e-06   1.52e-08   3424.984
   y1_binary |    .9469116     .9469116   2.49e-10   4.59e-09   .9469116
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.891e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -365.5251   68.93598    -5.30   0.000    -500.6371   -230.4131
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3417.895   43.41569    78.72   0.000     3332.801    3502.988
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------
. di _b[POmean:0.treat]
3417.8947
. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752   -.0090577      1.338962   .9989677
                  |
               x2 |
               1  |  -.1180374    .0096998      .4133173   1.098626
                  |
               x3 |
               1  |  -.1253201    .0022927      .5085817   1.015318
                  |
               x4 |  -.1207472   -.0222549      .9914484   .9947225
               x5 |  -.1944638    .0308855      .8589874   .5917507
               x6 |  -.6542694    .0952268      .4958356   .5601212
               x7 |   .0473848    .0429284      1.160037   1.132231
              x90 |   .1499304    .0130255      .9289414   .8182649
              x91 |  -.0833726   -.0288848      .8791918   .9584288
              x92 |   .0662245    .0110605      1.090179   1.139468
              x93 |   .0479737   -.0087695      .8926169   .9659809
              x94 |  -.1521926    .0562648      .8686432   .7583723
              x95 |  -.0155155     .017858      .8285405   .8879817
  -----------------------------------------------------------------
. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        247.8
                          Control obs   =          408        252.2
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------
. psweight ipw `treatvar' `varlist' if `tousevar' , atet averagevariance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff     sd_avg  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296  -.0090456   .5007475   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0096855   .1016872   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0022895   .1457719   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222252   .4980573   1.003118
          x5 |  25.46739   25.27307   .1943233   .0308606   6.296806    .596745
          x6 |  11.86957   11.68981   .1797533   .0951549   1.889059   .5648484
          x7 |  6.858696   6.711046   .1476493    .042865   3.444517   1.141787
         x90 |  .0972024   .0841522   .0130502   .0130107   1.003034   .8251709
         x91 | -.0890157  -.0615794  -.0274362  -.0288473   .9510857   .9665176
         x92 |  .0453787   .0341522   .0112265   .0110442   1.016508   1.149085
         x93 |  .0865687   .0948113  -.0082427   -.008758   .9411576   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0562053   .9933796   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0178362   .9402985   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.01616
  Mean absolute standardized diff.    = 0.02676
  Maximum absolute standardized diff. = 0.09515
  C.V. of matching weights:           = 1.04145
  S.D. of matching weights:           = 1.04145
  Skewness of matching weights:       = 0.13348
  Kurtosis of matching weights:       = 0.03590
  Maximum matching weight:            = 9.28896
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.454     3417.895   6.559175   .0395688   3417.895
   y1_binary |    .9470413     .9465176   .0005237   .0095404   .9465176
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight ipw `treatvar' `varlist' if `tousevar' , atet averagevariance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408         1      1.04     .0533        .1      .213      .348      .647      1.27      2.38      4.62      9.29
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500         1      .941     .0533      .112      .231      .403      .811      1.02      2.04      4.56      9.29
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff     sd_avg  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4719209  -.0045296  -.0090456   .5007475   1.007399
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0098847   .0009849   .0096855   .1016872   1.107894
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0214054   .0003337   .0022895   .1457719   1.023886
             |
          x4 |  .4347826    .445852  -.0110694  -.0222252   .4980573   1.003118
          x5 |  25.46739   25.27307   .1943233   .0308606   6.296806    .596745
          x6 |  11.86957   11.68981   .1797533   .0951549   1.889059   .5648484
          x7 |  6.858696   6.711046   .1476493    .042865   3.444517   1.141787
         x90 |  .0972024   .0841522   .0130502   .0130107   1.003034   .8251709
         x91 | -.0890157  -.0615794  -.0274362  -.0288473   .9510857   .9665176
         x92 |  .0453787   .0341522   .0112265   .0110442   1.016508   1.149085
         x93 |  .0865687   .0948113  -.0082427   -.008758   .9411576   .9741335
         x94 | -.1299173  -.1857505   .0558332   .0562053   .9933796   .7647728
         x95 | -.0807251  -.0974964   .0167713   .0178362   .9402985   .8954759
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.01616
  Mean absolute standardized diff.    = 0.02676
  Maximum absolute standardized diff. = 0.09515
  C.V. of matching weights:           = 1.04145
  S.D. of matching weights:           = 1.04145
  Skewness of matching weights:       = 0.13348
  Kurtosis of matching weights:       = 0.03590
  Maximum matching weight:            = 9.28896
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.454     3417.895   6.559175   .0395688   3417.895
   y1_binary |    .9470413     .9465176   .0005237   .0095404   .9465176
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , ate aequations

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  2.096e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |   -328.878   82.21905    -4.00   0.000    -490.0244   -167.7316
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3452.527   28.58753   120.77   0.000     3396.497    3508.558
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.207512   .3268258    -3.69   0.000    -1.848079   -.5669452
                        |
                     x2 |
                     1  |  -1.628792   1.054719    -1.54   0.123    -3.696005    .4384199
                        |
                     x3 |
                     1  |  -.5805318   .8259794    -0.70   0.482    -2.199422    1.038358
                     x4 |  -.2831153   .2838113    -1.00   0.318    -.8393752    .2731445
                     x5 |   .0545179   .0270259     2.02   0.044     .0015481    .1074878
                     x6 |  -.2844593   .0688093    -4.13   0.000     -.419323   -.1495955
                     x7 |    .023871   .0390129     0.61   0.541    -.0525929    .1003349
                    x90 |   .1439494   .1292697     1.11   0.265    -.1094145    .3973133
                    x91 |  -.1331182   .1248073    -1.07   0.286    -.3777361    .1114997
                    x92 |   .1277527    .133834     0.95   0.340    -.1345572    .3900625
                    x93 |   .0623585   .1243317     0.50   0.616    -.1813271    .3060441
                    x94 |  -.1663354   .1194682    -1.39   0.164    -.4004887    .0678179
                    x95 |    .017776   .1254901     0.14   0.887    -.2281801     .263732
                  _cons |   1.379538   .9297905     1.48   0.138    -.4428177    3.201894
-----------------------------------------------------------------------------------------
. psweight ipw `treatvar' `varlist' if `tousevar' , ate pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408         1      .194      .823      .832      .853      .878      .934      1.05      1.26      1.68      2.55
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92         1      .665      .277      .277      .449      .521      .754       1.3      1.68       4.9       4.9
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500         1      .334      .277      .414      .818      .867       .93      1.07      1.35      2.21       4.9
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6643106   .6980937  -.0337831  -.0730952   .4621798   1.067096
             |
          x2 |
          0  |  (empty)
          1  |  .0126474   .0237734   -.011126  -.0762399    .145934   .5426396
             |
          x3 |
          0  |  (empty)
          1  |  .0252967   .0398782  -.0145815  -.0769757   .1894293   .6494649
             |
          x4 |  .5035684   .4859058   .0176626   .0352982    .500383   1.009262
          x5 |  25.88638    26.3268  -.4404207  -.0736253    5.98192   .7436049
          x6 |  12.40345   12.88502  -.4815643   -.214612   2.243884   .5994444
          x7 |  6.783391   6.698872   .0845182   .0251498    3.36059   1.188955
         x90 | -.1279394  -.0237456  -.1041937  -.1022979   1.018533   1.179133
         x91 |  .0259183  -.0177924   .0437107   .0442269   .9883275   .9105384
         x92 |  .0197006  -.0121531   .0318537   .0312437   1.019527   1.201641
         x93 |  .0303493   .0505445  -.0201952  -.0208151   .9702151   .8788976
         x94 |  -.142924  -.0216133  -.1213108  -.1226343   .9892079   .7980325
         x95 | -.0930146  -.0717394  -.0212752  -.0217631   .9775833   .7971968
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.04970
  Mean absolute standardized diff.    = 0.07061
  Maximum absolute standardized diff. = 0.21461
  C.V. of matching weights:           = 0.33373
  S.D. of matching weights:           = 0.33373
  Skewness of matching weights:       = 0.18431
  Kurtosis of matching weights:       = 0.08385
  Maximum matching weight:            = 4.89817
. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' , atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  5.570e-18  
Iteration 1:   EE criterion =  4.050e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |     319.07   91.15096     3.50   0.000     140.4174    497.7225
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3141.406   87.28586    35.99   0.000     2970.328    3312.483
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.207512   .3268258     3.69   0.000     .5669452    1.848079
                        |
                     x2 |
                     1  |   1.628792   1.054719     1.54   0.123    -.4384199    3.696005
                        |
                     x3 |
                     1  |   .5805318   .8259794     0.70   0.482    -1.038358    2.199422
                     x4 |   .2831153   .2838113     1.00   0.318    -.2731445    .8393752
                     x5 |  -.0545179   .0270259    -2.02   0.044    -.1074878   -.0015481
                     x6 |   .2844593   .0688093     4.13   0.000     .1495955     .419323
                     x7 |   -.023871   .0390129    -0.61   0.541    -.1003349    .0525929
                    x90 |  -.1439494   .1292697    -1.11   0.265    -.3973133    .1094145
                    x91 |   .1331182   .1248073     1.07   0.286    -.1114997    .3777361
                    x92 |  -.1277527    .133834    -0.95   0.340    -.3900625    .1345572
                    x93 |  -.0623585   .1243317    -0.50   0.616    -.3060441    .1813271
                    x94 |   .1663354   .1194682     1.39   0.164    -.0678179    .4004887
                    x95 |   -.017776   .1254901    -0.14   0.887     -.263732    .2281801
                  _cons |  -1.379538   .9297905    -1.48   0.138    -3.201894    .4428177
-----------------------------------------------------------------------------------------
. psweight ipw `treatvar' `varlist' if `tousevar' , ateu pooledvariance

  408 control obs
  92 treatment obs
  (Data are unweighted.)
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.207512
        1.x2 |  -1.628789
        1.x3 |  -.5805312
          x4 |  -.2831152
          x5 |   .0545179
          x6 |  -.2844592
          x7 |   .0238709
         x90 |   .1439493
         x91 |  -.1331182
         x92 |   .1277526
         x93 |   .0623585
         x94 |  -.1663353
         x95 |   .0177759
       _cons |   1.379537
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .164      .121     .0121     .0225     .0467     .0739      .129      .226      .354      .515      .681
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92         1       .83     .0964     .0964      .312      .402      .693      1.38      1.85      5.87      5.87
         |        92      .272      .142     .0407     .0407      .119      .153      .264      .383      .444      .721      .721
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500         1      .355     .0964      .268      .804         1         1         1         1      2.29      5.87
         |       500      .184      .132     .0121      .025     .0493     .0845      .145      .258       .39      .579      .721
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .7133644        .75  -.0366356  -.0837821   .4372727   1.099818
             |
          x2 |
          0  |  (empty)
          1  |  .0130902   .0269608  -.0138706  -.0897954   .1544686   .4966403
             |
          x3 |
          0  |  (empty)
          1  |  .0261829   .0441176  -.0179347  -.0905493   .1980657    .609761
             |
          x4 |  .5207033    .495098   .0256053   .0511594   .5005007   1.006879
          x5 |  25.99075   26.56863   -.577878  -.1002906   5.762036   .7963305
          x6 |  12.53645   13.15931  -.6228673  -.2813566     2.2138   .6382822
          x7 |  6.764632   6.696078   .0685532   .0204092   3.358927   1.200431
         x90 | -.1840235   -.048508  -.1355155  -.1337092   1.013509   1.263776
         x91 |   .054549  -.0077434   .0622924   .0625861   .9953062   .8955527
         x92 |   .013304  -.0227801   .0360842   .0351881   1.025465    1.21557
         x93 |  .0163448   .0403853  -.0240406  -.0246383   .9757395    .857822
         x94 | -.1461641   .0160559  -.1622201  -.1661874    .976127   .8119355
         x95 |  -.096076  -.0658282  -.0302478  -.0307892   .9824155   .7755988
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.06398
  Mean absolute standardized diff.    = 0.09003
  Maximum absolute standardized diff. = 0.28136
  C.V. of matching weights:           = 0.83016
  S.D. of matching weights:           = 0.83016
  Skewness of matching weights:       = 0.26806
  Kurtosis of matching weights:       = 0.15504
  Maximum matching weight:            = 5.86923
. 
. // tradeoff between CBPS-like balance and variance in weights
. psweight cbps `treatvar' `varlist' if `tousevar' , atet treatvariance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  7.881e-09  
Iteration 1:   f(p) =  7.799e-09  (backed up)
Iteration 2:   f(p) =  7.301e-09  
Iteration 3:   f(p) =  5.045e-09  
Iteration 4:   f(p) =  4.162e-09  
Iteration 5:   f(p) =  3.700e-09  
Iteration 6:   f(p) =  3.063e-09  
Iteration 7:   f(p) =  2.655e-09  
Iteration 8:   f(p) =  2.353e-09  
Iteration 9:   f(p) =  2.232e-09  
Iteration 10:  f(p) =  1.928e-09  
Iteration 11:  f(p) =  1.687e-09  
Iteration 12:  f(p) =  1.155e-09  
Iteration 13:  f(p) =  8.603e-10  
Iteration 14:  f(p) =  7.497e-10  
Iteration 15:  f(p) =  4.770e-10  
Iteration 16:  f(p) =  2.775e-10  
Iteration 17:  f(p) =  7.322e-11  
Iteration 18:  f(p) =  4.498e-11  
Iteration 19:  f(p) =  4.378e-11  
Iteration 20:  f(p) =  3.530e-11  
Iteration 21:  f(p) =  2.766e-11  
Iteration 22:  f(p) =  4.069e-12  
Iteration 23:  f(p) =  1.178e-12  
Iteration 24:  f(p) =  1.153e-12  
Iteration 25:  f(p) =  1.026e-12  
Iteration 26:  f(p) =  7.702e-13  
Iteration 27:  f(p) =  4.187e-13  
Iteration 28:  f(p) =  2.188e-14  
Iteration 29:  f(p) =  2.709e-17  
Iteration 30:  f(p) =  8.507e-20  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.339291
        1.x2 |  -1.525177
        1.x3 |  -.5996257
          x4 |  -.3183659
          x5 |   .0587884
          x6 |  -.2435675
          x7 |   .0341033
         x90 |   .1585989
         x91 |   -.161762
         x92 |   .1391155
         x93 |    .057115
         x94 |  -.1175052
         x95 |   .0115049
       _cons |    .782857
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408         1      .988     .0568      .125      .226      .376      .636      1.25      2.36      4.58      7.03
         |       408      .163      .117     .0127     .0273     .0486     .0782      .125       .22      .347      .508      .613
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .273      .149     .0434     .0434      .108      .138      .264      .383      .459      .687      .687
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500         1      .893     .0568      .126      .247      .433      .808      1.05      2.06      4.53      7.03
         |       500      .183      .131     .0127     .0276     .0522     .0876      .141      .256      .389      .587      .687
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4673913  -1.05e-08  -2.09e-08   .5016695   1.008511
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0108696   1.35e-08   1.30e-07   .1042572   1.008512
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0217392  -3.35e-08  -2.29e-07   .1466296    1.00851
             |
          x4 |  .4347826   .4347826   4.50e-08   9.02e-08   .4984448   1.008511
          x5 |  25.46739   25.46739  -1.03e-06  -1.89e-07   5.443922   .6195799
          x6 |  11.86957   11.86957  -2.86e-07  -1.78e-07   1.605057   .5669465
          x7 |  6.858696   6.858695   3.44e-07   9.67e-08   3.556704   1.145237
         x90 |  .0972024   .0972024   5.59e-08   5.86e-08   .9537854    .845302
         x91 | -.0890157  -.0890157   1.15e-08   1.22e-08   .9429542   .9654928
         x92 |  .0453787   .0453787   2.30e-08   2.19e-08   1.051175   1.136731
         x93 |  .0865687   .0865686   2.88e-08   3.08e-08   .9349714   .9577067
         x94 | -.1299173  -.1299172  -2.89e-08  -3.12e-08   .9248091   .7795321
         x95 | -.0807251  -.0807251   7.57e-09   8.28e-09    .914005   .8888005
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00000
  C.V. of matching weights:           = 0.98844
  S.D. of matching weights:           = 0.98844
  Skewness of matching weights:       = 0.11001
  Kurtosis of matching weights:       = 0.02254
  Maximum matching weight:            = 7.03226
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.753     3424.753  -.0000267  -1.75e-07   3424.753
   y1_binary |    .9470393     .9470393  -8.59e-09  -1.64e-07   .9470393
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight pcbps `treatvar' `varlist' if `tousevar' , atet treatvariance cvtarget(1 .75 6) `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00061284  
Iteration 1:   f(p) =  2.180e-07  
Iteration 2:   f(p) =  1.269e-07  
Iteration 3:   f(p) =  1.206e-07  
Iteration 4:   f(p) =  1.176e-07  
Iteration 5:   f(p) =  1.170e-07  
Iteration 6:   f(p) =  1.170e-07  
Iteration 7:   f(p) =  1.161e-07  
Iteration 8:   f(p) =  8.908e-08  
Iteration 9:   f(p) =  8.321e-08  
Iteration 10:  f(p) =  8.293e-08  
Iteration 11:  f(p) =  8.279e-08  
Iteration 12:  f(p) =  8.224e-08  
Iteration 13:  f(p) =  8.214e-08  
Iteration 14:  f(p) =  8.209e-08  
Iteration 15:  f(p) =  8.207e-08  
Iteration 16:  f(p) =  8.207e-08  
Iteration 17:  f(p) =  8.207e-08  
Iteration 18:  f(p) =  8.206e-08  
Iteration 19:  f(p) =  8.191e-08  
Iteration 20:  f(p) =  7.969e-08  
Iteration 21:  f(p) =  7.849e-08  
Iteration 22:  f(p) =  7.612e-08  
Iteration 23:  f(p) =  7.604e-08  
Iteration 24:  f(p) =  7.603e-08  
Iteration 25:  f(p) =  7.602e-08  
Iteration 26:  f(p) =  7.602e-08  
Iteration 27:  f(p) =  7.602e-08  
Iteration 28:  f(p) =  7.602e-08  
Iteration 29:  f(p) =  7.601e-08  
Iteration 30:  f(p) =  7.596e-08  
Iteration 31:  f(p) =  7.449e-08  
Iteration 32:  f(p) =  7.272e-08  
Iteration 33:  f(p) =  6.357e-08  
Iteration 34:  f(p) =  5.430e-08  
Iteration 35:  f(p) =  5.188e-08  
Iteration 36:  f(p) =  4.995e-08  
Iteration 37:  f(p) =  4.832e-08  
Iteration 38:  f(p) =  4.824e-08  
Iteration 39:  f(p) =  4.804e-08  
Iteration 40:  f(p) =  4.804e-08  
Iteration 41:  f(p) =  4.803e-08  
Iteration 42:  f(p) =  4.803e-08  
Iteration 43:  f(p) =  4.803e-08  
Iteration 44:  f(p) =  4.803e-08  
Iteration 45:  f(p) =  4.795e-08  
Iteration 46:  f(p) =  4.645e-08  
Iteration 47:  f(p) =  3.640e-08  
Iteration 48:  f(p) =  3.539e-08  
Iteration 49:  f(p) =  3.424e-08  
Iteration 50:  f(p) =  3.417e-08  
Iteration 51:  f(p) =  3.414e-08  
Iteration 52:  f(p) =  3.413e-08  
Iteration 53:  f(p) =  3.413e-08  
Iteration 54:  f(p) =  3.413e-08  
Iteration 55:  f(p) =  3.413e-08  
Iteration 56:  f(p) =  3.413e-08  
Iteration 57:  f(p) =  3.405e-08  
Iteration 58:  f(p) =  3.013e-08  
Iteration 59:  f(p) =  2.794e-08  
Iteration 60:  f(p) =  2.777e-08  
Iteration 61:  f(p) =  2.757e-08  
Iteration 62:  f(p) =  2.755e-08  
Iteration 63:  f(p) =  2.755e-08  
Iteration 64:  f(p) =  2.755e-08  
Iteration 65:  f(p) =  2.755e-08  
Iteration 66:  f(p) =  2.755e-08  
Iteration 67:  f(p) =  2.754e-08  
Iteration 68:  f(p) =  2.745e-08  
Iteration 69:  f(p) =  2.364e-08  
Iteration 70:  f(p) =  1.903e-08  
Iteration 71:  f(p) =  1.749e-08  
Iteration 72:  f(p) =  1.724e-08  
Iteration 73:  f(p) =  1.720e-08  
Iteration 74:  f(p) =  1.719e-08  
Iteration 75:  f(p) =  1.719e-08  
Iteration 76:  f(p) =  1.719e-08  
Iteration 77:  f(p) =  1.719e-08  
Iteration 78:  f(p) =  1.719e-08  
Iteration 79:  f(p) =  1.715e-08  
Iteration 80:  f(p) =  1.440e-08  
Iteration 81:  f(p) =  1.395e-08  
Iteration 82:  f(p) =  1.393e-08  
Iteration 83:  f(p) =  1.393e-08  
Iteration 84:  f(p) =  1.393e-08  
Iteration 85:  f(p) =  1.393e-08  
Iteration 86:  f(p) =  1.393e-08  
Iteration 87:  f(p) =  1.393e-08  
Iteration 88:  f(p) =  1.391e-08  
Iteration 89:  f(p) =  1.364e-08  
Iteration 90:  f(p) =  1.239e-08  
Iteration 91:  f(p) =  1.213e-08  
Iteration 92:  f(p) =  1.213e-08  
Iteration 93:  f(p) =  1.213e-08  
Iteration 94:  f(p) =  1.213e-08  
Iteration 95:  f(p) =  1.213e-08  
Iteration 96:  f(p) =  1.213e-08  
Iteration 97:  f(p) =  1.212e-08  
Iteration 98:  f(p) =  1.186e-08  
Iteration 99:  f(p) =  1.179e-08  
Iteration 100: f(p) =  1.179e-08  
Iteration 101: f(p) =  1.179e-08  
Iteration 102: f(p) =  1.179e-08  
Iteration 103: f(p) =  1.179e-08  
Iteration 104: f(p) =  1.179e-08  
Iteration 105: f(p) =  1.179e-08  
Iteration 106: f(p) =  1.177e-08  
Iteration 107: f(p) =  1.176e-08  
Iteration 108: f(p) =  1.176e-08  
Iteration 109: f(p) =  1.176e-08  
Iteration 110: f(p) =  1.176e-08  
Iteration 111: f(p) =  1.176e-08  
Iteration 112: f(p) =  1.176e-08  
Iteration 113: f(p) =  1.165e-08  
Iteration 114: f(p) =  1.151e-08  
Iteration 115: f(p) =  1.150e-08  
Iteration 116: f(p) =  1.150e-08  
Iteration 117: f(p) =  1.150e-08  
Iteration 118: f(p) =  1.150e-08  
Iteration 119: f(p) =  1.150e-08  
Iteration 120: f(p) =  1.150e-08  
convergence not achieved

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified) + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.073656
        1.x2 |  -1.357287
        1.x3 |   -.426099
          x4 |  -.2443951
          x5 |    .044868
          x6 |  -.1989581
          x7 |   .0255953
         x90 |   .1234826
         x91 |  -.1253124
         x92 |   .1000967
         x93 |   .0449223
         x94 |  -.0972899
         x95 |  -.0000552
       _cons |   .4469634
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .778     .0931      .186      .326      .483      .723      1.27      2.16      3.55      4.99
         |       408         1      .778     .0931      .186      .326      .483      .723      1.27      2.16      3.55      4.99
         |       408      .163     .0963     .0195     .0382     .0651     .0935      .134      .214      .315      .431      .516
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .252      .116     .0586     .0586      .123      .148      .244      .342      .393      .584      .584
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .703     .0931      .197      .344      .531      .904      1.07      1.94       3.5      4.99
         |       500         1      .703     .0931      .197      .344      .531      .904      1.07      1.94       3.5      4.99
         |       500      .179      .106     .0195     .0403     .0678        .1      .148      .239      .344      .496      .584
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5178884  -.0504971  -.1006582   .5016695   1.005509
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0120498  -.0011802  -.0113201   .1042572   .9108199
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0254584  -.0037193   -.025365   .1466296   .8644626
             |
          x4 |  .4347826   .4525163  -.0177337  -.0355781   .4984448   1.000375
          x5 |  25.46739   25.54116  -.0737717  -.0135512   5.443922   .6518205
          x6 |  11.86957   12.06734  -.1977701  -.1232169   1.605057    .544754
          x7 |  6.858696   6.810735    .047961   .0134847   3.556704   1.145576
         x90 |  .0972024   .0714512   .0257512    .026999   .9537854   .8605208
         x91 | -.0890157  -.0724667  -.0165489  -.0175501   .9429542   .9393164
         x92 |  .0453787    .026232   .0191467   .0182146   1.051175   1.126467
         x93 |  .0865687    .074332   .0122367   .0130878   .9349714    .935284
         x94 | -.1299173  -.0987471  -.0311702  -.0337045   .9248091   .7976929
         x95 | -.0807251  -.0887859   .0080608   .0088193    .914005   .8754237
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.02156
  Mean absolute standardized diff.    = 0.03397
  Maximum absolute standardized diff. = 0.12322
  C.V. of matching weights:           = 0.77808
  S.D. of matching weights:           = 0.77808
  Skewness of matching weights:       = 0.08652
  Kurtosis of matching weights:       = 0.01552
  Maximum matching weight:            = 4.98764
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3425.503     3432.804  -7.301175  -.0500692   3432.804
   y1_binary |    .9471279     .9495997  -.0024718  -.0513101   .9495997
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight cbps `treatvar' `varlist' if `tousevar' , atet treatvariance cvtarget(1 .50 6) `depvaropt' // could say pcbps or cbps

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02519573  
Iteration 1:   f(p) =  .00037232  
Iteration 2:   f(p) =  .00018115  
Iteration 3:   f(p) =  .00007047  
Iteration 4:   f(p) =  .00006335  
Iteration 5:   f(p) =  .00005995  
Iteration 6:   f(p) =  .00003158  
Iteration 7:   f(p) =  .00001706  
Iteration 8:   f(p) =  .00001448  
Iteration 9:   f(p) =  .00001017  
Iteration 10:  f(p) =  9.753e-06  
Iteration 11:  f(p) =  9.539e-06  
Iteration 12:  f(p) =  9.503e-06  
Iteration 13:  f(p) =  9.419e-06  
Iteration 14:  f(p) =  8.004e-06  
Iteration 15:  f(p) =  7.195e-06  
Iteration 16:  f(p) =  7.087e-06  
Iteration 17:  f(p) =  3.985e-06  
Iteration 18:  f(p) =  2.991e-06  
Iteration 19:  f(p) =  1.995e-06  
Iteration 20:  f(p) =  1.368e-06  
Iteration 21:  f(p) =  1.304e-06  
Iteration 22:  f(p) =  1.290e-06  
Iteration 23:  f(p) =  1.271e-06  
Iteration 24:  f(p) =  1.266e-06  
Iteration 25:  f(p) =  1.264e-06  
Iteration 26:  f(p) =  1.263e-06  
Iteration 27:  f(p) =  1.259e-06  
Iteration 28:  f(p) =  1.148e-06  
Iteration 29:  f(p) =  3.117e-07  
Iteration 30:  f(p) =  1.157e-07  
Iteration 31:  f(p) =  1.078e-07  
Iteration 32:  f(p) =  1.048e-07  
Iteration 33:  f(p) =  9.478e-08  
Iteration 34:  f(p) =  9.352e-08  
Iteration 35:  f(p) =  9.230e-08  
Iteration 36:  f(p) =  8.645e-08  
Iteration 37:  f(p) =  8.118e-08  
Iteration 38:  f(p) =  7.987e-08  
Iteration 39:  f(p) =  7.976e-08  
Iteration 40:  f(p) =  7.976e-08  
Iteration 41:  f(p) =  7.976e-08  
Iteration 42:  f(p) =  7.976e-08  
Iteration 43:  f(p) =  7.975e-08  
Iteration 44:  f(p) =  7.975e-08  
Iteration 45:  f(p) =  7.975e-08  
Iteration 46:  f(p) =  7.975e-08  
Iteration 47:  f(p) =  7.975e-08  
Iteration 48:  f(p) =  7.975e-08  
Iteration 49:  f(p) =  7.975e-08  
Iteration 50:  f(p) =  7.973e-08  
Iteration 51:  f(p) =  7.946e-08  
Iteration 52:  f(p) =  7.808e-08  
Iteration 53:  f(p) =  7.697e-08  
Iteration 54:  f(p) =  7.688e-08  
Iteration 55:  f(p) =  7.688e-08  
Iteration 56:  f(p) =  7.688e-08  
Iteration 57:  f(p) =  7.688e-08  
Iteration 58:  f(p) =  7.688e-08  
Iteration 59:  f(p) =  7.687e-08  
Iteration 60:  f(p) =  7.382e-08  
Iteration 61:  f(p) =  7.267e-08  
Iteration 62:  f(p) =  7.261e-08  
Iteration 63:  f(p) =  7.261e-08  
Iteration 64:  f(p) =  7.261e-08  
Iteration 65:  f(p) =  7.261e-08  
Iteration 66:  f(p) =  7.261e-08  
Iteration 67:  f(p) =  7.260e-08  
Iteration 68:  f(p) =  7.144e-08  
Iteration 69:  f(p) =  6.561e-08  
Iteration 70:  f(p) =  5.732e-08  
Iteration 71:  f(p) =  5.540e-08  
Iteration 72:  f(p) =  5.399e-08  
Iteration 73:  f(p) =  5.389e-08  
Iteration 74:  f(p) =  5.386e-08  
Iteration 75:  f(p) =  5.385e-08  
Iteration 76:  f(p) =  5.385e-08  
Iteration 77:  f(p) =  5.385e-08  
Iteration 78:  f(p) =  5.385e-08  
Iteration 79:  f(p) =  5.384e-08  
Iteration 80:  f(p) =  5.363e-08  
Iteration 81:  f(p) =  5.307e-08  
Iteration 82:  f(p) =  5.292e-08  
Iteration 83:  f(p) =  5.292e-08  
Iteration 84:  f(p) =  5.292e-08  
Iteration 85:  f(p) =  5.292e-08  
Iteration 86:  f(p) =  5.292e-08  
Iteration 87:  f(p) =  5.292e-08  
Iteration 88:  f(p) =  5.291e-08  
Iteration 89:  f(p) =  5.235e-08  
Iteration 90:  f(p) =  5.217e-08  
Iteration 91:  f(p) =  5.216e-08  
Iteration 92:  f(p) =  5.215e-08  
Iteration 93:  f(p) =  5.215e-08  
Iteration 94:  f(p) =  5.215e-08  
Iteration 95:  f(p) =  5.215e-08  
Iteration 96:  f(p) =  5.215e-08  
Iteration 97:  f(p) =  5.215e-08  
Iteration 98:  f(p) =  5.212e-08  
Iteration 99:  f(p) =  5.211e-08  
Iteration 100: f(p) =  5.211e-08  
Iteration 101: f(p) =  5.211e-08  
Iteration 102: f(p) =  5.211e-08  
Iteration 103: f(p) =  5.211e-08  
Iteration 104: f(p) =  5.210e-08  
Iteration 105: f(p) =  5.209e-08  
Iteration 106: f(p) =  5.156e-08  
Iteration 107: f(p) =  5.137e-08  
Iteration 108: f(p) =  5.137e-08  
Iteration 109: f(p) =  5.137e-08  
Iteration 110: f(p) =  5.137e-08  
Iteration 111: f(p) =  5.137e-08  
Iteration 112: f(p) =  5.137e-08  
Iteration 113: f(p) =  5.137e-08  
Iteration 114: f(p) =  5.127e-08  
Iteration 115: f(p) =  5.124e-08  
Iteration 116: f(p) =  5.124e-08  
Iteration 117: f(p) =  5.124e-08  
Iteration 118: f(p) =  5.124e-08  
Iteration 119: f(p) =  5.124e-08  
Iteration 120: f(p) =  5.124e-08  
convergence not achieved

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified) + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.7224024
        1.x2 |  -1.021344
        1.x3 |  -.2940339
          x4 |  -.1690249
          x5 |   .0287638
          x6 |  -.1461145
          x7 |   .0165972
         x90 |   .0850387
         x91 |  -.0877087
         x92 |   .0645717
         x93 |   .0348086
         x94 |  -.0665578
         x95 |  -.0074344
       _cons |   -.074803
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .532      .186      .321      .465      .621       .84      1.25      1.81       2.6      3.27
         |       408         1      .532      .186      .321      .465      .621       .84      1.25      1.81       2.6      3.27
         |       408      .153     .0657      .034     .0572     .0808      .105      .137      .191      .255       .33      .382
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .213     .0735     .0761     .0761      .132      .149      .212      .269      .301      .428      .428
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .481      .186      .334      .496      .672      .996      1.11      1.69      2.58      3.27
         |       500         1      .481      .186      .334      .496      .672      .996      1.11      1.69      2.58      3.27
         |       500      .164      .071      .034     .0593     .0851      .112      .148      .205      .274      .368      .428
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5905559  -.1231646  -.2455094   .5016695   1.038279
             |
          x2 |
          0  |  (empty)
          1  |  .0108696    .014679  -.0038094  -.0365386   .1042572   .7496746
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0298417  -.0081026   -.055259   .1466296   .7408168
             |
          x4 |  .4347826   .4668714  -.0320888  -.0643778   .4984448   .9957243
          x5 |  25.46739   25.76506  -.2976736    -.05468   5.443922   .6999714
          x6 |  11.86957   12.34453   -.474962  -.2959161   1.605057   .5220083
          x7 |  6.858696   6.762718   .0959776    .026985   3.556704   1.148817
         x90 |  .0972024   .0378192   .0593833   .0622606   .9537854   .8843411
         x91 | -.0890157  -.0568697   -.032146  -.0340908   .9429542   .9109494
         x92 |  .0453787   .0106761   .0347026   .0330132   1.051175   1.115449
         x93 |  .0865687    .066231   .0203377   .0217522   .9349714   .9143301
         x94 | -.1299173  -.0574975  -.0724197  -.0783078   .9248091   .8187332
         x95 | -.0807251  -.0932284   .0125033   .0136797    .914005     .86217
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.05438
  Mean absolute standardized diff.    = 0.07864
  Maximum absolute standardized diff. = 0.29592
  C.V. of matching weights:           = 0.53216
  S.D. of matching weights:           = 0.53216
  Skewness of matching weights:       = 0.06302
  Kurtosis of matching weights:       = 0.01078
  Maximum matching weight:            = 3.26635
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3428.445     3442.407   -13.9619  -.1011781   3442.407
   y1_binary |     .947451     .9529074  -.0054564  -.1239468   .9529074
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' , atet treatvariance cvtarget(1 .75 6) difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00093921  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00042753  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00003686  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00002767  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00001518  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  6.684e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  3.117e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  1.306e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  3.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.977e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  7.501e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  5.838e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  4.674e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  4.256e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  3.975e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  3.921e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  3.899e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  3.886e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  1.448e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  4.466e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  1.208e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.072e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  6.703e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  2.985e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.985e-11  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.160046
        1.x2 |  -1.628441
        1.x3 |  -.5814357
          x4 |  -.2659449
          x5 |   .0170283
          x6 |  -.0953924
          x7 |  -.0355686
         x90 |   .0835476
         x91 |  -.1365717
         x92 |    .082697
         x93 |   .0139936
         x94 |  -.1221271
         x95 |  -.0032402
       _cons |   1.406409
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .766      .102       .22      .398      .502       .71      1.13       2.2      3.66      4.32
         |       408         1      .766      .102       .22      .398      .502       .71      1.13       2.2      3.66      4.32
         |       408      .342      .142     .0592       .12      .197      .236      .305      .412      .576      .693      .727
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .459      .149      .161      .161      .273      .319       .46      .585      .664      .718      .718
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .692      .102      .222      .419      .537      .828         1      2.04       3.6      4.32
         |       500         1      .692      .102      .222      .419      .537      .828         1      2.04       3.6      4.32
         |       500      .363       .15     .0592       .12      .205      .247      .321      .482      .593       .71      .727
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4906044  -.0232131  -.0462717   .5016695   1.004576
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0090275    .001842   .0176681   .1042572   1.212036
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0197194   .0020197   .0137741   .1466296   1.109514
             |
          x4 |  .4347826   .4805567  -.0457741  -.0918339   .4984448   .9928544
          x5 |  25.46739   24.90307   .5643257   .1036616   5.443922    .728936
          x6 |  11.86957   12.30349  -.4339289  -.2703512   1.605057   .5293091
          x7 |  6.858696    6.15658   .7021156   .1974063   3.556704   1.137638
         x90 |  .0972024   .0737146   .0234879   .0246259   .9537854   .8425804
         x91 | -.0890157  -.0912725   .0022568   .0023933   .9429542    .935052
         x92 |  .0453787   .0468218  -.0014432  -.0013729   1.051175   1.108073
         x93 |  .0865687   .0544884   .0320802   .0343114   .9349714   .9460123
         x94 | -.1299173  -.1374836   .0075663   .0081815   .9248091   .8219538
         x95 | -.0807251  -.0878851     .00716   .0078336    .914005   .8758486
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00000
  Mean absolute standardized diff.    = 0.06305
  Maximum absolute standardized diff. = 0.27035
  C.V. of matching weights:           = 0.76584
  S.D. of matching weights:           = 0.76584
  Skewness of matching weights:       = 0.08805
  Kurtosis of matching weights:       = 0.01485
  Maximum matching weight:            = 4.31530
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3429.056     3447.255  -18.19924  -.1299997   3447.255
   y1_binary |    .9477352     .9592501  -.0115149  -.2660966   .9592501
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' , atet treatvariance cvtarget(1 .50 6) difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .0255221  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00707055  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00121893  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00077435  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00038439  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00027065  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00020657  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00014905  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004814  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00002729  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00002254  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00001783  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001699  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  .00001552  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00001133  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  9.051e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  2.745e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  1.278e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  6.474e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  2.155e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.112e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.949e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.908e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  1.907e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  1.903e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  1.893e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  1.886e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.883e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  1.882e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  1.877e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  1.691e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  6.806e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  3.368e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  1.433e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  6.449e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  3.440e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  1.315e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  7.718e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  5.383e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  4.325e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 40:  f(p) =  4.204e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 41:  f(p) =  4.112e-10  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.5194657
        1.x2 |  -1.632351
        1.x3 |   -.607562
          x4 |    -.17982
          x5 |  -.0133429
          x6 |  -.0515526
          x7 |  -.0224691
         x90 |  -.1531418
         x91 |  -.1162048
         x92 |  -.1676401
         x93 |  -.1161679
         x94 |  -.0137663
         x95 |  -.1495327
       _cons |   1.379452
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .527      .113      .159      .456      .646      .898      1.22      1.68      2.88      3.24
         |       408         1      .527      .113      .159      .456      .646      .898      1.22      1.68      2.88      3.24
         |       408      .422      .118     .0846      .115      .271      .345      .422      .498      .577      .701      .725
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .48      .111      .148      .148      .335      .417      .477      .557      .627       .73       .73
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .476      .113      .197      .498      .713         1      1.14      1.56      2.87      3.24
         |       500         1      .476      .113      .197      .498      .713         1      1.14      1.56      2.87      3.24
         |       500      .433      .119     .0846      .132      .287      .353      .433      .507      .586      .702       .73
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .6184849  -.1510936  -.3011816   .5016695   1.063968
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0070156    .003854    .036966   .1042572   1.556465
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0188815   .0028577    .019489   .1466296   1.157765
             |
          x4 |  .4347826    .512792  -.0780094  -.1565056   .4984448   .9920024
          x5 |  25.46739   25.20748   .2599119   .0477435   5.443922   .7911694
          x6 |  11.86957   12.55084  -.6812718  -.4244535   1.605057   .5023811
          x7 |  6.858696   6.467188   .3915075   .1100759   3.556704    1.13778
         x90 |  .0972024  -.1624989   .2597014   .2722849   .9537854   .8848777
         x91 | -.0890157  -.0823113  -.0067044    -.00711   .9429542   .9285862
         x92 |  .0453787  -.1949211   .2402997    .228601   1.051175   1.114809
         x93 |  .0865687  -.0799771   .1665458   .1781293   .9349714   .8341126
         x94 | -.1299173  -.0138528  -.1160645   -.125501   .9248091   .8378465
         x95 | -.0807251  -.1917338   .1110087    .121453    .914005   .8724406
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.15611
  Maximum absolute standardized diff. = 0.42445
  C.V. of matching weights:           = 0.52726
  S.D. of matching weights:           = 0.52726
  Skewness of matching weights:       = 0.07134
  Kurtosis of matching weights:       = 0.01424
  Maximum matching weight:            = 3.23893
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3440.845     3470.435  -29.58933  -.1879542   3470.435
   y1_binary |    .9488568     .9570393  -.0081825  -.1914123   .9570393
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight cbpsoid `treatvar' `varlist' if `tousevar' , atet treatvariance cvtarget(1 .75 6) `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00061301  
Iteration 1:   f(p) =  .00010314  
Iteration 2:   f(p) =  .00006546  
Iteration 3:   f(p) =  .00002385  
Iteration 4:   f(p) =  .00001692  
Iteration 5:   f(p) =  .00001277  
Iteration 6:   f(p) =  .00001168  
Iteration 7:   f(p) =  .00001092  
Iteration 8:   f(p) =  8.593e-06  
Iteration 9:   f(p) =  5.345e-06  
Iteration 10:  f(p) =  4.603e-06  
Iteration 11:  f(p) =  4.428e-06  
Iteration 12:  f(p) =  4.385e-06  
Iteration 13:  f(p) =  4.339e-06  
Iteration 14:  f(p) =  4.227e-06  
Iteration 15:  f(p) =  1.715e-06  
Iteration 16:  f(p) =  7.788e-07  
Iteration 17:  f(p) =  7.309e-07  
Iteration 18:  f(p) =  7.196e-07  
Iteration 19:  f(p) =  7.177e-07  
Iteration 20:  f(p) =  7.164e-07  
Iteration 21:  f(p) =  7.161e-07  
Iteration 22:  f(p) =  7.159e-07  
Iteration 23:  f(p) =  7.155e-07  
Iteration 24:  f(p) =  7.147e-07  
Iteration 25:  f(p) =  6.924e-07  
Iteration 26:  f(p) =  3.508e-07  
Iteration 27:  f(p) =  2.867e-07  
Iteration 28:  f(p) =  2.794e-07  
Iteration 29:  f(p) =  2.787e-07  
Iteration 30:  f(p) =  2.787e-07  
Iteration 31:  f(p) =  2.787e-07  
Iteration 32:  f(p) =  2.787e-07  
Iteration 33:  f(p) =  2.777e-07  
Iteration 34:  f(p) =  2.746e-07  
Iteration 35:  f(p) =  2.559e-07  
Iteration 36:  f(p) =  2.553e-07  
Iteration 37:  f(p) =  2.553e-07  
Iteration 38:  f(p) =  2.553e-07  
Iteration 39:  f(p) =  2.553e-07  
Iteration 40:  f(p) =  2.553e-07  
Iteration 41:  f(p) =  2.531e-07  
Iteration 42:  f(p) =  2.445e-07  
Iteration 43:  f(p) =  2.442e-07  
Iteration 44:  f(p) =  2.442e-07  
Iteration 45:  f(p) =  2.442e-07  
Iteration 46:  f(p) =  2.439e-07  
Iteration 47:  f(p) =  1.995e-07  
Iteration 48:  f(p) =  1.786e-07  
Iteration 49:  f(p) =  1.783e-07  
Iteration 50:  f(p) =  1.783e-07  
Iteration 51:  f(p) =  1.783e-07  
Iteration 52:  f(p) =  1.783e-07  
Iteration 53:  f(p) =  1.783e-07  
Iteration 54:  f(p) =  1.782e-07  
Iteration 55:  f(p) =  1.778e-07  
Iteration 56:  f(p) =  1.761e-07  
Iteration 57:  f(p) =  1.751e-07  
Iteration 58:  f(p) =  1.751e-07  
Iteration 59:  f(p) =  1.751e-07  
Iteration 60:  f(p) =  1.751e-07  
Iteration 61:  f(p) =  1.751e-07  
Iteration 62:  f(p) =  1.750e-07  
Iteration 63:  f(p) =  1.750e-07  
Iteration 64:  f(p) =  1.746e-07  
Iteration 65:  f(p) =  1.730e-07  
Iteration 66:  f(p) =  1.728e-07  
Iteration 67:  f(p) =  1.728e-07  
Iteration 68:  f(p) =  1.728e-07  
Iteration 69:  f(p) =  1.728e-07  
Iteration 70:  f(p) =  1.728e-07  
Iteration 71:  f(p) =  1.728e-07  
Iteration 72:  f(p) =  1.728e-07  
Iteration 73:  f(p) =  1.728e-07  
Iteration 74:  f(p) =  1.728e-07  
Iteration 75:  f(p) =  1.728e-07  
Iteration 76:  f(p) =  1.728e-07  
Iteration 77:  f(p) =  1.728e-07  
Iteration 78:  f(p) =  1.728e-07  
Iteration 79:  f(p) =  1.728e-07  
Iteration 80:  f(p) =  1.726e-07  
Iteration 81:  f(p) =  1.719e-07  
Iteration 82:  f(p) =  1.718e-07  
Iteration 83:  f(p) =  1.718e-07  
Iteration 84:  f(p) =  1.718e-07  
Iteration 85:  f(p) =  1.718e-07  
Iteration 86:  f(p) =  1.718e-07  
Iteration 87:  f(p) =  1.718e-07  
Iteration 88:  f(p) =  1.718e-07  
Iteration 89:  f(p) =  1.718e-07  
Iteration 90:  f(p) =  1.718e-07  
Iteration 91:  f(p) =  1.718e-07  
Iteration 92:  f(p) =  1.718e-07  
Iteration 93:  f(p) =  1.718e-07  
Iteration 94:  f(p) =  1.717e-07  
Iteration 95:  f(p) =  1.716e-07  
Iteration 96:  f(p) =  1.716e-07  
Iteration 97:  f(p) =  1.716e-07  
Iteration 98:  f(p) =  1.716e-07  

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (over identified) + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.059191
        1.x2 |   -1.39265
        1.x3 |  -.3876984
          x4 |  -.2597607
          x5 |   .0455692
          x6 |  -.2089932
          x7 |   .0230333
         x90 |   .1272559
         x91 |  -.1212326
         x92 |   .0972184
         x93 |    .048144
         x94 |  -.1060477
         x95 |   .0105288
       _cons |   .6347726
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408         1      .793     .0894      .182      .316      .465       .72      1.28      2.17      3.54      5.44
         |       408      .171      .101       .02       .04     .0674     .0961      .141      .226      .332      .447      .554
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .265       .12     .0589     .0589       .13      .162       .26      .354       .41      .613      .613
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500         1      .717     .0894      .192      .331      .524      .906      1.07      1.93      3.49      5.44
         |       500      .189      .111       .02     .0421     .0698      .105      .158      .255      .363      .521      .613
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5187629  -.0513716  -.1024012   .5016695   1.005638
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0118444  -.0009749  -.0093507   .1042572   .9264168
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0264242   -.004685  -.0319515   .1466296   .8336936
             |
          x4 |  .4347826   .4476614  -.0128788   -.025838   .4984448   1.002336
          x5 |  25.46739   25.56132  -.0939325  -.0172546   5.443922   .6467529
          x6 |  11.86957   12.03336  -.1637987  -.1020517   1.605057   .5461046
          x7 |  6.858696   6.780637   .0780586   .0219469   3.556704   1.144355
         x90 |  .0972024   .0722594    .024943   .0261516   .9537854   .8581527
         x91 | -.0890157  -.0683618  -.0206539  -.0219034   .9429542   .9389306
         x92 |  .0453787   .0233094   .0220693   .0209948   1.051175   1.130348
         x93 |  .0865687   .0787138   .0078548   .0084011   .9349714   .9405748
         x94 | -.1299173  -.1086981  -.0212191  -.0229444   .9248091   .7927288
         x95 | -.0807251  -.0823446   .0016195   .0017719    .914005   .8768564
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.01957
  Mean absolute standardized diff.    = 0.03177
  Maximum absolute standardized diff. = 0.10240
  C.V. of matching weights:           = 0.79338
  S.D. of matching weights:           = 0.79338
  Skewness of matching weights:       = 0.09066
  Kurtosis of matching weights:       = 0.01713
  Maximum matching weight:            = 5.44201
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3425.359     3432.345  -6.985718  -.0476742   3432.345
   y1_binary |    .9471559     .9496655  -.0025096  -.0515552   .9496655
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. // furthermore, you can target skiwness, kurtosis, or max weight
. psweight pcbps `treatvar' `varlist' if `tousevar', atet treatvariance cvtarget(1 .5 6) skewtarget(1 0.07 2) `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02922492  
Iteration 1:   f(p) =  .00522908  
Iteration 2:   f(p) =  .00462687  
Iteration 3:   f(p) =  .00015809  
Iteration 4:   f(p) =  .00007042  
Iteration 5:   f(p) =  .00005102  
Iteration 6:   f(p) =  .00004883  
Iteration 7:   f(p) =  .00004294  
Iteration 8:   f(p) =  .00004231  
Iteration 9:   f(p) =  .00003877  
Iteration 10:  f(p) =  .00003114  
Iteration 11:  f(p) =  .00001635  
Iteration 12:  f(p) =  .00001252  
Iteration 13:  f(p) =  8.521e-06  
Iteration 14:  f(p) =  8.189e-06  
Iteration 15:  f(p) =  6.663e-06  
Iteration 16:  f(p) =  6.617e-06  
Iteration 17:  f(p) =  6.443e-06  
Iteration 18:  f(p) =  6.419e-06  
Iteration 19:  f(p) =  6.401e-06  
Iteration 20:  f(p) =  6.272e-06  
Iteration 21:  f(p) =  6.219e-06  
Iteration 22:  f(p) =  5.932e-06  
Iteration 23:  f(p) =  5.684e-06  
Iteration 24:  f(p) =  4.790e-06  
Iteration 25:  f(p) =  4.087e-06  
Iteration 26:  f(p) =  3.230e-06  
Iteration 27:  f(p) =  3.055e-06  
Iteration 28:  f(p) =  2.979e-06  
Iteration 29:  f(p) =  2.957e-06  
Iteration 30:  f(p) =  2.770e-06  
Iteration 31:  f(p) =  2.763e-06  
Iteration 32:  f(p) =  2.718e-06  
Iteration 33:  f(p) =  2.658e-06  
Iteration 34:  f(p) =  2.657e-06  
Iteration 35:  f(p) =  2.616e-06  
Iteration 36:  f(p) =  2.583e-06  
Iteration 37:  f(p) =  2.560e-06  
Iteration 38:  f(p) =  2.557e-06  
Iteration 39:  f(p) =  2.536e-06  
Iteration 40:  f(p) =  2.528e-06  
Iteration 41:  f(p) =  2.503e-06  
Iteration 42:  f(p) =  2.464e-06  
Iteration 43:  f(p) =  2.417e-06  
Iteration 44:  f(p) =  2.388e-06  
Iteration 45:  f(p) =  2.322e-06  
Iteration 46:  f(p) =  2.221e-06  
Iteration 47:  f(p) =  2.111e-06  
Iteration 48:  f(p) =  1.999e-06  
Iteration 49:  f(p) =  1.840e-06  
Iteration 50:  f(p) =  1.740e-06  
Iteration 51:  f(p) =  1.583e-06  
Iteration 52:  f(p) =  1.449e-06  
Iteration 53:  f(p) =  8.170e-07  
Iteration 54:  f(p) =  7.373e-07  
Iteration 55:  f(p) =  5.992e-07  
Iteration 56:  f(p) =  5.410e-07  
Iteration 57:  f(p) =  2.894e-07  
Iteration 58:  f(p) =  2.619e-07  
Iteration 59:  f(p) =  2.402e-07  
Iteration 60:  f(p) =  2.341e-07  
Iteration 61:  f(p) =  2.314e-07  
Iteration 62:  f(p) =  2.270e-07  
Iteration 63:  f(p) =  2.210e-07  
Iteration 64:  f(p) =  2.197e-07  
Iteration 65:  f(p) =  2.166e-07  
Iteration 66:  f(p) =  2.153e-07  
Iteration 67:  f(p) =  2.132e-07  
Iteration 68:  f(p) =  2.120e-07  
Iteration 69:  f(p) =  2.111e-07  
Iteration 70:  f(p) =  2.105e-07  
Iteration 71:  f(p) =  2.095e-07  
Iteration 72:  f(p) =  2.089e-07  
Iteration 73:  f(p) =  2.079e-07  
Iteration 74:  f(p) =  2.071e-07  
Iteration 75:  f(p) =  2.067e-07  
Iteration 76:  f(p) =  2.057e-07  
Iteration 77:  f(p) =  2.042e-07  
Iteration 78:  f(p) =  2.029e-07  
Iteration 79:  f(p) =  2.021e-07  
Iteration 80:  f(p) =  2.008e-07  
Iteration 81:  f(p) =  2.001e-07  
Iteration 82:  f(p) =  1.997e-07  
Iteration 83:  f(p) =  1.994e-07  
Iteration 84:  f(p) =  1.990e-07  
Iteration 85:  f(p) =  1.988e-07  
Iteration 86:  f(p) =  1.988e-07  
Iteration 87:  f(p) =  1.987e-07  
Iteration 88:  f(p) =  1.981e-07  
Iteration 89:  f(p) =  1.979e-07  
Iteration 90:  f(p) =  1.978e-07  
Iteration 91:  f(p) =  1.973e-07  
Iteration 92:  f(p) =  1.970e-07  
Iteration 93:  f(p) =  1.970e-07  
Iteration 94:  f(p) =  1.968e-07  
Iteration 95:  f(p) =  1.967e-07  
Iteration 96:  f(p) =  1.966e-07  
Iteration 97:  f(p) =  1.965e-07  
Iteration 98:  f(p) =  1.961e-07  
Iteration 99:  f(p) =  1.960e-07  
Iteration 100: f(p) =  1.951e-07  
Iteration 101: f(p) =  1.943e-07  
Iteration 102: f(p) =  1.939e-07  
Iteration 103: f(p) =  1.911e-07  
Iteration 104: f(p) =  1.869e-07  
Iteration 105: f(p) =  1.816e-07  
Iteration 106: f(p) =  1.797e-07  
Iteration 107: f(p) =  1.751e-07  
Iteration 108: f(p) =  1.592e-07  
Iteration 109: f(p) =  1.567e-07  
Iteration 110: f(p) =  1.484e-07  
Iteration 111: f(p) =  1.433e-07  
Iteration 112: f(p) =  1.380e-07  
Iteration 113: f(p) =  1.318e-07  
Iteration 114: f(p) =  1.251e-07  
Iteration 115: f(p) =  1.227e-07  
Iteration 116: f(p) =  1.154e-07  
Iteration 117: f(p) =  1.112e-07  
Iteration 118: f(p) =  1.052e-07  
Iteration 119: f(p) =  1.027e-07  
Iteration 120: f(p) =  1.019e-07  
convergence not achieved

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified) + 1*abs(wgt_cv()-.5)^6) + 1*abs(wgt_skewness()-.07)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |   -.130045
        1.x2 |  -1.584177
        1.x3 |  -.5143218
          x4 |   -.358212
          x5 |   .0056119
          x6 |  -.2063738
          x7 |    .000144
         x90 |   .0068154
         x91 |  -.0649166
         x92 |   .0120208
         x93 |   .0389162
         x94 |  -.0454173
         x95 |  -.0385836
       _cons |   1.091068
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      .544      .102      .213      .405      .582      .936      1.32      1.57      2.92      4.04
         |       408         1      .544      .102      .213      .405      .582      .936      1.32      1.57      2.92      4.04
         |       408      .153     .0674     .0189     .0387     .0711     .0992       .15      .199      .228      .356      .433
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92        .2     .0644      .063      .063      .134      .154      .193      .237      .284      .435      .435
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .491      .102      .215      .424      .641         1      1.23      1.52       2.9      4.04
         |       500         1      .491      .102      .215      .424      .641         1      1.23      1.52       2.9      4.04
         |       500      .162     .0691     .0189      .039     .0734      .107      .159      .207      .245      .357      .435
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .6742209  -.2068296  -.4122826   .5016695   1.142994
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0070276    .003842   .0368512   .1042572   1.553834
             |
          x3 |
          0  |  (empty)
          1  |  .0217391    .024303  -.0025639  -.0174854   .1466296   .9044877
             |
          x4 |  .4347826   .4283199   .0064628   .0129658   .4984448   1.012155
          x5 |  25.46739   25.85025  -.3828615  -.0703282   5.443922   .7266695
          x6 |  11.86957   12.18378  -.3142153  -.1957659   1.605057   .5355347
          x7 |  6.858696   6.606695   .2520004   .0708522   3.556704   1.149306
         x90 |  .0972024  -.0433321   .1405346    .147344   .9537854   .8856353
         x91 | -.0890157  -.0475715  -.0414442  -.0439515   .9429542   .8819946
         x92 |  .0453787  -.0366162   .0819949   .0780031   1.051175   1.144213
         x93 |  .0865687   .0871105  -.0005418  -.0005795   .9349714   .9177746
         x94 | -.1299173  -.0363326  -.0935846  -.1011935   .9248091    .808256
         x95 | -.0807251  -.1459512   .0652261    .071363    .914005   .8809705
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.03263
  Mean absolute standardized diff.    = 0.09684
  Maximum absolute standardized diff. = 0.41228
  C.V. of matching weights:           = 0.54396
  S.D. of matching weights:           = 0.54396
  Skewness of matching weights:       = 0.07003
  Kurtosis of matching weights:       = 0.01671
  Maximum matching weight:            = 4.04039
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3427.429     3451.959  -24.52926  -.1740371   3451.959
   y1_binary |    .9477666     .9545437  -.0067771   -.155058   .9545437
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. capture nois {
. psweight pcbps `treatvar' `varlist' if `tousevar', atet treatvariance maxtarget(1 10 2) difficult nonrtolerance `depvaropt'

  408 control obs
  92 treatment obs
  (Data are unweighted.)
  Step 1 (initial values from logit model):
initial:       f(p) = -346.57359
alternative:   f(p) = -283.03849
rescale:       f(p) = -247.46401
Iteration 0:   f(p) = -247.46401  
Iteration 1:   f(p) = -223.85141  
Iteration 2:   f(p) = -211.21662  
Iteration 3:   f(p) = -211.17754  
Iteration 4:   f(p) = -211.17753  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .50557896  
Iteration 1:   f(p) =    .060094  (backed up)
Iteration 2:   f(p) =  .00002051  
Iteration 3:   f(p) =  2.925e-06  (backed up)
Iteration 4:   f(p) =  2.883e-06  
Iteration 5:   f(p) =  2.836e-06  
Iteration 6:   f(p) =  2.800e-06  
Iteration 7:   f(p) =  2.536e-06  
Iteration 8:   f(p) =  2.476e-06  
Iteration 9:   f(p) =  2.374e-06  
Iteration 10:  f(p) =  2.354e-06  
Iteration 11:  f(p) =  2.213e-06  
Iteration 12:  f(p) =  2.102e-06  
Iteration 13:  f(p) =  2.028e-06  
Iteration 14:  f(p) =  1.902e-06  
Iteration 15:  f(p) =  1.884e-06  
Iteration 16:  f(p) =  1.519e-06  
Iteration 17:  f(p) =  1.502e-06  
Iteration 18:  f(p) =  1.397e-06  
Iteration 19:  f(p) =  1.361e-06  
Iteration 20:  f(p) =  1.041e-06  
Iteration 21:  f(p) =  9.902e-07  
Iteration 22:  f(p) =  8.632e-07  
Iteration 23:  f(p) =  8.232e-07  
Iteration 24:  f(p) =  7.228e-07  
Iteration 25:  f(p) =  7.213e-07  
Iteration 26:  f(p) =  6.887e-07  
Iteration 27:  f(p) =  6.302e-07  
Iteration 28:  f(p) =  4.795e-07  
Iteration 29:  f(p) =  4.765e-07  
Iteration 30:  f(p) =  4.431e-07  
Iteration 31:  f(p) =  3.431e-07  
Iteration 32:  f(p) =  3.425e-07  
Iteration 33:  f(p) =  3.233e-07  
Iteration 34:  f(p) =  2.953e-07  
Iteration 35:  f(p) =  2.884e-07  
Iteration 36:  f(p) =  2.036e-07  
Iteration 37:  f(p) =  2.026e-07  
Iteration 38:  f(p) =  1.842e-07  
Iteration 39:  f(p) =  1.353e-07  
Iteration 40:  f(p) =  1.278e-07  
Iteration 41:  f(p) =  1.226e-07  
Iteration 42:  f(p) =  1.138e-07  
Iteration 43:  f(p) =  1.016e-07  
Iteration 44:  f(p) =  9.358e-08  
Iteration 45:  f(p) =  8.986e-08  
Iteration 46:  f(p) =  8.126e-08  
Iteration 47:  f(p) =  7.879e-08  
Iteration 48:  f(p) =  7.007e-08  
Iteration 49:  f(p) =  6.393e-08  
Iteration 50:  f(p) =  4.172e-08  
Iteration 51:  f(p) =  4.158e-08  
Iteration 52:  f(p) =  3.847e-08  
Iteration 53:  f(p) =  3.742e-08  
Iteration 54:  f(p) =  3.288e-08  
Iteration 55:  f(p) =  3.104e-08  
Iteration 56:  f(p) =  2.913e-08  
Iteration 57:  f(p) =  2.860e-08  
Iteration 58:  f(p) =  2.324e-08  
Iteration 59:  f(p) =  2.227e-08  
Iteration 60:  f(p) =  2.188e-08  
Iteration 61:  f(p) =  2.113e-08  
Iteration 62:  f(p) =  2.093e-08  
Iteration 63:  f(p) =  2.060e-08  
Iteration 64:  f(p) =  2.022e-08  
Iteration 65:  f(p) =  2.016e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 66:  f(p) =  2.007e-08  
Iteration 67:  f(p) =  2.006e-08  (backed up)
Iteration 68:  f(p) =  2.006e-08  
Iteration 69:  f(p) =  2.001e-08  
Iteration 70:  f(p) =  1.995e-08  
Iteration 71:  f(p) =  1.986e-08  
Iteration 72:  f(p) =  1.984e-08  
Iteration 73:  f(p) =  1.981e-08  
Iteration 74:  f(p) =  1.978e-08  
Iteration 75:  f(p) =  1.977e-08  
Iteration 76:  f(p) =  1.975e-08  
Iteration 77:  f(p) =  1.974e-08  
Iteration 78:  f(p) =  1.973e-08  
Iteration 79:  f(p) =  1.973e-08  
Iteration 80:  f(p) =  1.973e-08  
Iteration 81:  f(p) =  1.973e-08  
Iteration 82:  f(p) =  1.973e-08  
Iteration 83:  f(p) =  1.972e-08  
Iteration 84:  f(p) =  1.971e-08  
Iteration 85:  f(p) =  1.924e-08  
Iteration 86:  f(p) =  1.921e-08  
Iteration 87:  f(p) =  1.904e-08  
Iteration 88:  f(p) =  1.901e-08  
Iteration 89:  f(p) =  1.895e-08  
Iteration 90:  f(p) =  1.890e-08  
Iteration 91:  f(p) =  1.887e-08  
Iteration 92:  f(p) =  1.882e-08  
Iteration 93:  f(p) =  1.880e-08  
Iteration 94:  f(p) =  1.865e-08  
Iteration 95:  f(p) =  1.843e-08  
Iteration 96:  f(p) =  1.843e-08  
Iteration 97:  f(p) =  1.831e-08  
Iteration 98:  f(p) =  1.828e-08  
Iteration 99:  f(p) =  1.809e-08  
Iteration 100: f(p) =  1.805e-08  
Iteration 101: f(p) =  1.803e-08  
Iteration 102: f(p) =  1.797e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 103: f(p) =  1.785e-08  
Iteration 104: f(p) =  1.784e-08  (backed up)
Iteration 105: f(p) =  1.784e-08  
Iteration 106: f(p) =  1.784e-08  
Iteration 107: f(p) =  1.782e-08  
Iteration 108: f(p) =  1.776e-08  
Iteration 109: f(p) =  1.774e-08  
Iteration 110: f(p) =  1.773e-08  
Iteration 111: f(p) =  1.772e-08  
Iteration 112: f(p) =  1.770e-08  
Iteration 113: f(p) =  1.770e-08  
Iteration 114: f(p) =  1.769e-08  
Iteration 115: f(p) =  1.769e-08  
Iteration 116: f(p) =  1.769e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 117: f(p) =  1.768e-08  
Iteration 118: f(p) =  1.768e-08  (backed up)
Iteration 119: f(p) =  1.768e-08  
BFGS stepping has contracted, resetting BFGS Hessian
Iteration 120: f(p) =  1.760e-08  
convergence not achieved

Propensity score model coefficients                Number of obs  =        500
Propensity score reweigting
Loss = CBPS (just identified) + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.134215
        1.x2 |  -1.632014
        1.x3 |  -.5827758
          x4 |  -.3919562
          x5 |   .0654783
          x6 |  -.3055397
          x7 |   .0283967
         x90 |    .105467
         x91 |  -.1455519
         x92 |   .1178955
         x93 |    .039984
         x94 |  -.0813347
         x95 |   .0736438
       _cons |   1.287491
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408         1      1.04     .0434      .102      .207      .345      .673      1.24      2.17      4.57        10
         |       408         1      1.04     .0434      .102      .207      .345      .673      1.24      2.17      4.57        10
         |       408      .158      .115    .00934     .0217     .0431     .0697      .128      .213      .321      .498      .685
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .261      .141     .0391     .0391      .108      .136      .235      .354      .415      .743      .743
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500         1      .942     .0434      .103      .216      .423      .891      1.06      1.92      4.55        10
         |       500         1      .942     .0434      .103      .216      .423      .891      1.06      1.92      4.55        10
         |       500      .177      .127    .00934     .0218     .0442     .0806      .143      .235      .361      .577      .743
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .5121128  -.0447215  -.0891454   .5016695   1.004811
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0095006   .0013689   .0131304   .1042572   1.152232
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0237311  -.0019919  -.0135849   .1466296   .9257434
             |
          x4 |  .4347826   .3980795   .0367031   .0736352   .4984448   1.034331
          x5 |  25.46739   26.10615   -.638756  -.1173338   5.443922    .584679
          x6 |  11.86957   11.72601   .1435594    .089442   1.605057    .567446
          x7 |  6.858696   6.814149   .0445462   .0125246   3.556704   1.154833
         x90 |  .0972024   .0021754   .0950271   .0996315   .9537854   .8518637
         x91 | -.0890157  -.0684884  -.0205273  -.0217691   .9429542   .9545204
         x92 |  .0453787   .0253178   .0200609   .0190842   1.051175   1.166996
         x93 |  .0865687   .0826692   .0038994   .0041706   .9349714   .9428092
         x94 | -.1299173  -.0962963   -.033621  -.0363545   .9248091   .7429981
         x95 | -.0807251  -.0355482  -.0451769  -.0494274    .914005    .913678
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00123
  Mean absolute standardized diff.    = 0.04917
  Maximum absolute standardized diff. = 0.11733
  C.V. of matching weights:           = 1.04289
  S.D. of matching weights:           = 1.04289
  Skewness of matching weights:       = 0.15257
  Kurtosis of matching weights:       = 0.04637
  Maximum matching weight:            = 10.00001
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3423.929     3431.264  -7.334464  -.0459414   3431.264
   y1_binary |    .9462981     .9469457  -.0006476  -.0118064   .9469457
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. }
. 
. // * WEIGHTED DATA EXAMPLES *
. 
. // Replicate CBPS
. psweight cbps `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate pooledvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00008909  
Iteration 1:   f(p) =  .00006006  
Iteration 2:   f(p) =  .00005798  
Iteration 3:   f(p) =  .00005798  
Iteration 4:   f(p) =  .00005797  
Iteration 5:   f(p) =  .00005722  
Iteration 6:   f(p) =  .00004801  
Iteration 7:   f(p) =   .0000216  
Iteration 8:   f(p) =  .00001686  
Iteration 9:   f(p) =  .00001603  
Iteration 10:  f(p) =  .00001599  
Iteration 11:  f(p) =  .00001599  
Iteration 12:  f(p) =  .00001598  
Iteration 13:  f(p) =  .00001574  
Iteration 14:  f(p) =  .00001141  
Iteration 15:  f(p) =  5.239e-06  
Iteration 16:  f(p) =  4.992e-06  
Iteration 17:  f(p) =  4.991e-06  
Iteration 18:  f(p) =  4.991e-06  
Iteration 19:  f(p) =  4.946e-06  
Iteration 20:  f(p) =  4.114e-06  
Iteration 21:  f(p) =  2.086e-06  
Iteration 22:  f(p) =  1.975e-06  
Iteration 23:  f(p) =  1.975e-06  
Iteration 24:  f(p) =  1.975e-06  
Iteration 25:  f(p) =  1.973e-06  
Iteration 26:  f(p) =  1.949e-06  
Iteration 27:  f(p) =  1.615e-06  
Iteration 28:  f(p) =  9.103e-07  
Iteration 29:  f(p) =  8.671e-07  
Iteration 30:  f(p) =  8.670e-07  
Iteration 31:  f(p) =  8.668e-07  
Iteration 32:  f(p) =  8.646e-07  
Iteration 33:  f(p) =  5.560e-07  
Iteration 34:  f(p) =  3.177e-07  
Iteration 35:  f(p) =  3.129e-07  
Iteration 36:  f(p) =  3.129e-07  
Iteration 37:  f(p) =  3.127e-07  
Iteration 38:  f(p) =  2.971e-07  
Iteration 39:  f(p) =  1.197e-07  
Iteration 40:  f(p) =  6.991e-08  
Iteration 41:  f(p) =  6.958e-08  
Iteration 42:  f(p) =  6.958e-08  
Iteration 43:  f(p) =  6.954e-08  
Iteration 44:  f(p) =  6.908e-08  
Iteration 45:  f(p) =  5.559e-08  
Iteration 46:  f(p) =  8.913e-09  
Iteration 47:  f(p) =  8.087e-09  
Iteration 48:  f(p) =  8.087e-09  
Iteration 49:  f(p) =  8.086e-09  
Iteration 50:  f(p) =  8.042e-09  
Iteration 51:  f(p) =  7.406e-09  
Iteration 52:  f(p) =  3.662e-09  
Iteration 53:  f(p) =  1.074e-09  
Iteration 54:  f(p) =  9.277e-10  
Iteration 55:  f(p) =  9.270e-10  
Iteration 56:  f(p) =  9.269e-10  
Iteration 57:  f(p) =  8.885e-10  
Iteration 58:  f(p) =  3.553e-10  
Iteration 59:  f(p) =  9.288e-11  
Iteration 60:  f(p) =  8.909e-11  
Iteration 61:  f(p) =  8.908e-11  
Iteration 62:  f(p) =  8.907e-11  
Iteration 63:  f(p) =  8.892e-11  
Iteration 64:  f(p) =  8.553e-11  
Iteration 65:  f(p) =  5.704e-11  
Iteration 66:  f(p) =  6.614e-12  
Iteration 67:  f(p) =  4.150e-12  
Iteration 68:  f(p) =  4.144e-12  
Iteration 69:  f(p) =  4.139e-12  
Iteration 70:  f(p) =  3.814e-12  
Iteration 71:  f(p) =  5.171e-13  
Iteration 72:  f(p) =  7.891e-14  
Iteration 73:  f(p) =  7.793e-14  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.502415
        1.x2 |  -2.525402
        1.x3 |  -.8190827
          x4 |  -.3236381
          x5 |   .0771204
          x6 |  -.4884777
          x7 |     .07227
         x90 |   .0234172
         x91 |   .0257841
         x92 |   .2152131
         x93 |  -.0285333
         x94 |  -.3393879
         x95 |  -.0407887
       _cons |   3.075427
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .957      .762      .953      1.26      1.49       1.8      2.11       2.8      5.77        13
         |       408      .999      .435       .78      .784      .792      .809      .864      .985      1.32      2.65      6.64
         |       408       .16      .168     .0019    .00635     .0172      .037     .0987      .209      .409      .707      .883
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.63      .415      .415      .642      .808      1.35       2.6      3.88      9.17      9.17
         |        92      1.02      .828      .188      .188      .318      .405      .739      1.47      1.96      5.21      5.21
         |        92      .288      .192     .0336     .0336     .0892      .119      .237      .431       .55      .931      .931
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.11      .415      .548      1.06      1.41      1.78      2.17      2.99      6.49        13
         |       500         1      .529      .188      .273      .782      .799      .859      1.05      1.49       2.9      6.64
         |       500      .183       .18     .0019    .00715       .02     .0472      .117      .263      .446      .717      .931
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6695178   .6695184  -6.44e-07  -1.37e-06   .4706261   1.004329
             |
          x2 |
          0  |  (empty)
          1  |  .0220668   .0220668   6.83e-08   4.64e-07   .1469755   1.004331
             |
          x3 |
          0  |  (empty)
          1  |  .0366905   .0366911  -6.21e-07  -3.30e-06   .1880978   1.004312
             |
          x4 |   .485133   .4851327   2.59e-07   5.18e-07   .5000334   1.004328
          x5 |  26.17888   26.17889  -.0000147  -2.35e-06   6.237856   .6789016
          x6 |  12.63449   12.63449   1.53e-06   6.55e-07   2.338006    .574066
          x7 |   6.75523   6.755245  -.0000157  -4.65e-06   3.370937   1.187219
         x90 | -.0520319  -.0520316  -2.99e-07  -2.86e-07   1.046128   1.163665
         x91 |  .0164868   .0164855   1.36e-06   1.40e-06   .9705718   .9930967
         x92 | -.0021635  -.0021647   1.18e-06   1.16e-06   1.017927   1.359803
         x93 |  .0456889   .0456925  -3.58e-06  -3.72e-06   .9636158   .8837309
         x94 | -.0910013   -.091001  -2.80e-07  -2.76e-07   1.014117    .785929
         x95 | -.0894585   -.089459   5.39e-07   5.51e-07   .9789419   .8236875
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00000
  C.V. of matching weights:           = 0.52710
  S.D. of matching weights:           = 0.52850
  Skewness of matching weights:       = 0.20265
  Kurtosis of matching weights:       = 0.07624
  Maximum matching weight:            = 6.64235
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3445.465     3445.465   .0003474   2.24e-06   3445.465
   y1_binary |    .9569443     .9569441   1.47e-07   3.27e-06   .9569441
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight cbpsoid `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate pooledvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .02296546  
Iteration 1:   f(p) =  .01893921  
Iteration 2:   f(p) =  .01888779  
Iteration 3:   f(p) =  .01864993  
Iteration 4:   f(p) =  .01807796  
Iteration 5:   f(p) =  .01796175  
Iteration 6:   f(p) =  .01796123  
Iteration 7:   f(p) =  .01795223  
Iteration 8:   f(p) =  .01782927  
Iteration 9:   f(p) =  .01781765  
Iteration 10:  f(p) =  .01781754  
Iteration 11:  f(p) =  .01781628  
Iteration 12:  f(p) =   .0177805  
Iteration 13:  f(p) =   .0177802  
Iteration 14:  f(p) =  .01777986  
Iteration 15:  f(p) =  .01777329  
Iteration 16:  f(p) =  .01777274  
Iteration 17:  f(p) =  .01777274  
Iteration 18:  f(p) =  .01777245  
Iteration 19:  f(p) =  .01777192  
Iteration 20:  f(p) =  .01777187  
Iteration 21:  f(p) =  .01777187  
Iteration 22:  f(p) =  .01777187  
Iteration 23:  f(p) =  .01777186  
Iteration 24:  f(p) =  .01777185  
Iteration 25:  f(p) =  .01777185  
Iteration 26:  f(p) =  .01777185  
Iteration 27:  f(p) =  .01777185  
Iteration 28:  f(p) =  .01777185  
Iteration 29:  f(p) =  .01777184  
Iteration 30:  f(p) =  .01777184  
Iteration 31:  f(p) =  .01777184  
Iteration 32:  f(p) =  .01777184  
Iteration 33:  f(p) =  .01777184  
Iteration 34:  f(p) =  .01777184  
Iteration 35:  f(p) =  .01777184  
Iteration 36:  f(p) =  .01777184  
Iteration 37:  f(p) =  .01777184  
Iteration 38:  f(p) =  .01777184  
Iteration 39:  f(p) =  .01777184  
Iteration 40:  f(p) =  .01777184  
Iteration 41:  f(p) =  .01777184  
Iteration 42:  f(p) =  .01777184  
Iteration 43:  f(p) =  .01777184  
Iteration 44:  f(p) =  .01777184  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (over identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.226645
        1.x2 |  -1.653763
        1.x3 |   -.777684
          x4 |  -.3532497
          x5 |   .0574628
          x6 |  -.2583003
          x7 |   .0080438
         x90 |   .0890277
         x91 |  -.1706886
         x92 |     .17651
         x93 |   .1136715
         x94 |  -.1271349
         x95 |   .0214701
       _cons |   1.180156
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .569      .882      1.05      1.37      1.58       1.9      2.22      2.65      3.75      5.18
         |       408      .999      .194      .816      .827      .851      .879      .934      1.05      1.23      1.66      2.64
         |       408       .17      .119     .0115     .0244     .0519     .0816      .136      .228      .345      .513      .694
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.26      .471      .471       .86      1.14      1.52      2.69      3.33      7.65      7.65
         |        92      1.02      .639      .297      .297      .465      .547      .791      1.35      1.75      4.34      4.34
         |        92      .278      .144      .048      .048      .119      .154      .264      .381      .448      .702      .702
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      .744      .471       .68      1.21      1.51      1.87      2.25      2.77      4.93      7.65
         |       500         1      .324      .297      .426      .821      .864      .931      1.07      1.35      2.08      4.34
         |       500       .19      .131     .0115     .0257     .0544     .0922      .151      .268      .394      .595      .702
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6415954   .6970126  -.0554172   -.119431   .4640107   1.093567
             |
          x2 |
          0  |  (empty)
          1  |  .0142909   .0234703  -.0091794  -.0628462   .1460619    .617275
             |
          x3 |
          0  |  (empty)
          1  |   .033444   .0380925  -.0046485  -.0245375   .1894461   .8860284
             |
          x4 |  .4881572   .4821182   .0060389   .0120785    .499973    1.00505
          x5 |  25.72258   26.31855  -.5959627  -.1000423   5.957105   .7659019
          x6 |  12.33189    12.8994  -.5675068  -.2533225   2.240254   .6135512
          x7 |  6.911085   6.688832    .222253   .0657614   3.379685   1.211887
         x90 | -.0440389  -.0251308  -.0189081  -.0185768    1.01783   1.120774
         x91 |  .0661739  -.0257225   .0918964   .0936224   .9815644   .9753855
         x92 |  -.038201  -.0020298  -.0361712  -.0355959   1.016161    1.20721
         x93 |  .0014103   .0645199  -.0631095  -.0653395   .9658703   .9125526
         x94 | -.1442666  -.0285682  -.1156983  -.1166709   .9916637   .8216035
         x95 | -.1053625    -.07164  -.0337225  -.0344809   .9780038    .803947
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.05072
  Mean absolute standardized diff.    = 0.07710
  Maximum absolute standardized diff. = 0.25332
  C.V. of matching weights:           = 0.32369
  S.D. of matching weights:           = 0.32442
  Skewness of matching weights:       = 0.14997
  Kurtosis of matching weights:       = 0.05697
  Maximum matching weight:            = 4.34332
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3443.873     3455.428  -11.55448  -.0823173   3455.428
   y1_binary |    .9538356     .9614582  -.0076226  -.1871522   .9614582
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight cbps `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet pooledvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  5.280e-07  
Iteration 13:  f(p) =  3.964e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.957e-07  
Iteration 17:  f(p) =  3.916e-07  
Iteration 18:  f(p) =  3.104e-07  
Iteration 19:  f(p) =  1.005e-07  
Iteration 20:  f(p) =  7.822e-08  
Iteration 21:  f(p) =  7.812e-08  
Iteration 22:  f(p) =  7.811e-08  
Iteration 23:  f(p) =  7.804e-08  
Iteration 24:  f(p) =  7.704e-08  
Iteration 25:  f(p) =  6.598e-08  
Iteration 26:  f(p) =  1.970e-08  
Iteration 27:  f(p) =  1.289e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.287e-08  
Iteration 30:  f(p) =  1.285e-08  
Iteration 31:  f(p) =  1.253e-08  
Iteration 32:  f(p) =  7.732e-09  
Iteration 33:  f(p) =  3.004e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.965e-09  
Iteration 36:  f(p) =  2.963e-09  
Iteration 37:  f(p) =  2.943e-09  
Iteration 38:  f(p) =  2.704e-09  
Iteration 39:  f(p) =  1.395e-09  
Iteration 40:  f(p) =  6.870e-10  
Iteration 41:  f(p) =  6.666e-10  
Iteration 42:  f(p) =  6.665e-10  
Iteration 43:  f(p) =  6.665e-10  
Iteration 44:  f(p) =  6.654e-10  
Iteration 45:  f(p) =  6.453e-10  
Iteration 46:  f(p) =  2.604e-10  
Iteration 47:  f(p) =  2.181e-10  
Iteration 48:  f(p) =  2.181e-10  
Iteration 49:  f(p) =  2.181e-10  
Iteration 50:  f(p) =  1.511e-10  
Iteration 51:  f(p) =  5.741e-11  
Iteration 52:  f(p) =  5.109e-11  
Iteration 53:  f(p) =  5.109e-11  
Iteration 54:  f(p) =  5.109e-11  
Iteration 55:  f(p) =  4.908e-11  
Iteration 56:  f(p) =  6.255e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.130e-12  
Iteration 60:  f(p) =  3.275e-13  
Iteration 61:  f(p) =  1.520e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |   .6265999
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.56e-06   .4978682    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.78e-06    .106233   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.01e-06   .1533227   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.46e-06   .4941119   1.004329
          x5 |  25.44699   25.44697   .0000137   2.05e-06    6.66557   .6144636
          x6 |  11.84757   11.84755   .0000196   9.58e-06   2.042371   .5982538
          x7 |  7.015422    7.01543  -8.55e-06  -2.55e-06   3.345322   1.161762
         x90 |  .0839738   .0839754  -1.58e-06  -1.54e-06     1.0258   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.30e-06   .9411048   .9922921
         x92 |  .0575388   .0575408  -2.04e-06  -2.06e-06   .9892728   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.16e-06   .9410808   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.28e-06    1.02686   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.46e-06   .9627681   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00001
  C.V. of matching weights:           = 1.03194
  S.D. of matching weights:           = 1.02713
  Skewness of matching weights:       = 0.11350
  Kurtosis of matching weights:       = 0.02292
  Maximum matching weight:            = 7.00792
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.367     3431.366   .0005901   3.44e-06   3431.366
   y1_binary |    .9509094     .9509091   2.71e-07   5.40e-06   .9509091
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight cbpsoid `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet pooledvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00053487  
Iteration 1:   f(p) =  .00021848  
Iteration 2:   f(p) =  .00021162  
Iteration 3:   f(p) =  .00021159  
Iteration 4:   f(p) =  .00021001  
Iteration 5:   f(p) =  .00019724  
Iteration 6:   f(p) =   .0001771  
Iteration 7:   f(p) =  .00017502  
Iteration 8:   f(p) =  .00017501  
Iteration 9:   f(p) =  .00017499  
Iteration 10:  f(p) =  .00017465  
Iteration 11:  f(p) =  .00017249  
Iteration 12:  f(p) =  .00017245  
Iteration 13:  f(p) =  .00017241  
Iteration 14:  f(p) =  .00017225  
Iteration 15:  f(p) =  .00017218  
Iteration 16:  f(p) =  .00017218  
Iteration 17:  f(p) =  .00017218  
Iteration 18:  f(p) =  .00017218  
Iteration 19:  f(p) =  .00017218  
Iteration 20:  f(p) =  .00017216  
Iteration 21:  f(p) =  .00017216  
Iteration 22:  f(p) =  .00017216  
Iteration 23:  f(p) =  .00017216  
Iteration 24:  f(p) =  .00017216  
Iteration 25:  f(p) =  .00017215  
Iteration 26:  f(p) =  .00017215  
Iteration 27:  f(p) =  .00017215  
Iteration 28:  f(p) =  .00017215  
Iteration 29:  f(p) =  .00017215  
Iteration 30:  f(p) =  .00017215  
Iteration 31:  f(p) =  .00017215  
Iteration 32:  f(p) =  .00017215  
Iteration 33:  f(p) =  .00017215  
Iteration 34:  f(p) =  .00017215  
Iteration 35:  f(p) =  .00017215  
Iteration 36:  f(p) =  .00017215  
Iteration 37:  f(p) =  .00017215  
Iteration 38:  f(p) =  .00017215  
Iteration 39:  f(p) =  .00017215  
Iteration 40:  f(p) =  .00017215  
Iteration 41:  f(p) =  .00017215  
Iteration 42:  f(p) =  .00017215  
Iteration 43:  f(p) =  .00017215  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (over identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.393749
        1.x2 |  -1.561035
        1.x3 |  -.4600074
          x4 |  -.3846166
          x5 |   .0606091
          x6 |  -.2482014
          x7 |   .0443351
         x90 |   .1306487
         x91 |  -.1205476
         x92 |   .1453091
         x93 |   .0704761
         x94 |  -.1075638
         x95 |  -.0307915
       _cons |   .7598464
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.12     .0834      .213      .379      .703       1.2      2.44       4.6      9.79      16.6
         |       408      .995      1.01     .0445      .124      .212      .364      .618      1.22      2.32      4.57      7.11
         |       408      .161      .119    .00985     .0269     .0454     .0753      .121      .214      .341      .506      .614
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .153     .0459     .0459     .0999      .133      .243      .375      .464      .695      .695
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.92     .0834      .215      .425      .799      1.47      2.33       4.1       9.5      16.6
         |       500      .996      .916     .0445      .124      .228      .404       .82      1.04      2.07      4.54      7.11
         |       500      .181      .133    .00985     .0269     .0484     .0819      .137      .247       .39      .596      .695
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4553292   -.004106   -.008242    .498186   1.002774
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0111963   .0002076   .0019684   .1054489   1.022732
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0242797   -.000216   -.001404   .1538722    .995612
             |
          x4 |  .4218861   .4235251   -.001639  -.0033157    .494322   1.003286
          x5 |  25.44699   25.39436   .0526232   .0078929   6.667188   .6141311
          x6 |  11.84757   11.82507   .0224993   .0110128   2.043017   .5978372
          x7 |  7.015422   6.978163   .0372587   .0111276   3.348319   1.159171
         x90 |  .0839738   .0816058   .0023681   .0023047   1.027479   .8472278
         x91 | -.0648837  -.0554767   -.009407  -.0099829   .9423132   .9892043
         x92 |  .0575388   .0526515   .0048873   .0049457   .9881782   1.121369
         x93 |  .1016523   .0977101   .0039423    .004191   .9406607   1.013686
         x94 | -.1252265   -.131327   .0061005   .0059387    1.02725   .7569926
         x95 | -.1044649  -.1015495  -.0029155   -.003029   .9625008   .8652191
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00180
  Mean absolute standardized diff.    = 0.00580
  Maximum absolute standardized diff. = 0.01113
  C.V. of matching weights:           = 1.01903
  S.D. of matching weights:           = 1.01413
  Skewness of matching weights:       = 0.11289
  Kurtosis of matching weights:       = 0.02307
  Maximum matching weight:            = 7.10959
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.338     3430.734   .6043149   .0035138   3430.734
   y1_binary |    .9509085     .9508973   .0000113   .0002232   .9508973
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. // Other objective functions
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00026309  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00001126  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  4.733e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  1.761e-13  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  1.988e-21  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = mean(stddiff())^2
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298301
        1.x2 |   -1.62991
        1.x3 |  -.4511738
          x4 |  -.3553036
          x5 |     .07158
          x6 |  -.2773324
          x7 |   .0371349
         x90 |   .1283826
         x91 |  -.0952385
         x92 |   .1409152
         x93 |   .0743039
         x94 |  -.1419192
         x95 |    -.02015
       _cons |   1.248956
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.18     .0766      .195      .376      .696      1.22      2.44      4.57      9.98      20.7
         |       408      .998      1.06     .0408      .117      .208       .36       .63      1.18      2.31      4.35      10.6
         |       408       .22      .145     .0139     .0389     .0671      .111      .179      .289      .444      .601      .786
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .351      .168      .068      .068      .152      .203      .322      .485      .552       .79       .79
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.98     .0766      .203      .418      .776       1.5      2.35      4.17      9.35      20.7
         |       500      .998      .961     .0408      .117      .226      .402      .852      1.07      1.96      4.35      10.6
         |       500      .244      .158     .0139      .039     .0719      .119      .203      .332      .494      .685       .79
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231    .487981  -.0367579  -.0736628   .4990018   .9953452
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101189   .0012849   .0120681   .1064741   1.130392
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243904  -.0003267   -.002126   .1536741    .991207
             |
          x4 |  .4218861   .4077073   .0141788   .0286304   .4952368   1.014377
          x5 |  25.44699   25.93854  -.4915548  -.0906572   5.422129   .5820455
          x6 |  11.84757   11.77832   .0692519   .0421771   1.641931   .5870658
          x7 |  7.015422   6.877177   .1382443   .0388826   3.555432   1.150412
         x90 |  .0839738   .0558962   .0280776   .0292562   .9597153   .8505932
         x91 | -.0648837  -.0314162  -.0334675  -.0356565     .93861   .9896463
         x92 |  .0575388   .0508005   .0067383    .006507    1.03554   1.132825
         x93 |  .1016523   .1109109  -.0092586  -.0097833   .9463749   1.021042
         x94 | -.1252265  -.1752569   .0500305   .0546928   .9147554   .7291541
         x95 | -.1044649   -.104167  -.0002979  -.0003285   .9069849   .8690485
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.03265
  Maximum absolute standardized diff. = 0.09066
  C.V. of matching weights:           = 1.06702
  S.D. of matching weights:           = 1.06436
  Skewness of matching weights:       = 0.15839
  Kurtosis of matching weights:       = 0.05090
  Maximum matching weight:            = 10.57744
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.445     3432.164  -.7196184  -.0044215   3432.164
   y1_binary |    .9507734     .9518109  -.0010374  -.0207557   .9518109
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight sd_sq `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .01944489  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01784035  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01032757  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00864463  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00309574  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00232235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00091852  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00071553  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00032888  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00013226  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00006152  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00004718  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002689  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000235  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002163  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.507e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  4.926e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  4.495e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  3.113e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  9.709e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.289e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  2.156e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  2.156e-07  (backed up)

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = sum(stddiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.446641
        1.x2 |   -1.54241
        1.x3 |  -.4738989
          x4 |  -.3823256
          x5 |   .0635735
          x6 |  -.2432678
          x7 |   .0476865
         x90 |   .1334605
         x91 |  -.1336202
         x92 |   .1523287
         x93 |    .075763
         x94 |  -.1016271
         x95 |  -.0382575
       _cons |   1.349238
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0811      .208      .375      .695      1.17      2.44      4.62      9.71      16.8
         |       408      .995      1.03     .0432      .118      .207       .36       .61      1.22       2.3      4.74      7.01
         |       408      .265      .163     .0196     .0516     .0872      .143       .22      .361      .515      .687      .764
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .413      .187     .0911     .0911      .181      .231      .398      .557      .655      .822      .822
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0811      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928     .0432      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .293      .177     .0196     .0523      .095      .155      .242      .404      .571      .753      .822
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512687  -.0000456  -.0000913   .4990018    1.00431
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114402  -.0000363  -.0003409   .1064741   1.001178
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240204   .0000433   .0002818   .1536741   1.006094
             |
          x4 |  .4218861   .4218656   .0000205   .0000414   .4952368   1.004341
          x5 |  25.44699   25.44719  -.0002052  -.0000378   5.422129   .6144531
          x6 |  11.84757    11.8475   .0000671   .0000409   1.641931   .5982325
          x7 |  7.015422   7.015211   .0002106   .0000592   3.555432   1.161757
         x90 |  .0839738   .0839323   .0000415   .0000433   .9597153   .8505088
         x91 | -.0648837  -.0648817  -2.04e-06  -2.18e-06     .93861   .9922887
         x92 |  .0575388   .0575515  -.0000127  -.0000123    1.03554   1.118322
         x93 |  .1016523   .1016534  -1.06e-06  -1.12e-06   .9463749   1.012562
         x94 | -.1252265   -.125259   .0000325   .0000355   .9147554   .7576437
         x95 | -.1044649  -.1044612  -3.73e-06  -4.11e-06   .9069849   .8646937
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00000
  Mean absolute standardized diff.    = 0.00008
  Maximum absolute standardized diff. = 0.00034
  C.V. of matching weights:           = 1.03183
  S.D. of matching weights:           = 1.02701
  Skewness of matching weights:       = 0.11352
  Kurtosis of matching weights:       = 0.02293
  Maximum matching weight:            = 7.01036
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.367     3431.377  -.0099881  -.0000627   3431.377
   y1_binary |    .9509094     .9509116  -2.24e-06  -.0000459   .9509116
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight stdprogdiff `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00143639  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =   .0006706  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00064802  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =   .0000134  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.080e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  8.192e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  8.192e-11  (backed up)

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = sum(stdprogdiff()^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.298747
        1.x2 |  -1.629983
        1.x3 |  -.4515068
          x4 |  -.3572145
          x5 |    .070186
          x6 |  -.2800569
          x7 |   .0431043
         x90 |   .1194513
         x91 |  -.0953766
         x92 |   .1379606
         x93 |   .0698371
         x94 |  -.1463551
         x95 |  -.0181707
       _cons |   1.248913
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.19     .0755      .197      .369      .672       1.2      2.38       4.5        10      20.3
         |       408      .997      1.07     .0402      .116      .205      .356      .639      1.19      2.32       4.4      10.4
         |       408      .215      .144     .0134     .0375     .0645      .107      .177      .285      .438      .597      .777
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .345      .168     .0683     .0683      .147      .194      .315      .476      .549      .795      .795
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.99     .0755      .204      .406      .766       1.5      2.34       4.1       9.5      20.3
         |       500      .998      .963     .0402      .116      .223      .396      .841      1.07      1.98      4.39      10.4
         |       500      .239      .157     .0134     .0375     .0695      .116      .196      .324      .483      .682      .795
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4841323  -.0329091  -.0659499   .4990018   .9957729
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0101285   .0012754   .0119781   .1064741   1.129334
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0243611  -.0002974  -.0019351   .1536741   .9923704
             |
          x4 |  .4218861   .4098936   .0119925   .0242157   .4952368   1.012704
          x5 |  25.44699   25.87222  -.4252323  -.0784253   5.422129   .5828012
          x6 |  11.84757   11.76326    .084312   .0513493   1.641931    .590244
          x7 |  7.015422    6.94126   .0741616   .0208587   3.555432   1.153547
         x90 |  .0839738   .0479638   .0360101   .0375216   .9597153   .8485565
         x91 | -.0648837  -.0313864  -.0334973  -.0356882     .93861   .9913577
         x92 |  .0575388   .0445532   .0129856   .0125399    1.03554   1.135083
         x93 |  .1016523   .1048831  -.0032308  -.0034139   .9463749   1.017142
         x94 | -.1252265  -.1776529   .0524265    .057312   .9147554   .7316701
         x95 | -.1044649  -.0999108  -.0045541  -.0050212   .9069849   .8678581
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00195
  Mean absolute standardized diff.    = 0.03125
  Maximum absolute standardized diff. = 0.07843
  C.V. of matching weights:           = 1.06966
  S.D. of matching weights:           = 1.06661
  Skewness of matching weights:       = 0.15342
  Kurtosis of matching weights:       = 0.04736
  Maximum matching weight:            = 10.35645
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.435     3431.436  -.0011653  -7.13e-06   3431.436
   y1_binary |    .9507806     .9507803   2.82e-07   5.58e-06   .9507803
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. // IPW
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  1.443e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Treated vs Untreated)  |  -373.2561   49.21885    -7.58   0.000    -469.7233   -276.7889
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3424.879   30.82585   111.10   0.000     3364.462    3485.297
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------
. di _b[POmean:0.treat]
3424.8791
. tebalance summarize

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw    Weighted           Raw   Weighted
  ----------------+------------------------------------------------
               x1 |  -.6027752    .0041102      1.338962   1.000571
                  |
               x2 |
               1  |  -.1180374    .0011686      .4133173   1.011157
                  |
               x3 |
               1  |  -.1253201   -.0169419      .5085817   .8975379
                  |
               x4 |  -.1207472    .0136004      .9914484   1.003798
               x5 |  -.1944638     .003179      .8589874   .5855492
               x6 |  -.6542694    .0947099      .4958356   .5643304
               x7 |   .0473848    .0177567      1.160037   1.134687
              x90 |   .1499304    .0348222      .9289414    .817157
              x91 |  -.0833726   -.0675073      .8791918     .96061
              x92 |   .0662245   -.0005441      1.090179   1.148892
              x93 |   .0479737    -.020065      .8926169   .9606022
              x94 |  -.1521926    .0315996      .8686432   .7548902
              x95 |  -.0155155    .0398234      .8285405   .8815991
  -----------------------------------------------------------------
. tebalance summarize, baseline

  Covariate balance summary
                                                   Raw     Weighted
                          -----------------------------------------
                          Number of obs =          500        500.0
                          Treated obs   =           92        249.5
                          Control obs   =          408        250.5
                          -----------------------------------------

  -----------------------------------------------------------------
                  |           Means                  Variances     
                  |    Control     Treated       Control    Treated
  ----------------+------------------------------------------------
               x1 |        .75    .4673913      .1879607   .2516722
                  |
               x2 |
               1  |   .0269608    .0108696      .0262984   .0108696
                  |
               x3 |
               1  |   .0441176    .0217391      .0422749   .0215002
                  |
               x4 |    .495098    .4347826      .2505902   .2484472
               x5 |   26.56863    25.46739      34.50142   29.63629
               x6 |   13.15931    11.86957      5.195687   2.576206
               x7 |   6.696078    6.858696      10.90495   12.65014
              x90 |   -.048508    .0972024      .9792937   .9097065
              x91 |  -.0077434   -.0890157      1.011341   .8891627
              x92 |  -.0227801    .0453787      1.013567    1.10497
              x93 |   .0403853    .0865687      .9793358   .8741716
              x94 |   .0160559   -.1299173      .9846065   .8552718
              x95 |  -.0658282   -.0807251      1.008285   .8354051
  -----------------------------------------------------------------
. 
. psweight ipw `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125404   .4990018   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0088535   .1064741   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007058   .1536741   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192434   .4952368   .9986039
          x5 |  25.44699   25.25275   .1942356   .0358228   5.422129   .5945665
          x6 |  11.84757   11.67955   .1680205   .1023311   1.641931   .5984287
          x7 |  7.015422   6.824197   .1912245   .0537838   3.555432   1.151353
         x90 |  .0839738   .0777469   .0062269   .0064883   .9597153   .8303562
         x91 | -.0648837   -.033852  -.0310317  -.0330613     .93861    .990382
         x92 |  .0575388   .0480591   .0094797   .0091543    1.03554   1.130693
         x93 |  .1016523   .1032412  -.0015889  -.0016789   .9463749   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0539402   .9147554   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0077149   .9069849   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.01622
  Mean absolute standardized diff.    = 0.02656
  Maximum absolute standardized diff. = 0.10233
  C.V. of matching weights:           = 1.06192
  S.D. of matching weights:           = 1.05655
  Skewness of matching weights:       = 0.13011
  Kurtosis of matching weights:       = 0.03293
  Maximum matching weight:            = 9.03681
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |     3430.94     3424.879   6.060627    .037449   3424.879
   y1_binary |    .9509319     .9506406   .0002913   .0058276   .9506406
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. psweight call reweight()
. psweight call balanceresults()
  Unmatched data
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4673913   .4653368   .0020545   .0040954   .5016695   1.009059
             |
          x2 |
          0  |  (empty)
          1  |  .0108696   .0107485   .0001211   .0011614   .1042572   1.019734
             |
          x3 |
          0  |  (empty)
          1  |  .0217391   .0242844  -.0025453  -.0173586   .1466296   .9051513
             |
          x4 |  .4347826   .4280333   .0067493   .0135406   .4984448   1.012313
          x5 |  25.46739   25.44732   .0200675   .0036862   5.443922   .5905162
          x6 |  11.86957   11.69122   .1783475   .1111161   1.605057   .5691173
          x7 |  6.858696   6.797654   .0610413   .0171623   3.556704   1.144312
         x90 |  .0972024   .0623017   .0349007   .0365918   .9537854   .8240885
         x91 | -.0890157  -.0249321  -.0640836  -.0679605   .9429542   .9687584
         x92 |  .0453787   .0459298  -.0005512  -.0005243   1.051175   1.158638
         x93 |  .0865687   .1054548  -.0188862  -.0201997   .9349714   .9687505
         x94 | -.1299173  -.1613151   .0313979   .0339506   .9248091   .7612936
         x95 | -.0807251  -.1181964   .0374713   .0409968    .914005   .8890772
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.01202
  Mean absolute standardized diff.    = 0.02833
  Maximum absolute standardized diff. = 0.11112
  Weights equal 1
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3424.629     3419.183   5.446199   .0347586   3419.183
   y1_binary |    .9470976      .946147   .0009506   .0176756    .946147
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight ipw `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet averagevariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.21     .0806      .194      .362      .647      1.17      2.44      4.63      9.22      17.7
         |       408      .995      1.06      .043      .116      .204      .339      .619      1.19      2.41      4.48      9.04
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97         2     .0806      .198      .398      .743      1.45      2.36      4.15       9.1      17.7
         |       500      .996      .954      .043      .116      .216      .395       .81      1.01      2.09      4.37      9.04
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff     sd_avg  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4574808  -.0062577  -.0125467   .4987508   1.002016
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0104612   .0009427   .0090496   .1041667   1.093786
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0241722  -.0001085  -.0007058   .1536767   .9999323
             |
          x4 |  .4218861   .4314162  -.0095301  -.0192367   .4954098   .9986039
          x5 |  25.44699   25.25275   .1942356   .0309352   6.278789   .5945665
          x6 |  11.84757   11.67955   .1680205   .0885487   1.897493   .5984287
          x7 |  7.015422   6.824197   .1912245   .0556435     3.4366   1.151353
         x90 |  .0839738   .0777469   .0062269   .0061803   1.007542   .8303562
         x91 | -.0648837   -.033852  -.0310317  -.0329813    .940886    .990382
         x92 |  .0575388   .0480591   .0094797   .0094309   1.005171   1.130693
         x93 |  .1016523   .1032412  -.0015889  -.0016918   .9391571   1.031343
         x94 | -.1252265  -.1745685   .0493421   .0498225   .9903584   .7439065
         x95 | -.1044649  -.1114622   .0069973   .0074459   .9397461   .8717687
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.01461
  Mean absolute standardized diff.    = 0.02494
  Maximum absolute standardized diff. = 0.08855
  C.V. of matching weights:           = 1.06192
  S.D. of matching weights:           = 1.05655
  Skewness of matching weights:       = 0.13011
  Kurtosis of matching weights:       = 0.03293
  Maximum matching weight:            = 9.03681
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |     3430.94     3424.879   6.060627   .0355366   3424.879
   y1_binary |    .9509319     .9506406   .0002913   .0056545   .9506406
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], ate aequations

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  2.429e-25  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATE                     |
                  treat |
(Treated vs Untreated)  |  -332.1348   56.53175    -5.88   0.000     -442.935   -221.3346
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
             Untreated  |   3453.029    20.1341   171.50   0.000     3413.567    3492.491
------------------------+----------------------------------------------------------------
TME1                    |
                     x1 |  -1.299227   .2371935    -5.48   0.000    -1.764118   -.8343367
                        |
                     x2 |
                     1  |  -1.630014    .746001    -2.19   0.029    -3.092149   -.1678787
                        |
                     x3 |
                     1  |  -.4513753   .5770312    -0.78   0.434    -1.582336    .6795851
                     x4 |  -.3551911    .204881    -1.73   0.083    -.7567506    .0463684
                     x5 |    .058452   .0195046     3.00   0.003     .0202237    .0966803
                     x6 |  -.2821622    .049775    -5.67   0.000    -.3797195    -.184605
                     x7 |   .0332008   .0279849     1.19   0.235    -.0216486    .0880501
                    x90 |   .1276778   .0907109     1.41   0.159    -.0501124     .305468
                    x91 |  -.0961159   .0916737    -1.05   0.294     -.275793    .0835612
                    x92 |   .1400043   .0976573     1.43   0.152    -.0514004    .3314091
                    x93 |   .0734557   .0916967     0.80   0.423    -.1062665     .253178
                    x94 |  -.1435742   .0862727    -1.66   0.096    -.3126656    .0255172
                    x95 |  -.0212452   .0898768    -0.24   0.813    -.1974006    .1549102
                  _cons |    1.24872   .6712769     1.86   0.063    -.0669587    2.564399
-----------------------------------------------------------------------------------------
. psweight ipw `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ate treatvariance

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .572      .862      1.06      1.36      1.59       1.9      2.23      2.72      3.72      5.29
         |       408      .999      .196      .823      .836      .852      .877      .929      1.03      1.26      1.65      2.49
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.31      .475      .475      .807      1.08      1.51      2.47      3.54      8.32      8.32
         |        92      1.02      .684      .274      .274      .443      .535      .795       1.4      1.78      4.73      4.73
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .76      .475      .645      1.19      1.51      1.87      2.26      2.83      4.93      8.32
         |       500         1      .341      .274      .398      .832      .866      .925      1.06      1.39      2.29      4.73
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .6613089   .6933653  -.0320564  -.0675465   .4745835   1.058036
             |
          x2 |
          0  |  (empty)
          1  |  .0128589   .0239773  -.0111184  -.0984106   .1129797   .5447519
             |
          x3 |
          0  |  (empty)
          1  |  .0265737   .0393435  -.0127698   -.079177    .161282   .6873677
             |
          x4 |  .4958234   .4853442   .0104792   .0209008   .5013759   1.005121
          x5 |  25.79221   26.26742  -.4752185  -.0902562   5.265216   .7434191
          x6 |  12.37135   12.88246  -.5111083  -.2828652   1.806897   .6063944
          x7 |  6.760858   6.737452    .023406   .0064602   3.623093   1.194134
         x90 | -.1082151   -.017539  -.0906761  -.0848916   1.068141   1.121318
         x91 |   .033412  -.0122333   .0456452   .0475293   .9603591   .9566022
         x92 |  .0165767  -.0117433     .02832   .0258227   1.096708   1.209921
         x93 |  .0109477   .0569505  -.0460028  -.0491777   .9354401   .9220023
         x94 | -.1467208  -.0286143  -.1181065  -.1303608   .9059973   .8106047
         x95 | -.0857581  -.0773517  -.0084064  -.0094126   .8931054   .7990227
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.06088
  Mean absolute standardized diff.    = 0.07637
  Maximum absolute standardized diff. = 0.28287
  C.V. of matching weights:           = 0.34039
  S.D. of matching weights:           = 0.34145
  Skewness of matching weights:       = 0.16246
  Kurtosis of matching weights:       = 0.06628
  Maximum matching weight:            = 4.72518
. 
. teffects ipw (`:word 1 of `depvars'') (`treatvar' `varlist') if `tousevar' [iw=`wgtvar'], atet aequations tlevel(0) control(1)

Iteration 0:   EE criterion =  3.987e-18  
Iteration 1:   EE criterion =  9.605e-26  

Treatment-effects estimation                    Number of obs     =        500
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
-----------------------------------------------------------------------------------------
                        |               Robust
                     y1 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
ATET                    |
                  treat |
(Untreated vs Treated)  |   321.4309   62.35166     5.16   0.000     199.2239    443.6379
------------------------+----------------------------------------------------------------
POmean                  |
                  treat |
               Treated  |   3138.003   59.50596    52.73   0.000     3021.374    3254.633
------------------------+----------------------------------------------------------------
TME0                    |
                     x1 |   1.299227   .2371935     5.48   0.000     .8343367    1.764118
                        |
                     x2 |
                     1  |   1.630014    .746001     2.19   0.029     .1678787    3.092149
                        |
                     x3 |
                     1  |   .4513753   .5770312     0.78   0.434    -.6795851    1.582336
                     x4 |   .3551911    .204881     1.73   0.083    -.0463684    .7567506
                     x5 |   -.058452   .0195046    -3.00   0.003    -.0966803   -.0202237
                     x6 |   .2821622    .049775     5.67   0.000      .184605    .3797195
                     x7 |  -.0332008   .0279849    -1.19   0.235    -.0880501    .0216486
                    x90 |  -.1276778   .0907109    -1.41   0.159     -.305468    .0501124
                    x91 |   .0961159   .0916737     1.05   0.294    -.0835612     .275793
                    x92 |  -.1400043   .0976573    -1.43   0.152    -.3314091    .0514004
                    x93 |  -.0734557   .0916967    -0.80   0.423     -.253178    .1062665
                    x94 |   .1435742   .0862727     1.66   0.096    -.0255172    .3126656
                    x95 |   .0212452   .0898768     0.24   0.813    -.1549102    .1974006
                  _cons |   -1.24872   .6712769    -1.86   0.063    -2.564399    .0669587
-----------------------------------------------------------------------------------------
. psweight ipw `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], ateu treatvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = IPW
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.299227
        1.x2 |  -1.630014
        1.x3 |  -.4513753
          x4 |  -.3551911
          x5 |    .058452
          x6 |  -.2821622
          x7 |   .0332008
         x90 |   .1276778
         x91 |  -.0961159
         x92 |   .1400043
         x93 |   .0734557
         x94 |  -.1435742
         x95 |  -.0212452
       _cons |    1.24872
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      .398      .881      1.17      1.44      1.68      1.96      2.23      2.48      2.83      3.24
         |       408         1         0         1         1         1         1         1         1         1         1         1
         |       408      .162      .122    .00968     .0257     .0443     .0716      .123      .213      .354      .505      .673
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      1.62      .218      .218      .607      .827      1.32      2.63      3.86      9.94      9.94
         |        92      1.03      .852     .0953     .0953      .305      .421      .745       1.5      1.98      5.65      5.65
         |        92      .272      .148     .0419     .0419      .111      .141      .249       .37      .448      .722      .722
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97       .78      .218      .418      1.22       1.6      1.94      2.27      2.59      4.66      9.94
         |       500         1      .364     .0953       .25      .813         1         1         1         1      2.54      5.65
         |       500      .182      .134    .00968     .0257     .0468     .0819      .141      .249      .395       .59      .722
----------------------------------------------------------------------------------------------------------------------------------
. 
. // tradeoff between CBPS-like balance and variance in weights
. psweight cbps `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet  treatvariance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00001735  
Iteration 1:   f(p) =  6.450e-06  
Iteration 2:   f(p) =  5.892e-06  
Iteration 3:   f(p) =  5.889e-06  
Iteration 4:   f(p) =  5.889e-06  
Iteration 5:   f(p) =  5.884e-06  
Iteration 6:   f(p) =  5.782e-06  
Iteration 7:   f(p) =  1.672e-06  
Iteration 8:   f(p) =  1.353e-06  
Iteration 9:   f(p) =  1.347e-06  
Iteration 10:  f(p) =  1.347e-06  
Iteration 11:  f(p) =  1.345e-06  
Iteration 12:  f(p) =  5.280e-07  
Iteration 13:  f(p) =  3.964e-07  
Iteration 14:  f(p) =  3.959e-07  
Iteration 15:  f(p) =  3.959e-07  
Iteration 16:  f(p) =  3.957e-07  
Iteration 17:  f(p) =  3.916e-07  
Iteration 18:  f(p) =  3.104e-07  
Iteration 19:  f(p) =  1.005e-07  
Iteration 20:  f(p) =  7.822e-08  
Iteration 21:  f(p) =  7.812e-08  
Iteration 22:  f(p) =  7.811e-08  
Iteration 23:  f(p) =  7.804e-08  
Iteration 24:  f(p) =  7.704e-08  
Iteration 25:  f(p) =  6.598e-08  
Iteration 26:  f(p) =  1.970e-08  
Iteration 27:  f(p) =  1.289e-08  
Iteration 28:  f(p) =  1.287e-08  
Iteration 29:  f(p) =  1.287e-08  
Iteration 30:  f(p) =  1.285e-08  
Iteration 31:  f(p) =  1.253e-08  
Iteration 32:  f(p) =  7.732e-09  
Iteration 33:  f(p) =  3.004e-09  
Iteration 34:  f(p) =  2.965e-09  
Iteration 35:  f(p) =  2.965e-09  
Iteration 36:  f(p) =  2.963e-09  
Iteration 37:  f(p) =  2.943e-09  
Iteration 38:  f(p) =  2.704e-09  
Iteration 39:  f(p) =  1.395e-09  
Iteration 40:  f(p) =  6.870e-10  
Iteration 41:  f(p) =  6.666e-10  
Iteration 42:  f(p) =  6.665e-10  
Iteration 43:  f(p) =  6.665e-10  
Iteration 44:  f(p) =  6.654e-10  
Iteration 45:  f(p) =  6.453e-10  
Iteration 46:  f(p) =  2.604e-10  
Iteration 47:  f(p) =  2.181e-10  
Iteration 48:  f(p) =  2.181e-10  
Iteration 49:  f(p) =  2.181e-10  
Iteration 50:  f(p) =  1.511e-10  
Iteration 51:  f(p) =  5.741e-11  
Iteration 52:  f(p) =  5.109e-11  
Iteration 53:  f(p) =  5.109e-11  
Iteration 54:  f(p) =  5.109e-11  
Iteration 55:  f(p) =  4.908e-11  
Iteration 56:  f(p) =  6.255e-12  
Iteration 57:  f(p) =  1.133e-12  
Iteration 58:  f(p) =  1.133e-12  
Iteration 59:  f(p) =  1.130e-12  
Iteration 60:  f(p) =  3.275e-13  
Iteration 61:  f(p) =  1.520e-13  
Iteration 62:  f(p) =  1.511e-13  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (just identified)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.447067
        1.x2 |  -1.546866
        1.x3 |  -.4711119
          x4 |  -.3822617
          x5 |   .0635834
          x6 |  -.2432316
          x7 |    .047704
         x90 |   .1335012
         x91 |  -.1336148
         x92 |   .1522979
         x93 |   .0757708
         x94 |  -.1016183
         x95 |  -.0383404
       _cons |   .6265999
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.14     .0807      .208      .375      .695      1.17      2.44      4.63      9.71      16.8
         |       408      .995      1.03      .043      .118      .207       .36       .61      1.22       2.3      4.75      7.01
         |       408      .161       .12    .00957     .0257     .0444     .0748      .121      .215       .34      .516      .611
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .274      .157     .0464     .0464     .0968      .128      .243       .38       .48      .692      .692
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.94     .0807      .209      .419      .781      1.46      2.33      4.12      9.63      16.8
         |       500      .996      .928      .043      .119      .228      .398      .809      1.04      2.05      4.72      7.01
         |       500      .182      .135    .00957     .0261     .0485     .0816      .134      .247      .392      .597      .692
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4512189   4.26e-06   8.54e-06   .4990018    1.00433
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0114041  -1.89e-07  -1.77e-06   .1064741   1.004312
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0240628   9.22e-07   6.00e-06   .1536741   1.004365
             |
          x4 |  .4218861   .4218849   1.21e-06   2.45e-06   .4952368   1.004329
          x5 |  25.44699   25.44697   .0000137   2.52e-06   5.422129   .6144636
          x6 |  11.84757   11.84755   .0000196   .0000119   1.641931   .5982538
          x7 |  7.015422    7.01543  -8.55e-06  -2.40e-06   3.555432   1.161762
         x90 |  .0839738   .0839754  -1.58e-06  -1.65e-06   .9597153   .8505311
         x91 | -.0648837  -.0648849   1.23e-06   1.31e-06     .93861   .9922921
         x92 |  .0575388   .0575408  -2.04e-06  -1.97e-06    1.03554   1.118264
         x93 |  .1016523   .1016503   2.03e-06   2.14e-06   .9463749   1.012574
         x94 | -.1252265  -.1252288   2.34e-06   2.56e-06   .9147554   .7576608
         x95 | -.1044649  -.1044664   1.41e-06   1.55e-06   .9069849   .8646446
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00000
  Mean absolute standardized diff.    = 0.00000
  Maximum absolute standardized diff. = 0.00001
  C.V. of matching weights:           = 1.03194
  S.D. of matching weights:           = 1.02713
  Skewness of matching weights:       = 0.11350
  Kurtosis of matching weights:       = 0.02292
  Maximum matching weight:            = 7.00792
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.367     3431.366   .0005901   3.70e-06   3431.366
   y1_binary |    .9509094     .9509091   2.71e-07   5.55e-06   .9509091
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight pcbps `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance cvtarget(1 .75 6) `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .00093832  
Iteration 1:   f(p) =  .00004631  
Iteration 2:   f(p) =  .00003859  
Iteration 3:   f(p) =  .00003858  
Iteration 4:   f(p) =  .00003858  
Iteration 5:   f(p) =  .00003857  
Iteration 6:   f(p) =  .00003714  
Iteration 7:   f(p) =  .00001562  
Iteration 8:   f(p) =  .00001516  
Iteration 9:   f(p) =  .00001516  
Iteration 10:  f(p) =  .00001516  
Iteration 11:  f(p) =  .00001516  
Iteration 12:  f(p) =  .00001515  
Iteration 13:  f(p) =  .00001499  
Iteration 14:  f(p) =  .00001375  
Iteration 15:  f(p) =   .0000132  
Iteration 16:  f(p) =  .00001318  
Iteration 17:  f(p) =  .00001318  
Iteration 18:  f(p) =  .00001318  
Iteration 19:  f(p) =  .00001318  
Iteration 20:  f(p) =  .00001311  
Iteration 21:  f(p) =  .00001279  
Iteration 22:  f(p) =  .00001268  
Iteration 23:  f(p) =  .00001268  
Iteration 24:  f(p) =  .00001268  
Iteration 25:  f(p) =  .00001268  
Iteration 26:  f(p) =  .00001268  
Iteration 27:  f(p) =  .00001266  
Iteration 28:  f(p) =  .00001255  
Iteration 29:  f(p) =   .0000125  
Iteration 30:  f(p) =   .0000125  
Iteration 31:  f(p) =   .0000125  
Iteration 32:  f(p) =   .0000125  
Iteration 33:  f(p) =   .0000125  
Iteration 34:  f(p) =   .0000125  
Iteration 35:  f(p) =  .00001247  
Iteration 36:  f(p) =  .00001247  
Iteration 37:  f(p) =  .00001247  
Iteration 38:  f(p) =  .00001247  
Iteration 39:  f(p) =  .00001247  
Iteration 40:  f(p) =  .00001247  
Iteration 41:  f(p) =  .00001247  
Iteration 42:  f(p) =  .00001247  
Iteration 43:  f(p) =  .00001247  
Iteration 44:  f(p) =  .00001247  
Iteration 45:  f(p) =  .00001247  
Iteration 46:  f(p) =  .00001247  
Iteration 47:  f(p) =  .00001247  
Iteration 48:  f(p) =  .00001247  
Iteration 49:  f(p) =  .00001247  
Iteration 50:  f(p) =  .00001247  
Iteration 51:  f(p) =  .00001247  
Iteration 52:  f(p) =  .00001247  
Iteration 53:  f(p) =  .00001247  
Iteration 54:  f(p) =  .00001247  
Iteration 55:  f(p) =  .00001247  
Iteration 56:  f(p) =  .00001246  
Iteration 57:  f(p) =  .00001246  
Iteration 58:  f(p) =  .00001246  
Iteration 59:  f(p) =  .00001246  
Iteration 60:  f(p) =  .00001246  
Iteration 61:  f(p) =  .00001246  
Iteration 62:  f(p) =  .00001246  
Iteration 63:  f(p) =  .00001246  
Iteration 64:  f(p) =  .00001246  
Iteration 65:  f(p) =  .00001246  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (just identified) + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.254181
        1.x2 |  -1.322943
        1.x3 |  -.3737879
          x4 |  -.3150736
          x5 |    .053865
          x6 |   -.207347
          x7 |   .0392197
         x90 |   .1112074
         x91 |  -.1096078
         x92 |   .1251036
         x93 |    .065952
         x94 |    -.09382
         x95 |  -.0291289
       _cons |   .4369062
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.81      .136      .285      .497       .83      1.32      2.51      4.37       8.5      13.5
         |       408      .996      .864     .0724       .17      .273      .438       .68      1.24      2.21      3.95      5.51
         |       408      .172      .109     .0168     .0384     .0605     .0937      .138      .226      .342      .482      .565
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .275      .138      .063      .063      .116      .147      .252      .373      .453      .641      .641
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.65      .136      .289      .555      .918      1.55      2.36      3.96      8.34      13.5
         |       500      .997       .78     .0724      .171      .297      .476      .864      1.06      1.98      3.95      5.51
         |       500      .191      .122     .0168     .0388     .0653        .1      .152      .255      .382      .553      .641
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4880522  -.0368291  -.0738055   .4990018   .9953384
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0133716  -.0019677  -.0184809   .1064741   .8582416
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0267065  -.0026428  -.0171972   .1536741   .9074009
             |
          x4 |  .4218861   .4355796  -.0136935  -.0276505   .4952368   .9963546
          x5 |  25.44699   25.52567  -.0786887  -.0145125   5.422129   .6374814
          x6 |  11.84757    12.0082  -.1606282  -.0978288   1.641931   .5789037
          x7 |  7.015422    6.96308   .0523413   .0147215   3.555432   1.157512
         x90 |  .0839738   .0663453   .0176285   .0183685   .9597153   .8599203
         x91 | -.0648837  -.0552227   -.009661  -.0102929     .93861   .9716611
         x92 |  .0575388   .0443219   .0132169   .0127633    1.03554   1.110882
         x93 |  .1016523   .0920433    .009609   .0101535   .9463749   .9946047
         x94 | -.1252265  -.1096389  -.0155876  -.0170402   .9147554    .770958
         x95 | -.1044649  -.0986898  -.0057751  -.0063674   .9069849   .8554811
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.01747
  Mean absolute standardized diff.    = 0.02609
  Maximum absolute standardized diff. = 0.09783
  C.V. of matching weights:           = 0.86705
  S.D. of matching weights:           = 0.86355
  Skewness of matching weights:       = 0.09623
  Kurtosis of matching weights:       = 0.01774
  Maximum matching weight:            = 5.51314
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3431.705     3436.509   -4.80385    -.03128   3436.509
   y1_binary |    .9509266     .9524272  -.0015006  -.0323358   .9524272
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight pcbps `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance cvtarget(1 .50 6) `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -435.82146  
Iteration 2:   f(p) = -411.28219  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
Iteration 0:   f(p) =  .03149776  
Iteration 1:   f(p) =  .00028651  
Iteration 2:   f(p) =  .00020393  
Iteration 3:   f(p) =  .00019258  
Iteration 4:   f(p) =  .00019213  
Iteration 5:   f(p) =  .00019201  
Iteration 6:   f(p) =  .00019201  
Iteration 7:   f(p) =  .00019103  
Iteration 8:   f(p) =  .00015724  
Iteration 9:   f(p) =  .00012566  
Iteration 10:  f(p) =  .00012402  
Iteration 11:  f(p) =   .0001237  
Iteration 12:  f(p) =  .00012357  
Iteration 13:  f(p) =  .00012356  
Iteration 14:  f(p) =  .00012356  
Iteration 15:  f(p) =  .00012354  
Iteration 16:  f(p) =  .00012314  
Iteration 17:  f(p) =   .0001185  
Iteration 18:  f(p) =  .00009057  
Iteration 19:  f(p) =  .00008183  
Iteration 20:  f(p) =  .00008118  
Iteration 21:  f(p) =  .00008114  
Iteration 22:  f(p) =  .00008114  
Iteration 23:  f(p) =  .00008114  
Iteration 24:  f(p) =  .00008113  
Iteration 25:  f(p) =  .00008107  
Iteration 26:  f(p) =  .00008051  
Iteration 27:  f(p) =  .00007995  
Iteration 28:  f(p) =  .00007994  
Iteration 29:  f(p) =  .00007994  
Iteration 30:  f(p) =  .00007994  
Iteration 31:  f(p) =  .00007994  
Iteration 32:  f(p) =  .00007991  
Iteration 33:  f(p) =  .00007979  
Iteration 34:  f(p) =  .00007971  
Iteration 35:  f(p) =  .00007971  
Iteration 36:  f(p) =  .00007971  
Iteration 37:  f(p) =  .00007971  
Iteration 38:  f(p) =  .00007971  
Iteration 39:  f(p) =  .00007969  
Iteration 40:  f(p) =  .00007968  
Iteration 41:  f(p) =  .00007968  
Iteration 42:  f(p) =  .00007968  
Iteration 43:  f(p) =  .00007968  
Iteration 44:  f(p) =  .00007967  
Iteration 45:  f(p) =  .00007967  
Iteration 46:  f(p) =  .00007967  
Iteration 47:  f(p) =  .00007967  
Iteration 48:  f(p) =  .00007967  
Iteration 49:  f(p) =  .00007967  
Iteration 50:  f(p) =  .00007967  
Iteration 51:  f(p) =  .00007967  
Iteration 52:  f(p) =  .00007967  
Iteration 53:  f(p) =  .00007967  
Iteration 54:  f(p) =  .00007967  
Iteration 55:  f(p) =  .00007967  
Iteration 56:  f(p) =  .00007967  
Iteration 57:  f(p) =  .00007967  
Iteration 58:  f(p) =  .00007967  
Iteration 59:  f(p) =  .00007967  
Iteration 60:  f(p) =  .00007967  
Iteration 61:  f(p) =  .00007967  
Iteration 62:  f(p) =  .00007967  
Iteration 63:  f(p) =  .00007967  
Iteration 64:  f(p) =  .00007967  
Iteration 65:  f(p) =  .00007967  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = CBPS (just identified) + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.9697348
        1.x2 |  -1.009948
        1.x3 |  -.2681193
          x4 |  -.2328724
          x5 |   .0401949
          x6 |  -.1592826
          x7 |   .0284828
         x90 |   .0826327
         x91 |  -.0793657
         x92 |   .0918013
         x93 |   .0506792
         x94 |  -.0790893
         x95 |  -.0177969
       _cons |   .1432518
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.38      .271      .445      .706      1.03      1.54      2.49      3.85      6.84      9.73
         |       408      .997      .647      .144      .273      .397      .566      .778      1.24         2      3.05      3.88
         |       408      .186     .0903     .0345     .0633     .0893      .123      .161      .235      .331       .43       .49
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .27      .107     .0905     .0905      .143      .171      .257      .348      .405      .555      .555
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.26      .271      .449      .762      1.16      1.68      2.38      3.55      6.55      9.73
         |       500      .997      .584      .144      .275      .418      .597      .937      1.08      1.82      3.03      3.88
         |       500      .202      .099     .0345     .0637     .0933      .127      .174      .264      .355       .48      .555
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5455565  -.0943333  -.1890441   .4990018   1.003097
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0163288  -.0049249  -.0462544   .1064741   .7049256
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0302591  -.0061954  -.0403152   .1536741   .8037995
             |
          x4 |  .4218861   .4518912  -.0300051  -.0605875   .4952368   .9889709
          x5 |  25.44699   25.68607  -.2390886   -.044095   5.422129   .6743964
          x6 |  11.84757   12.24705  -.3994826  -.2433005   1.641931   .5553463
          x7 |  7.015422    6.89603   .1193915     .03358   3.555432   1.154005
         x90 |  .0839738   .0421686   .0418053   .0435601   .9597153   .8752326
         x91 | -.0648837  -.0430192  -.0218646  -.0232946     .93861   .9459255
         x92 |  .0575388   .0282771   .0292616   .0282573    1.03554   1.101599
         x93 |  .1016523   .0789374   .0227149    .024002   .9463749   .9718368
         x94 | -.1252265  -.0859457  -.0392808  -.0429413   .9147554   .7889919
         x95 | -.1044649  -.0909646  -.0135004  -.0148849   .9069849   .8447606
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.04426
  Mean absolute standardized diff.    = 0.06416
  Maximum absolute standardized diff. = 0.24330
  C.V. of matching weights:           = 0.64863
  S.D. of matching weights:           = 0.64659
  Skewness of matching weights:       = 0.07527
  Kurtosis of matching weights:       = 0.01274
  Maximum matching weight:            = 3.88354
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3433.335     3443.147  -9.811935   -.067213   3443.147
   y1_binary |     .950974     .9546103  -.0036363  -.0831634   .9546103
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance cvtarget(1 .75 6) difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .00118407  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .00047827  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .00006974  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00004509  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  9.893e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  2.962e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  1.695e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  6.547e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  2.889e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  1.307e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  8.557e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  7.610e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  6.398e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  6.152e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  6.114e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  6.091e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.081e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  5.990e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  4.580e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  4.132e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  2.418e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.342e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.205e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  3.104e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  2.120e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  8.860e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  3.749e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  1.030e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  2.922e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  2.038e-11  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.75)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.208198
        1.x2 |  -1.629451
        1.x3 |  -.4531254
          x4 |  -.3193345
          x5 |   .0014374
          x6 |  -.0045749
          x7 |  -.0755494
         x90 |   .0258804
         x91 |  -.1249186
         x92 |   .0509888
         x93 |  -.0104291
         x94 |  -.0914521
         x95 |  -.0549908
       _cons |   1.261429
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97       1.6      .146      .389      .729      .977      1.39      2.49      4.02      7.82      11.3
         |       408      .998      .765     .0801      .286      .407      .511       .71      1.17      2.02      3.73      5.31
         |       408      .409      .144     .0631      .194      .255        .3      .374      .495      .629      .758      .817
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .506      .157       .21       .21       .29      .369      .507      .635      .704      .799      .799
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.45      .146      .403      .769      1.07      1.55      2.37      3.68      7.52      11.3
         |       500      .998      .691     .0801      .287      .426      .561      .865      1.03      1.88      3.71      5.31
         |       500      .427      .151     .0631      .194       .26      .308      .395      .536      .651      .779      .817
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .4979598  -.0467367  -.0936603   .4990018   .9947866
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096845   .0017193   .0161481   .1064741   1.180579
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0211689   .0028948   .0188374   .1536741   1.138292
             |
          x4 |  .4218861   .4809191   -.059033  -.1192016   .4952368   .9812442
          x5 |  25.44699   24.87951   .5674772   .1046595   5.422129   .7784627
          x6 |  11.84757    12.5669  -.7193294  -.4380997   1.641931   .5287003
          x7 |  7.015422   5.785062   1.230359   .3460506   3.555432   1.160607
         x90 |  .0839738   .0344768    .049497   .0515747   .9597153   .8413523
         x91 | -.0648837  -.0963036   .0314199   .0334749     .93861   .9517656
         x92 |  .0575388   .0508365   .0067023   .0064723    1.03554   1.082082
         x93 |  .1016523   .0484604   .0531919   .0562059   .9463749   .9767654
         x94 | -.1252265  -.1322908   .0070643   .0077226   .9147554   .8111541
         x95 | -.1044649  -.1133624   .0088975   .0098099   .9069849   .8531474
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = -0.00000
  Mean absolute standardized diff.    = 0.10015
  Maximum absolute standardized diff. = 0.43810
  C.V. of matching weights:           = 0.76650
  S.D. of matching weights:           = 0.76494
  Skewness of matching weights:       = 0.10496
  Kurtosis of matching weights:       = 0.02048
  Maximum matching weight:            = 5.31291
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |     3442.38     3466.121  -23.74095  -.1669312   3466.121
   y1_binary |    .9527962     .9689016  -.0161054  -.4468055   .9689016
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance cvtarget(1 .50 6) difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =  .03174366  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .01880683  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01499079  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00460016  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00088681  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00069868  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =  .00016284  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =  .00008031  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00004972  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00003906  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003723  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00002755  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00001175  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =  8.513e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  7.187e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  7.095e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  6.862e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  6.265e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  2.861e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  1.002e-06  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =  4.679e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =  1.693e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 22:  f(p) =  1.196e-07  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 23:  f(p) =  9.990e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 24:  f(p) =  9.395e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 25:  f(p) =  9.361e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 26:  f(p) =  9.191e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 27:  f(p) =  9.100e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 28:  f(p) =  9.094e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 29:  f(p) =  9.037e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 30:  f(p) =  9.011e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 31:  f(p) =  9.006e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 32:  f(p) =  8.967e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 33:  f(p) =  7.641e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 34:  f(p) =  1.980e-08  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 35:  f(p) =  6.924e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 36:  f(p) =  3.256e-09  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 37:  f(p) =  8.736e-10  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 38:  f(p) =  2.764e-11  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 39:  f(p) =  2.322e-11  

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = mean(stddiff())^2 + 1*abs(wgt_cv()-.5)^6)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -.6087013
        1.x2 |    -1.6297
        1.x3 |  -.4702072
          x4 |  -.2183411
          x5 |  -.0048213
          x6 |  -.0275477
          x7 |  -.0334677
         x90 |  -.1311778
         x91 |  -.1519179
         x92 |  -.1700238
         x93 |  -.1077248
         x94 |  -.0641539
         x95 |  -.1816208
       _cons |   1.248128
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      1.12      .216      .359      .836       1.2      1.76      2.41      3.43      5.93      8.68
         |       408      .999      .516      .115      .192       .47      .645      .898      1.21      1.65      2.68      3.31
         |       408      .482       .12      .108      .168      .331      .404      .486      .561      .634      .738      .776
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92       .54      .118      .202      .202      .397       .47      .536      .621       .69      .778      .778
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.03      .216      .379      .888      1.27      1.83      2.37      3.21      5.93      8.68
         |       500      .999      .466      .115      .218      .504      .703         1      1.13      1.59      2.65      3.31
         |       500      .493      .121      .108      .185      .341      .413      .494      .575      .647      .756      .778
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .6243065  -.1730834  -.3468592   .4990018   1.060306
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0076971   .0037068   .0348137   .1064741   1.482433
             |
          x3 |
          0  |  (empty)
          1  |  .0240637    .021424   .0026397   .0171771   .1536741    1.12503
             |
          x4 |  .4218861   .4972791   -.075393  -.1522363   .4952368   .9798442
          x5 |  25.44699   25.47438  -.0273978   -.005053   5.422129   .7913316
          x6 |  11.84757   12.67253  -.8249608  -.5024333   1.641931   .5217328
          x7 |  7.015422   6.370187   .6452342   .1814784   3.555432   1.121064
         x90 |  .0839738  -.1313171   .2152909   .2243279   .9597153   .8834873
         x91 | -.0648837  -.1264568   .0615731   .0656003     .93861   .9535062
         x92 |  .0575388  -.1823564   .2398951   .2316618    1.03554    1.08368
         x93 |  .1016523  -.0507504   .1524027   .1610384   .9463749   .8930272
         x94 | -.1252265  -.0840925  -.0411339  -.0449672   .9147554   .8214365
         x95 | -.1044649  -.2273282   .1228633   .1354634   .9069849   .8445254
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00000
  Mean absolute standardized diff.    = 0.16178
  Maximum absolute standardized diff. = 0.50243
  C.V. of matching weights:           = 0.51678
  S.D. of matching weights:           = 0.51619
  Skewness of matching weights:       = 0.06871
  Kurtosis of matching weights:       = 0.01396
  Maximum matching weight:            = 3.30605
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3447.637     3476.778  -29.14083  -.1819619   3476.778
   y1_binary |    .9516739     .9624371  -.0107632   -.263479   .9624371
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. 
. // you can also target skiwness, kurtosis, or max weight, but it's finicky
. 
. capture nois {
. psweight mean_sd_sq `treatvar' `varlist' if `tousevar' [iw=`wgtvar'], atet treatvariance maxtarget(1 10 2) difficult nonrtolerance `depvaropt'

  408 control obs (sum of weights = 802.3793)
  92 treatment obs (sum of weights = 180.1725)
  Step 1 (initial values from logit model):
initial:       f(p) = -681.05307
alternative:   f(p) =  -555.8915
rescale:       f(p) = -485.05844
Iteration 0:   f(p) = -485.05844  
Iteration 1:   f(p) = -436.32795  
Iteration 2:   f(p) = -411.28933  
Iteration 3:   f(p) = -411.19869  
Iteration 4:   f(p) = -411.19865  
Iteration 5:   f(p) = -411.19865  
  
  Step 2 (CBPS) :
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 0:   f(p) =   .9280066  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 1:   f(p) =  .08139982  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 2:   f(p) =  .01131212  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 3:   f(p) =  .00131851  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 4:   f(p) =  .00061119  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 5:   f(p) =  .00059297  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 6:   f(p) =   .0002731  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 7:   f(p) =   .0002332  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 8:   f(p) =  .00005678  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 9:   f(p) =  .00005625  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 10:  f(p) =  .00003297  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 11:  f(p) =  .00003287  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 12:  f(p) =  .00002891  
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 13:  f(p) =   .0000284  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 14:  f(p) =  .00002755  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 15:  f(p) =  .00002747  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 16:  f(p) =  .00002734  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 17:  f(p) =  .00002731  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 18:  f(p) =  .00002731  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 19:  f(p) =  .00002722  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 20:  f(p) =   .0000271  (backed up)
numerical derivatives are approximate
flat or discontinuous region encountered
Iteration 21:  f(p) =   .0000271  (backed up)

Propensity score model coefficients                Number of obs  =        983
Propensity score reweigting
Loss = mean(stddiff())^2 + 0*abs(wgt_cv()-0)^2) + 0*abs(wgt_skewness()-0)^2) + 0*abs(wgt_kurtosis()-0)^2) + 1*abs(wgt_max()-10)^2)
------------------------------------------------------------------------------
       treat |      Coef.
-------------+----------------------------------------------------------------
          x1 |  -1.318619
        1.x2 |   -1.63885
        1.x3 |  -.4675591
          x4 |  -.3836034
          x5 |    .079825
          x6 |  -.2414724
          x7 |   .0463891
         x90 |   .0619869
         x91 |  -.1448107
         x92 |   .0720873
         x93 |   .0076339
         x94 |  -.1756795
         x95 |  -.0617892
       _cons |   1.245144
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |       408      1.97      2.08     .0733      .234      .436      .725      1.23      2.45      4.22      10.5      19.6
         |       408         1      1.03     .0391       .12      .232      .367       .66      1.25      2.03       4.7      9.99
         |       408      .343      .173     .0262      .076      .138      .202      .312      .463      .582      .764      .873
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        92      1.96      .391      .877      .877      1.39      1.72         2      2.25      2.45      2.67      2.67
         |        92         1         0         1         1         1         1         1         1         1         1         1
         |        92      .492      .182      .179      .179      .264      .329      .459      .664       .72      .875      .875
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       500      1.97      1.89     .0733      .236       .47      .844      1.51      2.32      3.77      10.3      19.6
         |       500         1      .932     .0391      .122       .25      .434      .868      1.08      1.84       4.6      9.99
         |       500       .37      .184     .0262     .0773      .147      .226      .335      .492      .659      .787      .875
----------------------------------------------------------------------------------------------------------------------------------
. psweight call balanceresults()
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff       sd_T  var_ratio
-------------+-----------------------------------------------------------------
          x1 |  .4512231   .5183316  -.0671085  -.1344855   .4990018    .996109
             |
          x2 |
          0  |  (empty)
          1  |  .0114039   .0096038   .0018001   .0169063   .1064741   1.190407
             |
          x3 |
          0  |  (empty)
          1  |  .0240637   .0230685   .0009952   .0064758   .1536741   1.046587
             |
          x4 |  .4218861   .3861181    .035768   .0722241   .4952368   1.033426
          x5 |  25.44699   26.58762  -1.140634  -.2103665   5.422129   .5983511
          x6 |  11.84757   11.97598  -.1284144  -.0782094   1.641931   .5770507
          x7 |  7.015422    7.03971  -.0242881  -.0068313   3.555432   1.141228
         x90 |  .0839738  -.0212864   .1052602   .1096786   .9597153   .8682652
         x91 | -.0648837   -.077797   .0129133   .0137579     .93861   1.000414
         x92 |  .0575388  -.0066257   .0641645   .0619623    1.03554   1.135185
         x93 |  .1016523   .0540247   .0476276   .0503264   .9463749   .9773862
         x94 | -.1252265  -.2113239   .0860974   .0941207   .9147554   .7271116
         x95 | -.1044649  -.1175579   .0130929   .0144356   .9069849   .8552252
-------------------------------------------------------------------------------
  
  Mean standardized diff.             = 0.00077
  Mean absolute standardized diff.    = 0.06691
  Maximum absolute standardized diff. = 0.21037
  C.V. of matching weights:           = 1.03273
  S.D. of matching weights:           = 1.03242
  Skewness of matching weights:       = 0.15775
  Kurtosis of matching weights:       = 0.04815
  Maximum matching weight:            = 9.99485
  
  Prognostic scores:
------------------------------------------------------------------------
             | mean_yhat_T  mean_yhat_C       diff   std_diff   mean_y_C
-------------+----------------------------------------------------------
          y1 |    3430.583     3453.664  -23.08025  -.1355602   3453.664
   y1_binary |    .9503594     .9520439  -.0016846  -.0330223   .9520439
------------------------------------------------------------------------
  Note: The std_diff column does not account for the standard error of the linear predictions.
. }
. 
. log close psweight_example_ado
      name:  psweight_example_ado
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\psweight_example_ado.log
  log type:  text
 closed on:   6 Jun 2019, 18:30:12
----------------------------------------------------------------------------------------------------------------------------------------------------------------
