------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  sims1
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\sims/sims1.log
  log type:  text
 opened on:  26 Oct 2018, 11:15:41

. 
. // DGP is saved in a separate .ado file
. adopath ++ "./sims"
  [1]              "./sims"
  [2]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [3]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "C:\Users\kkranker\Documents\Stata\Ado\personal/"
  [6]  (PLUS)      "C:\Users\kkranker\Documents\Stata\Ado\plus/"
  [7]  (OLDPLACE)  "C:\Users\kkranker\Documents\Stata\Ado/"
  [8]              "C:\Users\kkranker\Documents\Stata\Stata-Common-Code"

. which dgp_ssbgc
./sims\dgp_ssbgc.ado
*! $Id: dgp_ssbgc.ado,v 872b01f9dee1 2018/10/25 23:15:03 kkranker $
*! Data generating processe (DGP) senarios A through G from Setoguchi et al. (2008)
*! By Keith Kranker

. which addstats
./sims\addstats.ado

. 
. program define onerep
  1.   version 15.1
  2.   set cformat %9.2fc
  3.   set pformat %5.3f
  4.   set sformat %7.3f
  5.   set type float
  6.   set maxiter 50
  7. 
.   // this lets me keep the "parallal sim"  command simple
.   // but probably slows things down
.   cd "C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch"
  8.   adopath ++ "./sims"
  9. 
.   syntax [anything], n(numlist min=1 >0 integer sort) [*]
 10.   tempname bbld
 11. 
.   local L : word count `n'
 12.   dgp_ssbgc `anything', n(`: word `L' of `n'') `options'
 13. 
.   local l = `L'
 14.   while `l' > 0 {
 15.     local thisN : word `l' of `n'
 16.     di _n(3) "N = `thisN'" _n(2)
 17.     keep in 1/`thisN'
 18. 
.     gmatch a w1-w10, atet ipw pooledvariance
 19.     regress y i.a [aw=_weight], noheader
 20.     addstats `bbld' ipw_`thisN' 1.a
 21. 
.     local --l
 22.   }
 23. 
.   // gmatch a w1-w10, atet cbps pooledvariance
.   ereturn clear
 24.   ereturn post `bbld'
 25. end

. 
. set seed 1

. 
. onerep A, n(100)
C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch
  [1]              "./sims"
  [2]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [3]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "C:\Users\kkranker\Documents\Stata\Ado\personal/"
  [6]  (PLUS)      "C:\Users\kkranker\Documents\Stata\Ado\plus/"
  [7]  (OLDPLACE)  "C:\Users\kkranker\Documents\Stata\Ado/"
  [8]              "C:\Users\kkranker\Documents\Stata\Stata-Common-Code"
(obs 100)



N = 100


(0 observations deleted)

  45 control obs
  55 treatment obs
  (Data are unweighted.)
initial:       f(p) = -69.314718
alternative:   f(p) = -69.907698
rescale:       f(p) = -68.843942
Iteration 0:   f(p) = -68.843942  
Iteration 1:   f(p) =  -49.58671  
Iteration 2:   f(p) = -49.367688  
Iteration 3:   f(p) = -49.367045  
Iteration 4:   f(p) = -49.367045  

Propensity score model coefficients                Number of obs  =        100
Generalization of IPW/CPBS-type reweigting
Loss = IPW
------------------------------------------------------------------------------
           a |      Coef.
-------------+----------------------------------------------------------------
          w1 |       0.43
          w2 |      -0.01
          w3 |       0.87
          w4 |      -0.24
          w5 |      -2.51
          w6 |      -0.25
          w7 |       0.69
          w8 |      -0.06
          w9 |       0.65
         w10 |      -0.89
       _cons |       0.88
------------------------------------------------------------------------------

New variables (unweighted summary statistics)

Summary for variables: _weight _weight_mtch _pscore
     by categories of: _treated 

_treated |         N      mean        sd       min        p1       p10       p25       p50       p75       p90       p99       max
---------+------------------------------------------------------------------------------------------------------------------------
       0 |        45         1      3.37    .00828    .00828     .0584      .116      .199      .733      1.72      22.7      22.7
         |        45         1      3.37    .00828    .00828     .0584      .116      .199      .733      1.72      22.7      22.7
         |        45      .357      .259     .0148     .0148     .0956      .174      .265       .57      .757      .976      .976
---------+------------------------------------------------------------------------------------------------------------------------
       1 |        55         1         0         1         1         1         1         1         1         1         1         1
         |        55         1         0         1         1         1         1         1         1         1         1         1
         |        55      .708      .216      .112      .112      .353      .596      .732      .893      .948      .974      .974
---------+------------------------------------------------------------------------------------------------------------------------
   Total |       100         1      2.24    .00828      .017     .0837       .22         1         1      1.06      12.6      22.7
         |       100         1      2.24    .00828      .017     .0837       .22         1         1      1.06      12.6      22.7
         |       100       .55      .293     .0148     .0297      .125      .259      .635      .799      .928      .975      .976
----------------------------------------------------------------------------------------------------------------------------------
(sum of wgt is 100)
------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           a |
  Treatment  |      -0.16       0.12   -1.352   0.180        -0.40        0.08
       _cons |      -4.13       0.09  -46.732   0.000        -4.31       -3.96
------------------------------------------------------------------------------

 ( 1)  1.a = 0

       F(  1,    98) =    1.83
            Prob > F =    0.1796

 ( 1)  1.a = -.4

       F(  1,    98) =    4.01
            Prob > F =    0.0480
  Balance:
-------------------------------------------------------------------------------
             |    mean_T     mean_C       diff   std_diff    sd_pool  var_ratio
-------------+-----------------------------------------------------------------
          w1 |  .4545455   .6498762  -.1953308  -.3901115    .500705   1.085157
          w2 | -.1824849   .1343234  -.3168083  -.4004338   .7911627   1.994936
          w3 |  .5818182   .8117786  -.2299604  -.4926994   .4667357   1.585824
          w4 | -.0118669  -.7262923   .7144254   .6863875   1.040848   1.419979
          w5 |        .4   .2046221   .1953779   .4195571   .4656765   1.468569
          w6 |  .4727273    .225066   .2476612   .5129777   .4827914   1.423247
          w7 |  .3091801   .2773161    .031864   .0385077   .8274709   1.138523
          w8 |  .4545455   .2321856   .2223599   .4625113   .4807664   1.385012
          w9 |  .5090909   .2238792   .2852117   .5844306   .4880164   1.432394
         w10 | -.1942465  -.4045132   .2102667    .229962   .9143542    1.84971
-------------------------------------------------------------------------------
  
  Mean standardized diff., squared
  .0272609549
  Mean absolute standardized diff.
  .4217578585
  Maximum absolute standardized diff.
  .6863875398
  C.V. of matching weights:
  2.243611239
  S.D. of matching weights:
  2.243611239
  Skewness of matching weights:
  .9137526629
  Kurtosis of matching weights:
  .888357018
  Maximum matching weight:
  22.67203626

__000001[1,15]
         ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:      ipw_100:
      impact_est      sd_error          bias     error_sqr      p_null_0  reject_nul~0   p_null_true  reject_nul~e   bal_max_asd  bal_mean_asd        wgt_sd        wgt_cv
r1    -.16120775     .11927034     .23879225     .05702174     .17960966             0     .04803654             1     .68638754     .42175786     2.2436112     2.2436112

         ipw_100:      ipw_100:      ipw_100:
    wgt_skewness  wgt_kurtosis       wgt_max
r1     .91375266     .88835702     22.672036

. ereturn display
----------------------------------------------------------------------------------
                 |      Coef.
-----------------+----------------------------------------------------------------
ipw_100          |
      impact_est |      -0.16
        sd_error |       0.12
            bias |       0.24
       error_sqr |       0.06
        p_null_0 |       0.18
   reject_null_0 |       0.00
     p_null_true |       0.05
reject_null_true |       1.00
     bal_max_asd |       0.69
    bal_mean_asd |       0.42
          wgt_sd |       2.24
          wgt_cv |       2.24
    wgt_skewness |       0.91
    wgt_kurtosis |       0.89
         wgt_max |      22.67
----------------------------------------------------------------------------------

. 
. // simulate _b, reps(10): onerep A, n(500)
. // codebook, compact
. 
. parallel setclusters `c(processors_mach)'
N Clusters: 8
Stata dir:  C:\Program Files (x86)\Stata15/StataMP-64.exe

. parallel sim, expr(_b) reps(2000) processors(1): onerep A, n(8000 500 4000 2000 1750 1500 1250 1000 800 600 400 200 100) impact(-.10)
--------------------------------------------------------------------------------
Exporting the following program(s): onerep

onerep:
  1.   version 15.1
  2.   set cformat %9.2fc
  3.   set pformat %5.3f
  4.   set sformat %7.3f
  5.   set type float
  6.   set maxiter 50
  7.   cd "C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch"
  8.   adopath ++ "./sims"
  9.   syntax [anything], n(numlist min=1 >0 integer sort) [*]
 10.   tempname bbld
 11.   local L : word count `n'
 12.   dgp_ssbgc `anything', n(`: word `L' of `n'') `options'
 13.   local l = `L'
 14.   while `l' > 0 {
 15.     local thisN : word `l' of `n'
 16.     di _n(3) "N = `thisN'" _n(2)
 17.     keep in 1/`thisN'
 18.     gmatch a w1-w10, atet ipw pooledvariance
 19.     regress y i.a [aw=_weight], noheader
 20.     addstats `bbld' ipw_`thisN' 1.a
 21.     local --l
 22.   }
 23.   ereturn clear
 24.   ereturn post `bbld'
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
Parallel Computing with Stata (by GVY)
Clusters   : 8
pll_id     : q8zjn2wkl3
Running at : C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch
Randtype   : datetime
Waiting for the clusters to finish...
cluster 0007 has exited without error...
cluster 0004 has exited without error...
cluster 0008 has exited without error...
cluster 0005 has exited without error...
cluster 0001 has exited without error...
cluster 0002 has exited without error...
cluster 0006 has exited without error...
cluster 0003 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------

. codebook, compact

Variable       Obs Unique       Mean        Min        Max  Label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ipw_8000_b~t  2000   2000  -.1006395  -.1527057  -.0586843  [ipw_8000]_b[impact_est]
ipw_8000_~or  2000   1994   .0160372   .0154175   .0166231  [ipw_8000]_b[sd_error]
ipw_8000_~as  2000   2000  -.0006395  -.0527057   .0413157  [ipw_8000]_b[bias]
ipw_8000_~qr  2000   2000   .0001557   1.83e-11   .0027779  [ipw_8000]_b[error_sqr]
ipw_8000_b..  2000   2000   4.31e-07   4.89e-21   .0002452  [ipw_8000]_b[p_null_0]
ipw_8000_b..  2000      1          1          1          1  [ipw_8000]_b[reject_null_0]
ipw_8000_b..  2000   2000   .5834035   .0011289   .9997841  [ipw_8000]_b[p_null_true]
ipw_8000_b..  2000      2      .0145          0          1  [ipw_8000]_b[reject_null_true]
ipw_8000_b..  2000   2000    .033061   .0096367   .1258556  [ipw_8000]_b[bal_max_asd]
ipw_8000_b..  2000   2000   .0140577   .0044156   .0413755  [ipw_8000]_b[bal_mean_asd]
ipw_8000~_sd  2000   2000   .9131791   .7626557   1.636358  [ipw_8000]_b[wgt_sd]
ipw_8000_b~v  2000   2000   .9131791   .7626557   1.636358  [ipw_8000]_b[wgt_cv]
ipw_8000_~ss  2000   2000   .0887739   .0471404   .5849578  [ipw_8000]_b[wgt_skewness]
ipw_8000_~is  2000   2000   .0183188   .0041169   .4766816  [ipw_8000]_b[wgt_kurtosis]
ipw_8000_b~x  2000   1999    23.7214   11.30309   122.5509  [ipw_8000]_b[wgt_max]
ipw_4000_b~t  2000   2000  -.1002996  -.1722283  -.0432603  [ipw_4000]_b[impact_est]
ipw_4000_~or  2000   1996    .022679   .0214567   .0239024  [ipw_4000]_b[sd_error]
ipw_4000_~as  2000   2000  -.0002996  -.0722283   .0567397  [ipw_4000]_b[bias]
ipw_4000_~qr  2000   2000   .0003199   1.03e-10   .0052169  [ipw_4000]_b[error_sqr]
ipw_4000_b..  2000   2000   .0003484   1.06e-13   .0536115  [ipw_4000]_b[p_null_0]
ipw_4000_b..  2000      2      .9995          0          1  [ipw_4000]_b[reject_null_0]
ipw_4000_b..  2000   2000   .5766214   .0017723   .9996357  [ipw_4000]_b[p_null_true]
ipw_4000_b..  2000      2      .0155          0          1  [ipw_4000]_b[reject_null_true]
ipw_4000_b..  2000   2000   .0469398   .0144886   .1889406  [ipw_4000]_b[bal_max_asd]
ipw_4000_b..  2000   1999   .0200393   .0063822   .0792472  [ipw_4000]_b[bal_mean_asd]
ipw_4000~_sd  2000   1999   .9145873   .7026024   2.208266  [ipw_4000]_b[wgt_sd]
ipw_4000_b~v  2000   1999   .9145873   .7026024   2.208266  [ipw_4000]_b[wgt_cv]
ipw_4000_~ss  2000   1999     .11962   .0596348    .734933  [ipw_4000]_b[wgt_skewness]
ipw_4000_~is  2000   2000   .0314784     .00635   .6526538  [ipw_4000]_b[wgt_kurtosis]
ipw_4000_b~x  2000   1999   19.96407   8.533266   126.4776  [ipw_4000]_b[wgt_max]
ipw_2000_b~t  2000   2000  -.1006732  -.2267884   -.027226  [ipw_2000]_b[impact_est]
ipw_2000_~or  2000   1999   .0321041   .0301075   .0346635  [ipw_2000]_b[sd_error]
ipw_2000_~as  2000   2000  -.0006732  -.1267883    .072774  [ipw_2000]_b[bias]
ipw_2000_~qr  2000   2000   .0006833   3.51e-11   .0160753  [ipw_2000]_b[error_sqr]
ipw_2000_b..  2000   2000   .0125302   3.17e-11   .3953647  [ipw_2000]_b[p_null_0]
ipw_2000_b..  2000      2      .9355          0          1  [ipw_2000]_b[reject_null_0]
ipw_2000_b..  2000   2000   .5757074   .0001949   .9998523  [ipw_2000]_b[p_null_true]
ipw_2000_b..  2000      2        .02          0          1  [ipw_2000]_b[reject_null_true]
ipw_2000_b..  2000   2000   .0663152   .0199989   .2003809  [ipw_2000]_b[bal_max_asd]
ipw_2000_b..  2000   2000   .0286488   .0087205   .1105137  [ipw_2000]_b[bal_mean_asd]
ipw_2000~_sd  2000   1999   .9196905   .6842587   2.412097  [ipw_2000]_b[wgt_sd]
ipw_2000_b~v  2000   1999   .9196905   .6842587   2.412097  [ipw_2000]_b[wgt_cv]
ipw_2000_~ss  2000   2000   .1585137   .0769617   .7557463  [ipw_2000]_b[wgt_skewness]
ipw_2000_~is  2000   2000   .0508002   .0106139   .6714773  [ipw_2000]_b[wgt_kurtosis]
ipw_2000_b~x  2000   2000   16.78322   7.240391   96.28609  [ipw_2000]_b[wgt_max]
ipw_1750_b~t  2000   2000  -.1007281  -.2545529  -.0219774  [ipw_1750]_b[impact_est]
ipw_1750_~or  2000   1996    .034329   .0321474   .0373229  [ipw_1750]_b[sd_error]
ipw_1750_~as  2000   2000  -.0007281  -.1545529   .0780226  [ipw_1750]_b[bias]
ipw_1750_~qr  2000   2000   .0007895   5.36e-10   .0238866  [ipw_1750]_b[error_sqr]
ipw_1750_b..  2000   1999    .020145   7.46e-12     .50863  [ipw_1750]_b[p_null_0]
ipw_1750_b..  2000      2       .895          0          1  [ipw_1750]_b[reject_null_0]
ipw_1750_b..  2000   2000   .5730598   .0000297   .9994714  [ipw_1750]_b[p_null_true]
ipw_1750_b..  2000      2      .0205          0          1  [ipw_1750]_b[reject_null_true]
ipw_17~x_asd  2000   2000   .0707462    .022423   .2267597  [ipw_1750]_b[bal_max_asd]
ipw_17~n_asd  2000   2000   .0304513   .0092018   .1249567  [ipw_1750]_b[bal_mean_asd]
ipw_1750~_sd  2000   2000   .9216135   .6756034   2.529672  [ipw_1750]_b[wgt_sd]
ipw_1750_b~v  2000   2000   .9216135   .6756034   2.529672  [ipw_1750]_b[wgt_cv]
ipw_1750_~ss  2000   1999   .1677278   .0752591    .757963  [ipw_1750]_b[wgt_skewness]
ipw_1750_~is  2000   2000   .0561028   .0105163   .6833491  [ipw_1750]_b[wgt_kurtosis]
ipw_1750_b~x  2000   2000   16.28036   6.729383   95.90929  [ipw_1750]_b[wgt_max]
ipw_1500_b~t  2000   2000  -.1006736  -.2636137    -.01741  [ipw_1500]_b[impact_est]
ipw_1500_~or  2000   1998   .0370714   .0345938   .0406917  [ipw_1500]_b[sd_error]
ipw_1500_~as  2000   2000  -.0006736  -.1636137     .08259  [ipw_1500]_b[bias]
ipw_1500_~qr  2000   2000   .0009126   1.46e-09   .0267694  [ipw_1500]_b[error_sqr]
ipw_1500_b..  2000   2000   .0306765   6.89e-11   .6380762  [ipw_1500]_b[p_null_0]
ipw_1500_b..  2000      2       .831          0          1  [ipw_1500]_b[reject_null_0]
ipw_1500_b..  2000   2000   .5753849   .0000478   .9991667  [ipw_1500]_b[p_null_true]
ipw_1500_b..  2000      2      .0185          0          1  [ipw_1500]_b[reject_null_true]
ipw_15~x_asd  2000   2000   .0765658   .0219334   .2634523  [ipw_1500]_b[bal_max_asd]
ipw_15~n_asd  2000   1999   .0331465   .0085581   .1438877  [ipw_1500]_b[bal_mean_asd]
ipw_1500~_sd  2000   2000   .9257127   .6636035   2.611115  [ipw_1500]_b[wgt_sd]
ipw_1500_b~v  2000   2000   .9257127   .6636035   2.611115  [ipw_1500]_b[wgt_cv]
ipw_1500_~ss  2000   2000    .179093    .075208   .7921727  [ipw_1500]_b[wgt_skewness]
ipw_1500_~is  2000   2000   .0631712   .0104113   .7177425  [ipw_1500]_b[wgt_kurtosis]
ipw_1500_b~x  2000   1999   15.75796   5.821872   93.08668  [ipw_1500]_b[wgt_max]
ipw_1250_b~t  2000   1999  -.1010245  -.2406651  -.0000208  [ipw_1250]_b[impact_est]
ipw_1250_~or  2000   1997   .0406083   .0372334   .0456472  [ipw_1250]_b[sd_error]
ipw_1250_~as  2000   2000  -.0010245  -.1406651   .0999792  [ipw_1250]_b[bias]
ipw_1250_~qr  2000   2000    .001064   8.62e-10   .0197867  [ipw_1250]_b[error_sqr]
ipw_1250_b..  2000   2000   .0479196   4.64e-08   .9995747  [ipw_1250]_b[p_null_0]
ipw_1250_b..  2000      2        .75          0          1  [ipw_1250]_b[reject_null_0]
ipw_1250_b..  2000   2000   .5783327   .0015158   .9994216  [ipw_1250]_b[p_null_true]
ipw_1250_b..  2000      2      .0215          0          1  [ipw_1250]_b[reject_null_true]
ipw_12~x_asd  2000   1999   .0838996   .0250124   .2880833  [ipw_1250]_b[bal_max_asd]
ipw_12~n_asd  2000   2000   .0363113   .0110718   .1563924  [ipw_1250]_b[bal_mean_asd]
ipw_1250~_sd  2000   2000   .9278557   .6502206   2.545267  [ipw_1250]_b[wgt_sd]
ipw_1250_b~v  2000   2000   .9278557   .6502206   2.545267  [ipw_1250]_b[wgt_cv]
ipw_1250_~ss  2000   2000   .1922388   .0790077   .7935672  [ipw_1250]_b[wgt_skewness]
ipw_1250_~is  2000   2000    .071621   .0117921   .7245893  [ipw_1250]_b[wgt_kurtosis]
ipw_1250_b~x  2000   2000    15.0573   5.694828   83.36427  [ipw_1250]_b[wgt_max]
ipw_1000_b~t  2000   2000  -.1008562  -.2808743   .0126107  [ipw_1000]_b[impact_est]
ipw_1000_~or  2000   1998   .0453725     .04142    .051213  [ipw_1000]_b[sd_error]
ipw_1000_~as  2000   2000  -.0008562  -.1808743   .1126107  [ipw_1000]_b[bias]
ipw_1000_~qr  2000   2000   .0014242   1.80e-08   .0327155  [ipw_1000]_b[error_sqr]
ipw_1000_b..  2000   2000       .081   8.43e-10   .9626555  [ipw_1000]_b[p_null_0]
ipw_1000_b..  2000      2      .6135          0          1  [ipw_1000]_b[reject_null_0]
ipw_1000_b..  2000   2000    .571725   .0000708   .9975913  [ipw_1000]_b[p_null_true]
ipw_1000_b..  2000      2      .0225          0          1  [ipw_1000]_b[reject_null_true]
ipw_1000_b..  2000   2000   .0942064   .0197332   .3664674  [ipw_1000]_b[bal_max_asd]
ipw_1000_b..  2000   1999   .0409551   .0103566   .2166926  [ipw_1000]_b[bal_mean_asd]
ipw_1000~_sd  2000   2000   .9349656    .588787   2.851024  [ipw_1000]_b[wgt_sd]
ipw_1000_b~v  2000   2000   .9349656    .588787   2.851024  [ipw_1000]_b[wgt_cv]
ipw_1000_~ss  2000   2000   .2103553   .0853927   .8306735  [ipw_1000]_b[wgt_skewness]
ipw_1000_~is  2000   2000   .0836741    .014125   .7743609  [ipw_1000]_b[wgt_kurtosis]
ipw_1000_b~x  2000   2000   14.36903   5.695074   85.22046  [ipw_1000]_b[wgt_max]
ipw_800_b_~t  2000   1999  -.1005834  -.3525798   .0601172  [ipw_800]_b[impact_est]
ipw_800_b~or  2000   1998   .0507285   .0456633   .0596988  [ipw_800]_b[sd_error]
ipw_800_b~as  2000   2000  -.0005834  -.2525798   .1601172  [ipw_800]_b[bias]
ipw_800_b~qr  2000   2000   .0018752   6.61e-11   .0637966  [ipw_800]_b[error_sqr]
ipw_800_b_..  2000   1999   .1206708   7.23e-10   .9907385  [ipw_800]_b[p_null_0]
ipw_800_b_..  2000      2       .497          0          1  [ipw_800]_b[reject_null_0]
ipw_800_b_..  2000   2000   .5695478   9.03e-06   .9998655  [ipw_800]_b[p_null_true]
ipw_800_b_..  2000      2      .0255          0          1  [ipw_800]_b[reject_null_true]
ipw_800_b_..  2000   2000   .1056854   .0259197   .4262223  [ipw_800]_b[bal_max_asd]
ipw_800_b_..  2000   2000   .0459373   .0077657    .225929  [ipw_800]_b[bal_mean_asd]
ipw_800_~_sd  2000   2000   .9381884   .6096622   3.262035  [ipw_800]_b[wgt_sd]
ipw_800_b_~v  2000   2000   .9381884   .6096622   3.262035  [ipw_800]_b[wgt_cv]
ipw_800_b~ss  2000   2000   .2270629   .0926193   .9276301  [ipw_800]_b[wgt_skewness]
ipw_800_b~is  2000   2000   .0954045   .0161248   .9023561  [ipw_800]_b[wgt_kurtosis]
ipw_800_b_~x  2000   2000   13.57007   5.069063   90.86418  [ipw_800]_b[wgt_max]
ipw_600_b_~t  2000   2000  -.0995294  -.3817973   .0773019  [ipw_600]_b[impact_est]
ipw_600_b~or  2000   1999   .0585477   .0518841   .0716616  [ipw_600]_b[sd_error]
ipw_600_b~as  2000   2000   .0004706  -.2817973   .1773019  [ipw_600]_b[bias]
ipw_600_b~qr  2000   2000   .0025621   7.97e-11   .0794097  [ipw_600]_b[error_sqr]
ipw_600_b_..  2000   2000   .1804632   4.34e-08   .9997602  [ipw_600]_b[p_null_0]
ipw_600_b_..  2000      2       .358          0          1  [ipw_600]_b[reject_null_0]
ipw_600_b_..  2000   2000   .5633937    .000048   .9998792  [ipw_600]_b[p_null_true]
ipw_600_b_..  2000      2       .024          0          1  [ipw_600]_b[reject_null_true]
ipw_60~x_asd  2000   2000   .1217971   .0260376   .5417234  [ipw_600]_b[bal_max_asd]
ipw_60~n_asd  2000   2000   .0529767   .0102849   .2893834  [ipw_600]_b[bal_mean_asd]
ipw_600_~_sd  2000   2000   .9417315   .5543268   3.464636  [ipw_600]_b[wgt_sd]
ipw_600_b_~v  2000   2000   .9417315   .5543268   3.464636  [ipw_600]_b[wgt_cv]
ipw_600_b~ss  2000   2000    .250309   .0953549   .9361289  [ipw_600]_b[wgt_skewness]
ipw_600_b~is  2000   2000   .1122532   .0179982   .9137966  [ipw_600]_b[wgt_kurtosis]
ipw_600_b_~x  2000   2000   12.56515   4.543356   83.90262  [ipw_600]_b[wgt_max]
ipw_500_b_~t  2000   2000  -.0993964  -.4312226   .1195152  [ipw_500]_b[impact_est]
ipw_500_b~or  2000   1998   .0640929   .0555141   .0809665  [ipw_500]_b[sd_error]
ipw_500_b~as  2000   2000   .0006036  -.3312226   .2195152  [ipw_500]_b[bias]
ipw_500_b~qr  2000   2000   .0032116   1.33e-10   .1097084  [ipw_500]_b[error_sqr]
ipw_500_b_..  2000   2000   .2184917   7.60e-09   .9999512  [ipw_500]_b[p_null_0]
ipw_500_b_..  2000      2      .2865          0          1  [ipw_500]_b[reject_null_0]
ipw_500_b_..  2000   2000   .5643934   7.90e-06   .9998516  [ipw_500]_b[p_null_true]
ipw_500_b_..  2000      2       .031          0          1  [ipw_500]_b[reject_null_true]
ipw_50~x_asd  2000   2000   .1353568   .0336385   .4809213  [ipw_500]_b[bal_max_asd]
ipw_50~n_asd  2000   2000   .0593395   .0175717   .2431248  [ipw_500]_b[bal_mean_asd]
ipw_500_~_sd  2000   2000    .951861   .5205168   2.732393  [ipw_500]_b[wgt_sd]
ipw_500_b_~v  2000   2000    .951861   .5205168   2.732393  [ipw_500]_b[wgt_cv]
ipw_500_b~ss  2000   2000   .2696811   .0969446    .894045  [ipw_500]_b[wgt_skewness]
ipw_500_b~is  2000   2000   .1283217   .0200804   .8570202  [ipw_500]_b[wgt_kurtosis]
ipw_500_b_~x  2000   2000   12.14772   3.951477   59.72054  [ipw_500]_b[wgt_max]
ipw_400_b_~t  2000   2000  -.0999939  -.5209058   .0959966  [ipw_400]_b[impact_est]
ipw_400_b~or  2000   2000   .0716309   .0607322   .0860334  [ipw_400]_b[sd_error]
ipw_400_b~as  2000   2000   6.10e-06  -.4209058   .1959966  [ipw_400]_b[bias]
ipw_400_b~qr  2000   2000   .0039841   5.84e-10   .1771617  [ipw_400]_b[error_sqr]
ipw_400_b_..  2000   2000   .2651612   9.60e-10   .9999226  [ipw_400]_b[p_null_0]
ipw_400_b_..  2000      2       .218          0          1  [ipw_400]_b[reject_null_0]
ipw_400_b_..  2000   2000   .5605559   6.31e-07   .9997079  [ipw_400]_b[p_null_true]
ipw_400_b_..  2000      2      .0235          0          1  [ipw_400]_b[reject_null_true]
ipw_400_b_..  2000   1999   .1521513   .0338494   .5868491  [ipw_400]_b[bal_max_asd]
ipw_400_b_..  2000   2000    .067433   .0142321    .299764  [ipw_400]_b[bal_mean_asd]
ipw_400_~_sd  2000   2000   .9640694   .5209469   2.783856  [ipw_400]_b[wgt_sd]
ipw_400_b_~v  2000   2000   .9640694   .5209469   2.783856  [ipw_400]_b[wgt_cv]
ipw_400_b~ss  2000   2000   .2919175   .1039811   .9180606  [ipw_400]_b[wgt_skewness]
ipw_400_b~is  2000   2000   .1473907   .0239846   .8899027  [ipw_400]_b[wgt_kurtosis]
ipw_400_b_~x  2000   2000   11.58126   4.020435   53.60517  [ipw_400]_b[wgt_max]
ipw_200_b_~t  2000   2000  -.0950241  -.6165519   .2616514  [ipw_200]_b[impact_est]
ipw_200_b~or  2000   2000   .1009369   .0820637   .1331585  [ipw_200]_b[sd_error]
ipw_200_b~as  2000   2000   .0049759  -.5165519   .3616514  [ipw_200]_b[bias]
ipw_200_b~qr  2000   2000   .0090936   1.04e-11   .2668259  [ipw_200]_b[error_sqr]
ipw_200_b_..  2000   2000   .4042636   1.11e-08   .9997021  [ipw_200]_b[p_null_0]
ipw_200_b_..  2000      2       .118          0          1  [ipw_200]_b[reject_null_0]
ipw_200_b_..  2000   2000   .5516242   2.06e-06   .9999733  [ipw_200]_b[p_null_true]
ipw_200_b_..  2000      2       .043          0          1  [ipw_200]_b[reject_null_true]
ipw_200_b_..  2000   2000   .2262554   .0456355   .9568684  [ipw_200]_b[bal_max_asd]
ipw_200_b_..  2000   2000   .1010494   .0200982   .6275848  [ipw_200]_b[bal_mean_asd]
ipw_200_~_sd  2000   2000   1.016049   .4555074   4.196246  [ipw_200]_b[wgt_sd]
ipw_200_b_~v  2000   2000   1.016049   .4555074   4.196246  [ipw_200]_b[wgt_cv]
ipw_200_b~ss  2000   2000   .3694437   .0842924   .9682499  [ipw_200]_b[wgt_skewness]
ipw_200_b~is  2000   2000   .2219209   .0316999   .9580271  [ipw_200]_b[wgt_kurtosis]
ipw_200_b_~x  2000   2000    10.0788   3.107341   59.56403  [ipw_200]_b[wgt_max]
ipw_100_b_~t  2000   2000  -.0891305  -1.289533   .5562183  [ipw_100]_b[impact_est]
ipw_100_b~or  2000   1999   .1417676   .1032674   .2143243  [ipw_100]_b[sd_error]
ipw_100_b~as  2000   2000   .0108695  -1.189533   .6562183  [ipw_100]_b[bias]
ipw_100_b~qr  2000   2000   .0232332   1.73e-10    1.41499  [ipw_100]_b[error_sqr]
ipw_100_b_..  2000   2000   .4688463   1.28e-11   .9998613  [ipw_100]_b[p_null_0]
ipw_100_b_..  2000      2       .088          0          1  [ipw_100]_b[reject_null_0]
ipw_100_b_..  2000   2000   .5243853   2.83e-10   .9999232  [ipw_100]_b[p_null_true]
ipw_100_b_..  2000      2      .0575          0          1  [ipw_100]_b[reject_null_true]
ipw_100_b_..  2000   2000    .344496   .0752627   1.301122  [ipw_100]_b[bal_max_asd]
ipw_100_b_..  2000   2000   .1610314   .0340866   .8891259  [ipw_100]_b[bal_mean_asd]
ipw_100_~_sd  2000   1996   1.110223   .3804888   4.451409  [ipw_100]_b[wgt_sd]
ipw_100_b_~v  2000   1996   1.110223   .3804888   4.451409  [ipw_100]_b[wgt_cv]
ipw_100_b~ss  2000   2000   .4590171   .0933158   .9693429  [ipw_100]_b[wgt_skewness]
ipw_100_b~is  2000   2000   .3228476   .0478972   .9599043  [ipw_100]_b[wgt_kurtosis]
ipw_100_b_~x  2000   2000   8.955297   2.437315   44.84005  [ipw_100]_b[wgt_max]
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. save sims/sim1.dta
file sims/sim1.dta saved

. 
. log close sims1
      name:  sims1
       log:  C:\Users\kkranker\Documents\Stata\Ado\Devel\gmatch\sims/sims1.log
  log type:  text
 closed on:  26 Oct 2018, 11:27:31
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
